loadscriptcb(`^1.1
如是我聞：一時。
^2.1
婆伽婆#2.105
^3.1
住王舍城。
^3.2
耆闍崛（Gṛdhrakūṭa）山#3.14中。
^3.3
共摩訶比丘僧。
^3.4
大數五千分。
^3.5
皆是阿羅漢。
^3.6
諸漏已盡。
^3.7
無復煩惱。
^3.8
心得好解脫，慧得好解脫。#3.73
^3.9
心調柔軟。
^3.10
摩訶那伽（mahānāga）。
^3.11
所作已辦。
^3.12
棄擔能擔。
^3.13
逮得#3.98己利。
^3.14
盡諸有結。
^3.15
正智已得解脫。
^3.16
唯除阿難在學地，得須陀洹。
^3.17
復有五百比丘尼、優婆塞、優婆夷，皆見聖諦。
^4.1
復有菩薩摩訶薩。@t25p84c
^5.1
摩訶薩埵。
^5.2
%8.0 壹、以三事（得陀羅尼、得諸三昧、已得等忍）讚菩薩功德
@t25p95c皆得陀羅尼及諸三昧，行空、無相、無作，已得等忍。
^5.3
得無礙陀羅尼。
^5.4
悉是五通。
^5.5
言必信受。
^5.6
無復懈怠。
^5.7
已捨利養、名聞。#5.111
^5.8
說法無所悕望。
^5.9
度甚深法忍。
^5.10
得無畏力。
^5.11
過諸魔事。
^5.12
一切業障悉得解脫。
^5.13
巧說因緣法。
^5.14
從阿僧祇劫已來，發大誓願。
^5.15
顏色和悅，常先問訊，所語不麁。
^5.16
於大眾中得無所畏。
^5.17
無數億劫說法巧出。#5.194
^6.1
解了諸法：（1）如幻#6.1、（2）如焰、（3）如水中月、（4）如虛空、（5）如響、（6）如犍闥婆城#6.2、（7）如夢、（8）如影、（9）如鏡中像、（10）如化。@t25p101c
^6.2
得無礙無所畏。
^6.3
悉知眾生心行所趣，以微妙慧而度脫之。
^6.4
意無罣礙。
^6.5
大忍成就。
^6.6
如實巧度。
^7.1
願受無量諸佛世界。#7.1
^7.2
念無量佛土，諸佛三昧常現在前。#7.8
^7.3
能請無量諸佛。
^7.4
能斷種種見、纏及諸煩惱。
^7.5
遊戲出生百千三昧#7.38。
^7.6
諸菩薩如是等無量功德成就。#7.41
^7.7
其名曰：颰陀婆羅菩薩（秦言善守）、剌那伽羅菩薩（秦言寶積）、導師菩薩、那羅達菩薩、星得菩薩、水天菩薩、主天菩薩、大意菩薩、益意菩薩、增意菩薩、不虛見菩薩、善進菩薩、勢勝菩薩、常勤菩薩、不捨精進菩薩、日藏菩薩、不缺意菩薩、觀世音菩薩、文殊尸利菩薩（秦言妙德）#7.43、執寶印菩薩、常舉手菩薩、彌勒菩薩，如是等無量千萬億那由他諸菩薩摩訶薩，皆是補處紹尊位者。
^7.8
爾時，世尊自敷#7.50師子座，結加趺坐，直身繫念在前，入三昧王三昧，一切三昧悉入其中。
^7.9
爾時，世尊從三昧安庠#7.70而起，以天眼觀視世界，舉身微笑。
^7.10
從足下千輻相輪中，放六百萬億光明。#7.82
^7.11
足十指、兩踝、兩𨄔#7.85、兩膝、兩髀#7.86、腰、脊、腹、背、臍、心、胸德字、~206肩、臂、手十指、項、口、四十齒、鼻兩孔、兩眼、兩耳、白毫相、肉髻，各各放六百萬億光明。
^7.12
從是諸光出大光明，遍照三千大千世界。從三千大千世界，遍照東方如恒河沙等諸世界，南西北方、四維、上下亦復如是。若有眾生遇斯光者，必得阿耨多羅三藐三菩@t25p113c提。
^7.13
光明出過東方如恒河沙等世界，乃至十方亦復如是。#7.91
^7.14
爾時，世尊舉身毛孔皆亦微笑而放光明，遍照三千大千世界，復至十方如恒河沙等世界。若有眾生遇斯光者，必得阿耨多羅三藐三菩提。
^8.1
爾時，世尊以常光明遍照三千大千世界，亦至東方如恒河沙等諸佛世界，乃至十方亦復如是。若有眾生遇斯光者，必得阿耨多羅三藐三菩提。
^8.2
爾時，世尊出廣長舌相，遍覆三千大千世界，熙怡#8.6而笑。從其舌根出無量千萬億光，是一一光化成千葉金色寶華。是諸華上，皆有化佛結加趺坐，說六波羅蜜；眾生聞者，必得阿耨多羅三藐三菩提。復至十方如恒河沙等諸佛世界，皆亦如是。
^8.3
爾時，世尊故在師子座，入師子遊戲三昧#8.48，以神通力感動三千大千世界，六種震動。
^8.4
東涌#8.56西沒，西涌東沒；南涌北沒，北涌南沒；邊涌中沒，中涌邊沒。
^8.5
地皆柔軟，令眾生和悅。
^8.6
是#8.69三千大千世界中地獄、餓鬼、畜生及八難處，即時解脫，得生天上，從四天王天處乃至他化自在天處。
^8.7
是諸天人自識宿命，皆大歡喜，來詣佛所，頭面禮佛足，却住一面。
^8.8
如是十方如恒河沙等世界，地皆六種震動；一切地獄、餓鬼、畜生及餘八難處，即得解脫，得生天上，齊第六天#8.88。
^8.9
爾時，三千大千世界眾生，盲者得視#8.90，聾者得聽，啞者能言，狂者得正，亂者得定，裸者得衣，飢渴者得飽滿，病者得愈，形殘者得具足。
^8.10
一切眾生皆得等心相視：如父如母、如兄如弟、如姊如妹，亦如親親#8.134及善知~231識。是時，眾生等行十善業道，淨修梵行，無諸瑕穢，惔#8.135然快樂，譬如比丘入第三禪；皆得好慧，持戒、自守，不嬈眾生。
^9.1
爾時，世尊在師子座上坐，於三千大千世界中，其德特尊，光明色像威德巍巍#9.3，遍至十方如恒河沙等諸佛世界。譬如須彌山王光色殊特，眾山無能及者。
^9.2
爾時，世尊以常身示此三千大千世界一切眾生。
是時首陀會天#9.30、梵眾天#9.31、他化自在天、化自樂天、兜率陀天、夜磨#9.32天、三十三天、四天王天，及三千大千世界人與非人，以諸天華、天瓔珞、天澤香、天末香、天青蓮華、赤蓮華、白蓮華、紅蓮華、天樹葉#9.33香，持詣佛所。
^9.3
是諸天華乃至天樹葉香以散佛上。
^9.4
所散寶華，於此三千大千世界上，在虛空中化成大臺。
^9.5
是華臺邊垂諸瓔珞，雜色華蓋，五色繽紛。是諸華蓋、瓔珞遍滿三千大千世界。
^9.6
以是華蓋、瓔珞嚴飾故，此三千大千世界皆作金色，及十方如恒河沙等諸佛世界皆亦如是。
^9.7
爾時，三千大千世界及十方眾生各各自@t25p123c念：佛獨為我說法，不為餘人。
^9.8
爾時，世尊在師子座熙怡#9.63而笑，光從口出#9.64，遍照三千大千世界。以此光故，此間三千大千世界中眾生皆見東方恒河沙諸佛及僧，彼間恒河沙等世界中眾生亦見此間三千大千世界中釋迦牟尼佛及諸大眾；南西北方、四維、上下亦復如是。
^9.9
是時，東方過如恒河沙等諸佛世界，其世界最在邊，世界名多寶，佛號寶積，今現在為諸菩薩摩訶薩說般若波羅蜜。
^9.10
爾時，彼世界有菩薩，名曰普明。
^9.11
見此大光，見地大動，又見佛身。到寶積佛所，白佛言：「世尊！今何因緣有此光明照於世間，地大震動，又見佛身？」
^10.1
寶積佛報普明言：「善男子！西方度如恒河沙等世界，有世界名娑婆，是中有佛，號釋迦牟尼，今現在欲為諸菩薩摩訶薩說般若波羅蜜，是其神力。」
^10.2
是時，普明菩薩白寶積佛言：「世尊！我今當往見釋迦牟尼佛，禮拜、供養；及見彼諸菩薩摩訶薩紹#10.18尊位者，皆得陀羅尼及諸三昧，於諸三昧而得自在。」
^10.3
佛告普明：「欲往隨意，宜知是時。」
爾時，寶積佛以千葉金色蓮華與普明菩薩而告之曰：「善男子！汝以此華散釋迦牟尼佛上。生彼娑婆世界諸菩薩，難勝難及#10.26，汝當一心遊彼世界！」
^10.4
爾時，普明菩薩從寶積佛受千葉金色蓮花，與無數出家、在家菩薩，及諸童男、童女，俱共發引#10.56。
^10.5
皆供養、恭敬、尊重、讚歎東方諸佛。
^10.6
持諸華、香、瓔珞、末香、澤香、燒香、塗香、衣服、幢蓋，向釋迦牟尼佛所。到已，頭面禮佛足，一面立。
^10.7
白佛言：「寶積如來致問世尊：少惱、少患、興居輕利，氣力安樂不？」又以此千葉金色蓮華，供養世尊。
^10.8
爾時，釋迦牟尼佛受是千葉金色蓮華已，散東方#10.88恒河沙等世界中佛。
^10.9
~273所散蓮華，滿東方如恒河沙等諸佛世界。
^10.10
一一華上皆有菩薩，結加#10.106趺坐，說六波羅蜜；聞此法者，畢#10.107至阿耨多羅三藐三菩提。
^10.11
諸出家、在家菩薩，及諸童男、童女，頭面禮釋迦牟尼佛足，各以供養具，供養恭敬，尊重讚歎釋迦牟尼佛。
是諸出家、在家菩薩，及諸童男、童女，各各以善根福德力故，得供養@t25p133a~274釋迦牟尼佛#10.111多陀阿伽度、阿羅呵、三藐三佛陀。
^10.12
南方度如恒河沙等諸佛世界，其土#10.125最在邊，世界名離一切憂，佛號無憂德，菩薩名離憂。
西方度如恒河沙等諸佛世界，其世界最在邊，世界名滅惡，佛號寶山，菩薩名儀意。
北方度如恒河沙等諸佛世界，其世界最在邊，世界名勝，佛號勝王，菩薩名得勝。
下方度如恒河沙等諸佛世界，其世界最在邊，世界名善，佛號善德，菩薩名華上。
上方度如恒河沙等諸佛世界，其世界最在邊，世界名喜#10.126，佛號喜德，菩薩名得喜。如是一切，皆如東方。#10.127
^10.13
爾時，是三千大千世界，變#10.134成為寶，華遍覆地，懸繒#10.135幡蓋，香樹、華樹，皆悉莊嚴。
^10.14
譬如華積世界、普華世界，妙德菩薩#10.148、善@t25p134b住意菩薩，及餘大威神諸菩薩，皆在彼住。
^10.15
爾時，佛知一切世界，若天世界，若魔世界，若梵世界；若沙門、若婆羅門及天，若揵闥婆、人、阿修羅等，及諸菩薩摩訶薩紹尊位者一切#10.157皆集。
^11.1
@t25p136a佛告舍利弗。
^11.2
「菩薩摩訶薩欲以一切種知一切法，當習行般若波羅蜜。」
^11.3
舍利弗白佛言：「世尊！菩薩摩訶薩云何欲以一切種知一切法，當習行般若波羅蜜？」
^11.4
佛告舍利弗：「菩薩摩訶薩以不住法住般若波羅蜜中，以無所捨法具足檀波羅蜜，施者、受者及財物不可得故。」
^12.1
〔佛告舍利弗：「菩薩摩訶薩以不住法住般若波羅蜜中，以無所捨法具足檀波羅蜜，施者、受者及財物不可得故。」@t25p139a24-@t25p326〕
^13.1
罪、不罪不可得故，應具足尸羅波羅蜜。@t25p153b
^14.1
@t25p164b心不動故，應具足羼提波羅蜜。
^15.1
身心精進不懈息#15.121故，應具足毘梨耶波羅蜜。
^17.1
不亂不味故，應具足禪波羅蜜。
^18.1
於一切法不著故，應具足般若波羅蜜。
^19.1
菩薩摩訶薩以不住法住般若波羅蜜中#19.1，不生故，應具足四念處、四正懃、四如意足、五根、五力、七覺分、八聖道分。#19.2
^20.1
空三昧、無相三昧、無作三昧，四禪，四無量心，四無色定，八背捨，八勝處，九次第定，十一切處。
^21.1
九相#21.84：脹相、壞相、血塗相、膿爛相、青相、噉相、散相、骨相、燒相。
^21.2
念佛、念法、念僧、念戒、念捨、念天、念入出息、念死。
^23.1
十想：無常想、苦想、無我想、食不淨想、一切世間不可樂想、死想、不淨想、斷想、離欲想、盡想。
^23.2
十一智：（1）法智、（2）比智、（3）他心智、（4）世智、（5）苦智、（6）集智、（7）滅智、（8）道智、（9）盡智、（10）無生智、（11）如實智。
^23.3
三三昧：有覺有觀三昧，無覺有觀三昧，無覺無觀三昧。
^23.4
三根：未知欲知根，知根，知已根。
^24.1
舍利弗！菩薩摩訶薩欲遍知佛十力、四無所畏、四無礙智、十八不共法、大慈大悲，當習@t25p235b行般若波羅蜜！#24.1
^27.1
大慈大悲，當習行般若波羅密#27.1。
^27.2
菩薩摩訶薩欲得道#27.33慧，當習行般若波羅蜜！菩薩摩訶薩欲以道慧具足道種慧，當習行般若波羅蜜！#27.34
^27.3
欲以道種慧具足一切智，當習行般若波羅蜜！欲以一切智具足一切種智，當習行般若波羅蜜！
^27.4
「欲以一切種智斷煩惱習，當習行般若波羅蜜！舍利弗！菩薩摩訶薩應如是學般若波羅蜜！」
^27.5
復次，舍利弗！菩薩摩訶薩欲上菩薩位，當學般若波羅蜜！
^27.6
欲過聲聞、辟支佛地，住阿鞞跋致地，當學般若波羅蜜！
^28.1
菩薩摩訶薩欲住六神通#28.1，當學般若波羅蜜。
^28.2
欲知一切眾生意所趣向，當學般若波羅蜜。
^28.3
菩薩摩訶薩欲勝一切聲聞、辟支佛智慧，當學般若波羅蜜。
^28.4
欲得諸陀羅尼門、諸三昧門，當學般若波羅蜜。
^28.5
#28.121
一切求聲聞、辟支佛人布施時，欲以隨喜心過其上者，當學般若波羅蜜。
一切求聲聞、@t25p269c辟支佛人持戒時，欲以隨喜心過其上者，當學般若波羅蜜。#28.122
一切求聲聞、辟支佛人三昧、智慧、解脫、解脫知見，欲以隨喜心過其上者，當學般若波羅蜜。
^29.1
#29.2一切求聲聞、辟支佛人諸禪、定、解脫、三昧，欲以隨喜心過其上者，當學般若波羅蜜。
^29.2
菩薩摩訶薩行#29.16少施、少戒、少忍、少進、少禪、少智，欲以方便力迴向故，而得無量無邊功德者，當學般若波羅蜜！
^29.3
菩薩摩訶薩欲行檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜，當學般若波羅蜜！
^29.4
菩薩摩訶薩欲使世世身體與佛相似，欲具足三十二相、八十隨形好，當學般若波羅蜜！
^29.5
欲生菩薩家，欲得鳩摩羅伽地，欲得不離諸佛，當學般若波羅蜜。
^30.1
「欲以諸善根供養諸佛，恭敬、尊重、讚歎，隨意成就者，當學般若波羅蜜！」
^30.2
欲滿一切眾生所願：衣服、飲食、臥具、塗香、車乘、房舍、床榻#30.21、燈燭等，當學般若波羅蜜！
^30.3
復次，舍利弗！菩薩摩訶薩欲使如恒河沙等世界眾生，立於檀波羅蜜，立於尸羅、羼提、毘梨耶、禪、般若波羅蜜，當學般若波羅蜜！
^30.4
欲殖一善根於佛福田中，至得阿耨多羅三藐三菩提不盡者，當學般若波羅蜜！
^30.5
復次，舍利弗！菩薩摩訶薩欲令十方諸佛稱讚其名，當學般若波羅蜜！
^30.6
復次，舍利弗！菩薩摩訶薩欲一發意至十方如恒河沙等世界，當學般若波羅蜜！
^30.7
復次，舍利弗！菩薩摩訶薩欲發一音使十方如恒河沙等世界聞聲，當學般若波羅蜜！
^30.8
復次，舍利弗！菩薩摩訶薩欲使諸佛世界不斷者，當學般若波羅蜜！
^31.1
復次，舍利弗！菩薩摩訶薩欲住（1）內空、（2）外空、（3）內外空、（4）空空、（5）大空、（6）第一義空、（7）有為空、（8）無為空、（9）畢竟空、（10）無始空、（11）散空、（12）性空、（13）自相空、（14）諸法空、（15）不可得空、（16）無法空、（17）有法空、（18）無法有法空，當學般若波羅蜜！
^32.1
菩薩摩訶薩欲知諸法因緣、次第緣、緣緣、增上緣，當學般若波羅蜜。#32.2
^32.2
復次，舍利弗！菩薩摩訶薩欲知一切#32.56諸法如、法性、實際，當學般若波羅蜜！舍利弗！菩薩摩訶薩應如是住般若波羅蜜！
^32.3
復次，舍利弗！菩薩摩訶薩欲數知三千大千世界中大地諸山微塵，當學般若#32.98波羅蜜！
菩薩摩訶薩欲析一毛為百分，欲以一分毛盡舉三千大千世界中大海江河池泉諸水而不擾水性者，當學般若波羅蜜！
三千大千世界中，諸火一時皆然，譬如劫盡燒時；菩薩摩訶薩欲一吹令滅者，當學般若波羅蜜！
三千大千世界中，諸大風起，欲吹破三千大千@t25p299b世界及諸須彌山，如摧腐草；菩薩摩訶薩欲以一指障其風力令不起者，當學般若波羅蜜！
^32.4
菩薩摩訶薩欲一結加趺坐遍滿三千大千世界中虛空者，當學般若波羅蜜！
^32.5
復次，菩薩摩訶薩欲以一毛舉三千大千世界#32.112中諸須彌山王，擲過他方無量阿僧祇諸佛世界，不擾眾生者，當學般若波羅蜜#32.113！
^32.6
欲以一食供養十方各如恒河沙等諸佛及僧，當學般若波羅蜜！欲以一衣、華香、瓔珞、末香、塗香、燒香、燈燭、幢幡、華蓋等供養諸佛及僧，當學般若波羅蜜！
^32.7
復次，舍利弗！菩薩摩訶薩欲使十方各如恒河沙等世界中眾生，悉具於戒、三昧、智慧、解脫、解脫知見，令得須陀洹果、斯陀含果、阿那含果、阿羅漢果，乃至令得無餘涅槃，當學般若波羅蜜！
^32.8
復次，舍利弗！菩薩摩訶薩行般若波羅蜜布施時，應作如是分別：如是布施，得大果報；如是布施，得生剎利大姓、婆羅門大姓、居士大家；如是布施，得生四天王天處、三十三天、夜摩天、兜率陀天、化樂天、他化自在天；因是布施，得入初禪、二禪、三禪、四禪，無邊空處、無邊識處、無所有處、非有想非無想處；因是布施，能生八聖道分；因是布施，能得須陀洹道乃至佛道，當學般若波羅蜜！
^32.9
「復次，舍利弗！菩薩摩訶薩行般若波羅蜜布施時，以慧方便力故，能具足檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜。」
舍利弗白佛言：「世尊！菩薩摩訶薩云何布施時，以慧方便力故，具足檀波羅蜜乃至般若波羅蜜？」
佛告舍利弗：「施人、受人、財物不可得故，能具足檀波羅蜜；罪、不罪不可得故，具足尸羅波羅蜜；心不動故，具足羼提波羅蜜；身心精進不懈息#32.154故，具足毘梨耶波羅蜜；不亂不味故，具足禪波羅蜜；知一切法不可得故，具足般若波羅蜜。」
^32.10
復次，舍利弗！菩薩摩訶薩欲得過去、未來、現在諸佛功德者，當學般若波羅蜜！
^33.1
復次，舍利弗！菩薩摩訶薩欲到有為、無為法彼岸者，當學般若波羅蜜！
^33.2
菩薩摩訶薩欲知過去、未來、現在諸法如、諸法法相、無生際者，當學般若波羅蜜。
^33.3
復次，舍利弗！菩薩摩訶薩欲在一切聲聞、辟支佛前，欲給侍諸佛，欲為諸佛內眷屬，欲得大眷屬，欲得菩薩眷屬，欲得淨報大施，當學般若波羅蜜！
^33.4
復次，舍利弗！菩薩摩訶薩欲不起慳心、破戒心、瞋恚心、懈怠心、亂心、癡心者，當學般若波羅蜜！
^33.5
復次，舍利弗！菩薩摩訶薩欲使一切眾生立於布施福處、持戒福處、修定福處、勸導福處，欲令眾生立於財福、法福處，當學般若波羅蜜！
^33.6
復次，舍利弗！菩薩摩訶薩欲得五眼者，當學般若波羅蜜！
^33.7
菩薩摩訶薩欲以天眼見十方如恒河沙等世界中諸佛，欲以天耳聞十方諸佛所說法，欲知諸佛心，當學般若波羅蜜！
^33.8
欲聞十方諸佛所說法，聞已乃至阿耨多羅三藐三菩提不忘者，當學般若波羅蜜！
^33.9
復次，舍利弗！菩薩摩訶薩欲見過去、未來諸佛世界，及見現在十方諸佛世界，當學般若波羅蜜！
^33.10
復次，舍利弗！菩薩摩訶薩欲聞十方諸佛所說十二部經：修多羅（sūtra）、祇夜（geya）、受記經（vyākaraṇa）、伽陀（gāthā）、優陀那（udāna）、因緣經（nidāna）、阿波陀那（avadāna）、如是語經（itivṛttaka）、本生經（jātaka）、廣經（vaipulya）、未曾有經（adbhuta-dharma）、論議經（upadeśa），諸聲聞等聞與不聞，盡欲誦受持者，當學般若波羅蜜！
^34.1
復次，舍利弗！菩薩摩訶薩，十方如恒河沙等世界中諸佛所說法：已說、今說、當說，聞已，欲一切信持、自行、亦為人說者，當學般若波羅蜜！
^34.2
復次，舍利弗！菩薩摩訶薩，過去諸佛說已，未來諸佛當說，欲聞，聞已，自利亦利他人，當學般若波羅蜜！
^34.3
十方如恒河沙等諸世界，中間闇處，日月所不照，欲持光明普照者，當學般若波羅蜜！
^34.4
十方如恒河沙等世界中，無有佛名、法名、僧名；欲使一切眾生皆得正見、聞三寶音者，當學般若波羅蜜！
^34.5
菩薩摩訶薩#34.16，欲令十方如恒河沙等世界中眾生，以我力故，盲者得視、聾者得聽、狂者得念、裸者得衣、飢渴者得飽滿者，當學般若波羅蜜！
^34.6
復次，舍利弗！菩薩摩訶薩，若欲令十方如恒沙等世界中眾生，諸在三惡趣者，以我力故皆得人身者，當學般若波羅蜜！
^34.7
~978欲令十方如恒河沙等世界中眾生，以我力故，立於戒、三昧、智慧、解脫、解脫知見，令得須陀洹果，乃至阿耨多羅三藐三菩提者，當學般若波羅蜜！
^34.8
復次，舍利弗！菩薩摩訶薩欲學諸佛威儀者，當學般若波羅蜜！
^34.9
復次#34.27，菩薩摩訶薩欲得如象王視觀者，當學般若波羅蜜！
菩薩作是願：使我行時離地四指，足不蹈地。我當共四天王天乃至阿迦尼吒天#34.28，~979無量千萬億諸天眾圍繞恭敬，至菩提樹下者，當學般若波羅蜜！
^34.10
我當於菩提樹下坐，四天王天乃至阿迦尼吒天，以天衣為座者，當學般若波羅蜜！
^34.11
我得阿耨多羅三藐三菩提時，行、住、坐、臥處，欲使悉為金剛者，當學般若波羅蜜！
^34.12
復次，舍利弗！菩薩摩訶薩欲出家日即成阿耨多羅三藐三菩提；即是日轉法輪。轉法輪時，無量阿僧祇眾生遠塵離垢，諸法中得法眼淨；無量阿僧祇眾生，一切法不受故，諸漏心得解脫；無量阿僧祇眾生於阿耨多羅三藐三菩提得不退轉者，當學般若波羅蜜！
^34.13
我得阿耨多羅三藐三菩提時，以無量阿僧祇聲聞為僧；我一說法時，便於座上盡得阿羅漢者，當學般若波羅蜜！
^34.14
我當以無量阿僧祇菩薩摩訶薩為僧；我一說法時，無量阿僧祇菩薩皆得阿鞞跋致！
^34.15
欲得壽命無量、光明具足者，當學般若波羅蜜！
^34.16
我成阿耨多羅三藐三菩提時，世界中無有婬欲、瞋恚、愚癡，亦無三毒之名。
一切眾生成就如是智慧，善施、善戒、善定、善梵行、善不嬈眾生者，當學般若波羅蜜。
^34.17
使我般涅槃後，法無滅盡，亦無滅盡之名，@t25p313a當學般若波羅蜜。
^34.18
我得阿耨多羅三藐三菩提時，十方如恒河沙等世界中眾生聞我名者，必得阿耨多羅三藐三菩提。欲得如是等功德者，當學般若波羅蜜。
^35.1
佛告舍利弗：「若菩薩摩訶薩行般若波羅蜜，能作是功德，是時四天王皆大歡喜，意念言：『我等當以四鉢奉上菩薩，如前天王奉先佛鉢。』
^35.2
三十三天乃至他化自在天亦皆歡喜，意念言：『我等當給侍供養菩薩，減損阿修羅種，增益諸天眾。』
三千大千世界，四天王天乃至阿迦尼吒天#35.21皆大歡喜，意念言：『我等當請是菩薩轉法輪』。
^35.3
舍利弗！是菩薩摩訶薩行般若波羅蜜，增益六波羅蜜時，諸善男子、善女人各各歡喜，意念言：『我等當為是人作父母、妻子、親族、知識。』
^35.4
爾時，四天王#35.51乃至阿迦尼吒天皆大歡喜，各自念言：『我等當作方便，令是菩薩離於婬欲，從初發意常作童真，莫使與色欲共會；若受五欲，障生梵天，何況阿耨多羅三藐三菩提！』以是故，舍利弗！菩薩摩訶薩斷婬欲出家者，應得阿耨多羅三藐三菩提，非不斷欲。」
^35.5
舍利弗白佛言：「世尊！菩薩摩訶薩要當有父母、妻子、親族、知識耶？」
佛告舍利弗：「（1）或有菩薩有父母、妻子、親族、知識；（2）或有菩薩，從初發意斷婬欲，修童真行，乃至得阿耨多羅三藐三菩提，不犯色欲；（3）或有菩薩方便力故，受五欲已，出家得阿耨多羅三藐三菩提。
^35.6
譬如幻師、若幻弟子，善知幻法，幻作五欲，@t25p317c於中共相娛樂。於汝意云何？是人於此五欲，頗實受不？」
舍利弗言：「不也！世尊！」
佛告舍利弗：「菩薩摩訶薩以方便力故化作五欲，於中受樂，成就眾生，亦復如是。是菩薩摩訶薩不染於欲，種種因緣，毀訾五欲：欲為熾然，欲為穢惡，欲為毀壞，欲為如怨！是故，舍利弗！當知菩薩為眾生故受五欲。」
^35.7
舍利弗白佛言：「菩薩摩訶薩云何應行般若波羅蜜？」
佛告舍利弗：「菩薩摩訶薩行般若波羅蜜時，不見菩薩，不見菩薩字，不見般若波羅蜜，亦不見我行般若波羅蜜，亦不見我不行般若波羅蜜。
何以故？菩薩、菩薩字性空，空中無色，無受、想、行、識；離色亦無空，離受、想、行、識亦無空。空即是色，色即是空；空即是受、想、行、識，受、想、行、識即是空。何以故？舍利弗！但有名字故，謂為菩提；但有名字故，謂為菩薩；但有名字故，謂為空。
所以者何？諸法實性，無生、無滅、無垢、無淨故。
菩薩摩訶薩如是行，亦不見生，亦不見滅，亦不見垢，亦不見淨。何以故？名字是因緣和合作法，但以分別憶想假名說。
是故菩薩摩訶薩行般若波羅蜜時，不見一切名字，不見故不著。」
^35.8
佛告舍利弗：「菩薩摩訶薩行般若波羅蜜時，應如是思惟：『菩薩但有字，佛亦但有字，般若波羅蜜亦但有字；色但有字，受、想、行、識亦但有字。』
舍利弗！如我但有字，一切我常不可得，眾生、壽者、命者、生者、養育、眾數、人、作者、使作者、起者、使起者、受者、使受者、知者、見者，是一切皆不可得；不可得空故，但以名字說。
菩薩摩訶薩亦如是行般若波羅蜜，不見我、不見眾生，乃至不見知者、見者，所說名字亦不可見。
^35.9
%31.25 貳、讚歎菩薩智慧勝一切二乘#35.116
~1016
%31.26 （壹）菩薩行般若，用不可得空故，智慧勝過二乘
菩薩摩訶薩作如是行般若波羅蜜，除佛智慧，過一切聲聞、辟支佛上，用不可得空故。所以者何？是菩薩摩訶薩諸名字法、名字所著處亦不可得故。舍利弗！菩薩摩訶薩能如是行，為行般若波羅蜜。
%31.27 （貳）舉滿閻浮提喻辨優劣
譬如滿閻浮提竹、麻、稻、茅#35.117，諸比丘其數如是，智慧如舍利弗、目連等，欲比菩薩行般若波羅蜜智慧，百分不及一，千分、百千分乃至算數譬喻所不能及。何@t25p320a以故？菩薩摩訶薩用智慧度脫一切眾生故。
^35.10
舍利弗！置#35.130閻浮提滿中如舍利弗、目連等，若滿三千大千世界如舍利弗、目連等。
復置是事，若滿十方如恒河沙等世界如舍利弗、目連等智慧，欲比菩薩行般若波羅蜜智慧，百分不及一，千分、百千分乃至算數譬喻所不能及。
^35.11
復次，舍利弗！菩薩摩訶薩行般若波羅蜜一日修智慧，出過一切聲聞、辟支佛上。」
^35.12
舍利弗白佛言：「世尊！聲聞所有智慧──若須陀洹、斯陀含、阿那含、阿羅漢，辟支佛智慧，佛智慧，是諸眾智無有差別、不相違背、無生、性空。
若法不相違背、無生、性空，是法無有別異；云何世尊言『菩薩摩訶薩行般若波羅蜜一日修智慧，出過聲聞、辟支佛上』？」#35.137
^35.13
佛告舍利弗：「於汝意云何？菩薩摩訶薩行般若波羅蜜一日修智慧，心念：『我行道慧益一切眾生，當以一切種智知一切法、度一切眾生。』諸聲聞、辟支佛智慧為有是事不？」
舍利弗言：「不也！世尊！」
^35.14
「舍利弗！於汝意云何？諸聲聞、辟支佛頗有是念『我等當得阿耨多羅三藐三菩提，度一切眾生，令得無餘涅槃』不？」
舍利弗言：「不也！世尊！」
~1025佛告舍利弗：「以是因緣故，當知諸聲聞、辟支佛智慧欲比菩薩摩訶薩智慧，百分不及一，乃至算數譬喻所不能及。
^35.15
舍利弗！於汝意云何？諸聲聞、辟支佛頗有是念：『我行六波羅蜜，成就眾生，莊嚴世界，具佛十力、四無所畏、四無礙智、十八不共法，度脫無量阿僧祇眾生令得涅槃』不？」
舍利弗言：「不也！世尊！」
^35.16
佛告舍利弗：「菩薩摩訶薩能作是念：『我當行六波羅蜜乃至十八不共法，成阿耨多羅三藐三菩提，度脫無量阿僧祇眾生令得涅槃。』
%31.110 （1）舉螢火喻二乘劣
譬如螢火虫不作是念：『我力能照一#35.165@t25p322b閻浮提普令大明。』諸阿羅漢、~1026辟支佛亦如是，不作是念：『我等行六波羅蜜乃至十八不共法，得阿耨多羅三藐三菩提，度脫無量阿僧祇眾生令得涅槃。』
^35.17
舍利弗！譬如日出時，光明遍照閻浮提，無不蒙明者；菩薩摩訶薩亦如是，行六波羅蜜乃至十八不共法，得阿耨多羅三藐三菩提，度脫無量阿僧祇眾生令得涅槃。」
^36.1
舍利弗白佛言：「云何菩薩摩訶薩（1）過聲聞、辟支佛地，（2）住阿鞞#36.1跋致地，（3）淨佛道？」
^36.2
佛告舍利弗：「菩薩摩訶薩從初發意行六波羅蜜#36.7，住空、無相、無作法，（1）能過一切聲聞、辟支佛地，（2）住阿毘跋致地，（3）淨佛道。」
^36.3
舍利弗白佛言：「菩薩摩訶薩住何等地能為諸聲聞、辟支佛作福田？」
^36.4
佛告舍利弗：「菩薩摩訶薩從初發意行六波羅蜜，乃至坐道場，於其中間常為諸聲聞、辟支佛作福田。
^36.5
何以故？以有菩薩摩訶薩因緣故，世間諸@t25p323b善法生。
^36.6
何等是善法？所謂十善道、五戒、八分成就齋#36.19，四禪、四無量心、四無色定，四念處、四正勤、四如意足、五根、五力、七覺分、八聖道分，盡現於世。
以菩薩因緣故，六波羅蜜、十八空，佛十力、四無所畏、四無礙智、十八不共法、大慈、大悲、一切種智，盡現於世。
以菩薩因緣故，有剎利大姓、婆羅門大姓、居士大家，四天王天乃至非有想非無想天，皆現於世。
以菩薩因緣故，有須陀洹、斯陀含、阿那含、阿羅漢、辟支佛、佛，皆現於世。」
^36.7
舍利弗白佛言：「菩薩摩訶薩淨畢施福不？」
佛言：「不也！何以故？本以淨畢故。#36.26
^36.8
舍利弗！菩薩摩訶薩為大施主，施何等？@t25p324a施諸善法。何等善法？十善道、五戒乃至十八不共法、一切種智，以是施與。」
^36.9
舍利弗白佛言：「世尊！菩薩摩訶薩云何習應般若波羅蜜，與般若波羅蜜相應？」#36.30
%31.158 一、習應五眾空、十二入空、十八界空、四諦空、十二因緣空、一切法空，是名與般若相應
^36.10
%31.157 （貳）佛答：「習應般若波羅蜜」的內涵
%31.159 ※ 習應五眾空
佛告舍利弗：「菩薩摩訶薩習應色空，是名與般若波羅蜜相應；習應受、想、行、識空，是名與般若波羅蜜相應。
%31.160 ※ 習應十二入空
復次，舍利弗！菩薩摩訶薩習應眼空，是名與般若波羅蜜相應；習應耳、鼻、舌、身、心空，是名與般若波羅蜜相應。習應色空，是名與般若波羅蜜相應；習應聲、香、味、觸、法空，是名與般若波羅蜜相應。
%31.161 ※ 習應十八界空
習應眼界空、色界空、眼#36.32識界空，是名與般若波羅蜜相應；習應耳聲識界#36.33、鼻香識界＊、舌味識界＊、身觸識界＊、意法識界＊空，是名與般若波羅蜜相應。
%31.162 ※ 習應四諦空
習應苦空，是名與般若波羅蜜相應；習應集、滅、道空，是名與般若波羅蜜相應。
~1033
%31.163 ※ 習應十二因緣空
習應無明空，是名與般若波羅蜜相應；習應行、識、名色、六處、觸、受、愛、取、有、生、老死空，是名與般若波羅蜜相應。
%31.164 ※ 習應有為、無為一切諸法空
習應一切諸法空，若有為、若無為空#36.34，是名與般若波羅蜜相應。@t25p324b
^36.11
復次，舍利弗！菩薩摩訶薩習應性空，是名與般若波羅蜜相應。如是，舍利弗！菩薩摩訶薩行般若波羅蜜習應七空，所謂（1）性空、（2）自相空、（3）諸法空、（4）不可得空、（5）無法空、（6）有法空、（7）無法有法空，是名與般若波羅蜜相應。」
^36.12
佛告舍利弗：「菩薩摩訶薩習應七空時，不見色若相應若不相應，不見受、想、行、識若相應若不相應。
不見色若生相若滅相，不見受、想、行、識若生相若滅相。
不見色若垢相若淨相，不見受、想、行、識若垢相若淨相。
^36.13
不見色與受合，不見受與想合，不見想與行合，不見行與識合。何以故？無有法與法合者，其性空故。
^36.14
舍利弗！色空中無有色，受、想、行，識空中無有識。#36.131
^36.15
舍利弗！色空故無惱壞相，受空故無受相，想空故無知相，行空故無作相，識空故無覺相。
^36.16
何以故？舍利弗！非色異空，非空異色，色即是空，空即是色；#36.133受、想、行、識亦如是。
^36.17
舍利弗！是諸法空相，不生不滅、不垢不淨、不增不減，是空法，非過去、非未來、非現在。@t25p328a
是故空中無色，無受、想、行、識；無眼、耳、鼻、舌、身、意；無色、聲、香、味、觸、法；無眼界乃至無意識界；無無明、亦無無明盡，乃至無老死，亦無老死盡；無苦、集、滅、道；亦無智、亦無得；#36.137無須陀洹、無須陀洹果，無斯陀含、無斯陀含果，無阿那含、無阿那含果，無阿羅漢、無阿羅漢果，無辟支佛、無辟支佛道，無佛、亦無佛道。
舍利弗！菩薩摩訶薩如是習應，是名與般若波羅蜜相應。
^36.18
舍利弗！是菩薩摩訶薩行般若波羅蜜，不見般若波羅蜜若相應若不相應，不見~1051檀波羅蜜、尸波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜若相應若不相應，亦不見色若相應若不相應，不見受、想、行、識若相應若不相應，不見眼乃至意、色乃至法、眼色識界乃至意法識界若相應若不相應，不見四念處乃至八聖道分、佛十力乃至一切種智若相應若不相應。
如是，舍利弗！當知菩薩摩訶薩與般若波羅蜜相應。
^36.19
復次，舍利弗！菩薩摩訶薩行般若波羅蜜時，空不與空合，無相不與無相合，無作不與無作合。何以故？空、無相、無作無有合與不合。舍利弗！菩薩摩訶薩如是習應，是名與般若波羅蜜相應。
^36.20
%31.334 五、五眾非合非不合，亦不與三際合
%31.335 （一）五眾非合非不合
復次，舍利弗！菩薩摩訶薩行般若波羅蜜時，入諸法自相空。入已，色不作合，不作不合；受、想、行、識不作合，不作不合。
%31.336 （二）五眾不與三際合
色不與前際合。何以故？不見前際故。
色不與後際合。何以故？不見後際故。
色不與現在合。何以故？不見現在故。
受、想、行、識亦如是。
^36.21
復次，舍利弗！菩薩摩訶薩行般若波羅蜜，前際不與後際合，後際不與前際合，現在不與前際、後際合，前際、後際亦不與現在合，三際#36.160名空故。#36.161
舍利弗！菩薩摩訶薩如是習應者，是名與般若波羅蜜相應。
^37.1
復次，舍利弗！菩薩摩訶薩行般若波羅蜜，薩婆若不與過去世合。何以故？過去世不可見，何況薩婆若與過去世合！
薩婆若不與未來世合。何以故？未來世不可見，何況薩婆若與未來世合！
薩婆若不與現在世合。何以故？現在世不可見，何況薩婆若與現在世合！
舍利弗！菩薩摩訶薩如是習應，是名與般若波羅蜜相應。
^37.2
復次，舍利弗！菩薩摩訶薩行般若波羅蜜，色不與薩婆若合，色不可見故；受、想、行、識亦如是。
眼不與薩婆若合，眼不可見故；耳、鼻、舌、身、意亦如是。
色不與薩婆若合，色不可見故；聲、香、味、觸、法亦如是。
舍利弗！菩薩摩訶薩如是習應，名#37.17與般若波羅蜜相應。#37.18
^37.3
復次，舍利弗！菩薩摩訶薩行般若波羅蜜，檀波羅蜜不與薩婆若合，檀波羅蜜不可見故；乃至般若波羅蜜亦如是。
四念處不與薩婆若合，四念處不可見故；乃至八聖道分亦如是。
^37.4
佛十力，乃至十八不共法不與薩婆若合，佛十力乃至十八不共法不可見故。舍利弗！菩薩摩訶薩如是習應，是名與般若波羅蜜相應。
^37.5
%31.379 （五）佛、菩提不與薩婆若合，佛、菩提、薩婆若相即
%31.380 1、佛、菩提不與薩婆若合
復次，舍利弗！菩薩摩訶薩行般若波羅蜜，佛不與薩婆若合，薩婆若不與佛合；菩提不與薩婆若合，薩婆若不與菩提合#37.26。
^37.6
何以故？佛即是薩婆若，薩婆若即是佛；菩提即是薩婆若，薩婆若即是菩提。
舍利弗！菩薩摩訶薩行般若波羅蜜，如是習應，是名與般若波羅蜜相應。
%31.390 八、菩薩於五眾離二邊、行中道，亦不著於行，是名與般若波羅蜜相應
%31.391 ※ 離二邊、行中道
復#37.33次，舍利弗！菩薩摩訶薩行般若波羅蜜，不習色有、不習色無，受、想、行、識亦如是。不習色有常、不習色無常，受、想、行、識亦如是。不習色苦、不習色樂，受、想、行、識亦如是。不習色我、不習色非我，受、想、行、識亦如是。不習色寂滅、不習色非#37.34寂滅，受、想、行、識亦如是。不習色空、不習色非空，受、想、行、識亦如是。不習色有相、不習色無相，受、想、行、識亦如是。不習色有作、不習色無作，受、想、行、識亦如是。
%31.392 ※ 不念行、不行、非行非不行
是菩薩摩訶薩行般若波羅蜜時，不作是念：『我行般若波羅蜜、不行般若波羅蜜、非行非不行般若波羅蜜。』
舍利弗！菩薩摩訶薩如是習應，是名與般若波羅蜜相應。#37.35
^37.7
復次，舍利弗！菩薩摩訶薩不為般若波羅蜜故行般若波羅蜜，不為檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜故行般若波羅蜜。
不為阿鞞跋致地故行般若波羅蜜，不為成就眾生故行般若波羅蜜，不為淨佛世界故行般若波羅蜜。
不為佛十力、四無所畏、四無礙智、十八不共法故行般若波羅蜜。
不為內空故行般若波羅蜜，不為外空、內外空、空空、大空、第一義空、有為空、無為空、畢竟空、無始空、散空、性空、諸法空、自相空、不可得空、無法空、有法空、無法有法空故行般若波羅蜜。
不為如、法性、實際故行般若波羅蜜。
何以故？是菩薩摩訶薩行般若波羅蜜時，不壞諸法相故。如是習應，是名與般若波羅蜜相應。
^37.8
復次，舍利弗！菩薩摩訶薩行般若波羅蜜，不為如意神通故行般若波羅蜜，不為天耳故、不為他心智故、不為宿命智故、不為天眼故、不為漏盡神通故行般若波羅蜜。
何以故？菩薩摩訶薩行般若波羅蜜，尚不見般若波羅蜜，何況見菩薩神通！舍利弗！菩薩摩訶薩如是行，是名與般若波羅蜜相應。
^37.9
復次，舍利弗！菩薩摩訶薩行般若波羅蜜，不作是念：『我以如意神通，飛到東方，供養恭敬如恒河沙等諸佛；南西北方、四維、上下亦如是。』復次，舍利弗！菩薩摩訶薩行般若波羅蜜，不作是念：『我以天耳，聞十方諸佛所說法。』不作是念：『我以他心智，當知十方眾生心所念。』不作是念：『我以宿命通，知十方眾生宿命所作。』不作是念：『我以天眼，見十方眾生死此生彼。』#37.61舍利弗！菩薩摩訶薩如是行，是名與般若波羅蜜相應，亦能度無量阿僧祇眾生。
^37.10
舍利弗！菩薩摩訶薩能如是行般若波羅蜜，（1）惡魔不能得其便；（2）世間眾事，所欲隨意；（3）十方各如恒河沙等諸佛，皆悉擁護是菩薩，令@t25p332c不墮聲聞、辟支佛地；（4）四天王天乃至阿迦尼吒#37.63天，皆亦擁護是菩薩，不令有礙；（5）是菩薩所有重罪，現世輕受。何以故？是菩薩摩訶薩用普慈加眾生故。舍利弗！是#37.64菩薩摩訶薩如是行，是名與般若波羅蜜相應。
^37.11
復次，舍利弗！菩薩摩訶薩行般若波羅蜜時，疾得諸陀羅尼門、諸三昧門。在#37.77所生處常值諸佛，乃至得#37.78阿耨多羅三藐三菩提，初#37.79不離見佛。
舍利弗！菩薩摩訶薩如是習應，是名與般若波羅蜜相應。
^37.12
復次，舍利弗！菩薩摩訶薩行般若波羅蜜時，不作是念：『有法與法若合若不合、若等若不等。』何以故？是菩薩摩訶薩，不見是法與餘法若合若不合、若等若不等。舍利弗！菩薩摩訶薩如是習應，是名與般若波羅蜜相應。
^37.13
復次，舍利弗！菩薩摩訶薩行般若波羅蜜，不作是念：『我當疾得法性，若不得。』何以故？法性非得相故。舍利弗！菩薩摩訶薩如是習應，是名與般若波羅蜜相應。
^37.14
復次，舍利弗！菩薩摩訶薩行般若波羅蜜時，不見有法出法性者。如是習應，是名與般若波羅蜜相應。
^37.15
復次，舍利弗！菩薩摩訶薩行般若波羅蜜時，不作是念：『法性分別諸法。』如是習應，是名與般若波羅蜜相應。
^37.16
復次，舍利弗！菩薩摩訶薩行般若波羅蜜時，不作是念：『是法能得法性，若不得。』何以故？是菩薩不見用是法能得法性，若不得。舍利弗！菩薩摩訶薩如是習應，是名與般若波羅蜜相應。
^37.17
復次，舍利弗！菩薩摩訶薩行般若波羅蜜時，法性不與空合，空不與法性合。如是習應，是名與般若波羅蜜相應。
^37.18
復次，舍利弗！菩薩摩訶薩行般若波羅蜜時，眼界不與空合，空不與眼界合；色界不與@t25p334c空合，空不與色界合；眼識界不與空合，空不與眼識界合；乃至意界不與空合，空不與意界合；法界不與空合，空不與法界合；意識界不與空合，空不與意識界合。
是故，舍利弗！是空相應，名為第一相應。
^37.19
%31.529 拾、空行相應之勝利#37.108
%31.530 ※ 生諸善
舍利弗！空行菩薩摩訶薩不墮聲聞、辟支佛地，能淨佛土，成就眾生，疾得阿耨多羅三藐三菩提。
舍利弗！諸相應中，般若波羅蜜相應為最第一，最尊、最勝、最妙，為無有上！
何以故？是菩薩摩訶薩行般若波羅蜜相應，所謂空、無相、無作，當知是菩薩如受記無異，若近受記。
舍利弗！菩薩摩訶薩如是相應者，能為無量阿僧祇眾生作益厚。
是菩薩摩訶薩亦不作是念：『我與般若波羅蜜相應，諸佛當授我記，我當近受記，我當淨佛土，我得@t25p335a阿耨多羅三藐三菩提，當轉法輪。』何以故？是菩薩摩訶薩不見有法出法性，亦不見有#37.109法行般若波羅蜜，亦不見有#37.110法諸佛授記，亦不見有法得阿耨多羅三藐三菩提。#37.111
何以故？菩薩摩訶薩行般若波羅蜜時，不生我相、眾生相，乃至知者、見者相。何以故？眾生畢竟不生不滅故，眾生無有生無有滅；若法無有#37.112生相滅相，云何是#37.113法當行般若波羅蜜？如是，舍利弗！菩薩摩訶薩不見眾生故，為行般若波羅蜜；眾生不受故、眾生空故、眾生不可得故、眾生離故，為行般若波羅蜜。
~1080舍利弗！菩薩摩訶薩於諸相應中為最第一相應，所謂空相應，是空相應勝餘相應。
菩薩摩訶薩如是習空，能生大慈大悲。
%31.531 ※ 滅諸惡
菩薩摩訶薩習是相應，不生慳心，不生犯戒心，不生瞋心，不生懈怠心，不生亂心，不生無智心。」
^38.1
%32.0 壹、明「菩薩行般若波羅蜜，來生此間之三類菩薩」
舍利弗白佛言：「世尊！菩薩摩訶薩行般若波羅蜜，能如是習相應者，從何處終，來生此間？從此間終，當生何處？」
佛告舍利弗：「是菩薩摩訶薩行般若波羅蜜，能如是習相應者，（1）或從他方佛國來生此間，（2）或從兜率天上來生此間，（3）或從人道中來生此間。
%32.1 （壹）從他方佛國來
舍利弗！從他方佛國來者，疾與般若波羅蜜相應；與般若波羅蜜相應故，捨身，來生此間，諸深法要#38.2皆現在前，後還與般若波羅蜜相應，在所生處常值諸佛。
%32.2 （貳）從兜率天來
舍利弗！有一生補處菩薩，兜率天上終，來生是間；是菩薩不失六波羅蜜，隨所生處，一切陀羅尼門、諸三昧門疾現在前。
%32.3 （參）從人中來
舍利弗！有菩薩人中命終、還生人中者，除阿毘跋致，是菩薩根鈍，不能疾與般若波羅蜜相應，諸陀羅尼門、三昧門不能疾現在前。
^38.2
舍利弗！汝所問『菩薩摩訶薩與般若波羅蜜相應，從此間終當生何處』者──
%32.27 （壹）第一類菩薩：般若相應者，從一國至一國，常值佛不離佛@yF036p369
舍利弗！此菩薩摩訶薩，從一佛國至一佛國，常值諸佛，終不離佛。
%32.28 （貳）第二類菩薩：菩薩行禪無方便，味著生天#38.36@yF036p369
~1090舍利弗！有菩薩摩訶薩不以方便入初禪乃至第四禪，亦行六波羅蜜；是菩@t25p337c薩摩訶薩得禪故，生長壽天，隨彼壽終來生是間，得人身，值諸佛--是菩薩諸根不利。
%32.29 （參）第三類菩薩：菩薩行禪無方便，起不善心生欲界@yF036p369
舍利弗！有菩薩摩訶薩入初禪乃至第四禪，亦行般若波羅蜜；不以方便故，捨諸禪，生欲界，是菩薩諸根亦鈍。
%32.30 （肆）第四類菩薩：菩薩行禪有方便，生有佛處──［賢劫中當得］（《大智度論筆記》［F036］p.369）
舍利弗！有菩薩摩訶薩入初禪乃至第四禪，入慈心乃至捨，入虛空處乃至非有想非無想處，修四念處乃至八聖道分，行十力乃至大慈大悲；是菩薩用方便力，不隨禪生，不隨無量心生，不隨四無色定生；在所有佛處於中生，常不離般若波羅蜜行。如是菩薩，賢劫中當得阿耨多羅三藐三菩提。
^38.3
舍利弗！有菩薩摩訶薩，入初禪乃至第四禪，入慈心乃至捨，入空處乃至非有想非無想處；以方便力故#38.97不隨禪生，還生欲界、若#38.98@t25p340a剎利大姓、婆羅門大姓、居士大家，成就眾生故。
^38.4
舍利弗！復有菩薩摩訶薩，入初禪乃至第@t25p340b四禪，入慈心乃至捨，入空處乃至非有想非無想處，以方便力故不隨禪生；或生四天王天處，或生三十三天，夜摩天、兜率陀天、化樂天、他#38.106化自在天。於是中成就眾生、亦淨佛世界，常值諸佛。
^38.5
復次，舍利弗！有菩薩摩訶薩，行般若波羅蜜，以方便力入初禪，此間命終，生梵天處，作大#38.109梵天王。從梵天處，遊一佛國至一佛國，在所有諸佛得阿耨多羅三藐三菩提，未轉法輪者，勸請令轉。
^38.6
%32.114 （捌）第八類菩薩：菩薩行禪有方便，是一生補處菩薩，生有佛處、生兜率天，壽終來此成佛
~1102
%32.115 ※ 生諸佛前
舍利弗！有菩薩摩訶薩一#38.112生補處，行般若波羅蜜，以方便力入初禪乃至第四禪，@t25p340c入慈心乃至捨，入空處乃至非有想非無想處，修四念處乃至八聖道分，入空三昧、無相、無作三昧，不隨禪生，生有佛處，修梵行。
%32.116 ※ 生兜率天
若生兜率#38.113天上，隨其壽終，具足善根，不失正念；與#38.114無數百千億萬諸天，圍繞恭敬，來生此間，得阿耨多羅三藐三菩提。
^38.7
%32.149 （玖）第九類菩薩：菩薩（法身）得六神通，遊諸佛國，供養恭敬尊重讚嘆諸佛#38.162@yF037p370
復次，舍利弗！有菩薩摩訶薩得六神通，不生欲界、色界、無色界；從一佛國至一佛國，供養恭敬尊重讚歎諸佛。
%32.150 （拾）第十類菩薩：菩薩（法身）得六神通，遊諸佛國，彼國無二乘名@yF037p370
舍利弗！有菩薩摩訶薩遊戲神通，從一佛國至一佛國，所至到處，無有聲聞、辟支佛乘，乃至無二乘之名。
%32.151 （拾壹）第十一類菩薩：菩薩（法身）得六神通，遊諸佛國，彼國其壽無量@yF037p370
舍利弗！有菩薩摩訶薩遊戲神通，從一佛國至一佛國，所至到處，其壽無量。
%32.152 （拾貳）第十二類菩薩：菩薩（法身）得六神通，遊諸世界──無三寶處讚嘆三寶@yF037p370
舍利弗！有菩薩摩訶薩遊戲神通，從一佛國至一佛國，所至到處，有無佛、法、僧處，讚佛、法、僧功德；諸眾生等以聞佛名、法名、僧名故，於此命終，生諸佛前。
^38.8
舍利弗！有菩薩摩訶薩初發意時，得初禪乃至第四禪，得四無量心，得四無色定，修四念處乃至十八不共法；是菩薩不生欲界、色界、無色界中，常生有益眾生之處。
^38.9
~1111
%32.163 （拾肆）第十四類菩薩：菩薩初發意時，行六度，入菩薩位，得不退@yF037p370
舍利弗！有菩薩摩訶薩，初發意時，行六波羅蜜，上#38.171菩薩位，得阿毘跋致地。
%32.164 （拾伍）第十五類菩薩：菩薩初發意時，便得無上菩提，轉法輪，大利眾生@yF037p370
舍利弗！有菩薩摩訶薩，初發心時，便得阿耨多羅三藐三菩提#38.172，轉法輪，與無量阿僧祇眾生作益厚已，入無餘涅槃；是佛般涅槃後，餘法若住一劫，若減一劫。
%32.165 （拾陸）第十六類菩薩：菩薩初發意時，般若相應，與諸菩薩遊諸佛國淨佛世界@yF037p370
舍利弗！有菩薩摩訶薩，初發意時，與般若波羅蜜相應，與無數百千億菩薩，從一佛國至一佛國，為#38.173淨佛世界故#38.174。
^39.1
舍利弗！有菩薩摩訶薩行般若波羅蜜時#39.2，得四禪、四無量心、四無色定，遊戲其中──入初禪，從初禪起，入滅盡定。從滅盡定起，乃至入四禪；從四禪起，入滅盡定。從滅盡定起，入虛空處；從虛空處起，入滅盡定。從滅盡定起，乃至入非有想非無想處；從非有想非無想處起，入滅盡定。如#39.3是，舍利弗！菩薩摩訶薩行般若波羅蜜，以方便力故#39.4入超越定。
^39.2
舍利弗！有菩薩摩訶薩行般若波羅蜜時，修四念處乃至十八不共法，不取須陀洹果、斯陀含果、阿那含果、阿羅漢果、辟支佛道；以方便力，為度#39.13眾生故起八聖道分，以是八道，令得須陀洹果乃至辟支佛道。」
佛告舍利弗：「一切阿羅漢、辟支佛果及智，是菩薩摩訶薩無生法忍。舍利弗！當知是菩薩摩訶薩行般若波羅蜜，在阿鞞跋致地中住。
^39.3
舍利弗！有菩薩摩訶薩住六波羅蜜淨兜率天道，當知是賢劫中菩薩。
^39.4
舍利弗！有菩薩摩訶薩修四禪乃至十八不共法，未證四諦，當知是菩薩一生補處。
^39.5
舍利弗！有菩薩摩訶薩無量阿僧祇劫修行，得阿耨多羅三藐三菩提。
^39.6
舍利弗！有菩薩摩訶薩住六波羅蜜，常懃精進，利益眾生，不說無益之事。
^39.7
舍利弗！有菩薩摩訶薩行六波羅蜜，常懃精進，利益眾生，從一佛國至一佛國，斷眾生三惡道。
^39.8
舍利弗！有菩薩摩訶薩住六波羅蜜，以檀為首，安樂一切眾生──須飲食與飲食，衣服、臥具、瓔珞、花香、房舍、燈燭，隨其#39.28所須，皆給與之。
^39.9
舍利弗！有菩薩摩訶薩行般若波羅蜜時，變身如佛，為地獄中眾生說法，為畜生、餓鬼中眾生說法。
^39.10
舍利弗！有菩薩摩訶薩行六波羅蜜時，變身如佛，遍至十方如恒河沙等諸佛世界，為眾生說法；亦供養諸佛及淨佛世界，聞諸佛說法；觀採十方淨妙國土#39.37相而已#39.38，自起殊勝世界。其中菩薩摩訶薩皆是一生補處。#39.39
^39.11
舍利弗！有菩薩摩訶薩行六波羅蜜時，成就三十二相，諸根淨利。諸根淨利故，眾人愛敬；以愛敬故，漸以三乘法而度脫之。如是，舍利弗！菩薩摩訶薩行般若波羅蜜時，應學身清淨、口清淨。
^39.12
舍利弗！有菩薩摩訶薩行六波羅蜜時#39.43@t25p344c得諸根淨，以是淨根而不自高，亦不下他。
^39.13
舍利弗！有菩薩摩訶薩從初發心住檀波羅蜜、尸羅波羅蜜，乃至阿鞞跋致地，終不墮惡道。
^39.14
舍利弗！有菩薩摩訶薩，從初發心乃至阿鞞跋致地，常不捨十善行。
^39.15
舍利弗！有菩薩摩訶薩，住檀波羅蜜、尸羅波羅蜜中，作轉輪聖王，安立眾生於十善道，亦以財物布施眾生。」
^39.16
佛告#39.50舍利弗：「有菩薩摩訶薩，住檀波羅蜜、尸羅波羅蜜，無量千萬#39.51世作轉輪聖王，值遇無量百千諸佛，供養恭敬，尊重讚歎。
^39.17
舍利弗！有菩薩摩訶薩常為眾生以法照明，亦以自照；乃至阿耨多羅三藐三菩提，終不離照明。舍利弗！是菩薩摩訶薩於佛法中已得尊重。舍利弗！以是故，菩薩摩訶薩行般若波羅蜜時，身口意不淨不令妄起。」
^39.18
舍利弗白佛言：「世尊！云何菩薩身業不淨、口業不淨、意業不淨？」
^39.19
佛告舍利弗：「若菩薩摩訶薩作是念：『是身、是口、是意。』如是取相作緣，舍利弗！是名菩薩身口意罪。舍利弗！菩薩摩訶薩行般若波羅蜜時，不得身、不得口、不得意。舍利弗！菩薩摩訶薩行般若波羅蜜時，若得身、得口、得意，用是得身口意故，能生慳心、犯戒心、瞋心、懈怠心、亂心、癡心。當知是菩薩行六波羅蜜時，不能除身口意麁業。」
^39.20
舍利弗白佛言：「世尊！菩薩摩訶薩云何除身口意麁業？」
佛告舍利弗：「若菩薩摩訶薩不得身、不得口、不得意，如是菩薩摩訶薩能除身口意麁業。
~1127復次，舍利弗！菩薩摩訶薩從初發意行十善道，不生聲聞心、不生辟支佛心，如是菩薩摩訶薩能除身口意麁業。
^39.21
舍利弗！有菩薩摩訶薩行般若波羅蜜淨佛道時，行檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜，是名菩薩摩@t25p346b訶薩除身口意麁業#39.65。」
舍利弗白佛言：「世尊！何等是菩薩摩訶薩佛道？」
佛告舍利弗：「佛道者，若菩薩摩訶薩不得身、不得口、不得意，不得檀波羅蜜乃至不得般若波羅蜜，不得聲聞、辟支佛，不得菩薩，不得佛。舍利弗！是名菩薩摩訶薩佛道，所謂一切諸法不可得故。
^39.22
舍利弗！有菩薩摩訶薩行六波羅蜜時，無能壞者。」
舍利弗白佛言：「世尊！云何菩薩摩訶薩行六波羅蜜時，無能壞者？」
佛告舍利弗：「若菩薩摩訶薩行六波羅蜜時，不念有色乃至識，不念有眼乃至意，不念有色乃至法，不念有眼界乃至法界，不念有四念處乃至八聖道分，不念有檀波羅蜜乃至般若波羅蜜，不念有十力乃至十八不共法，不念有須陀洹果乃至阿羅漢果，不念有辟支佛乃至阿耨多羅三藐三菩提。舍利弗！菩薩摩訶薩如是行，增益六波羅蜜，無能壞者。
^39.23
舍利弗！有菩薩摩訶薩住般若波羅蜜中，具足智慧。以是智慧，常不墮惡道，不生弊惡人中，不作貧窮人；所受身體，不為人、天、阿修羅所憎惡。」
^39.24
%32.286 二、用是智慧，見十方諸佛，聽法、見僧，亦見嚴淨佛土
舍利弗白佛言：「世尊！何等是菩薩摩訶薩智慧？」
佛告舍利弗：「菩薩摩訶薩用是智慧，成就見十方如恒河沙等諸佛、聽法、見僧，亦見嚴淨佛土。
%32.287 三、以是智慧，不著心、不取相，能具足一切法，亦不得一切法
菩薩摩訶薩以是智慧，不作佛想，不作菩薩想，不作聲聞、辟支佛想，不作我想，不作佛國想。用是智慧行檀波羅蜜亦不得檀波羅蜜，乃至行般若波羅蜜亦不得般若波羅蜜；行四念處亦不得四念處，乃至行十八不共法亦不得十八不共法。舍利弗！是名菩薩摩訶薩智慧。用是智慧，能具足一切法，亦不得一切法。#39.72
~1130
^39.25
%32.293 （參拾柒）第三十七類菩薩：菩薩住般若，淨五眼@yF038p372
%32.294 一、總標：行般若時淨五眼
舍利弗！有菩薩摩訶薩行般若波羅蜜時，淨於五眼：肉眼、天眼、慧眼、法眼、佛眼。」
%32.295 二、別釋
%32.296 （一）肉眼淨
舍利弗白佛言：「世尊！云何菩薩摩訶薩肉眼淨？」
佛告舍利弗：「有菩薩肉眼見百由旬，有菩薩肉眼見二百由旬，有菩薩肉眼見一閻浮提，有菩薩肉眼見二天下、三天下、四天下，有菩薩肉眼見小千世界，有菩薩肉眼見中千世界，有菩薩肉眼見三千大千世界。#39.74舍利弗！是為菩薩摩訶薩肉眼淨。」
^39.26
舍利弗白佛言：「世尊！云何菩薩摩訶薩天眼淨？」
佛告舍利弗：「菩薩摩訶薩天眼，見一切#39.85四天王天所見，見#39.86三十三天、夜摩天、兜率陀天、化樂天、他化自在天所見，見梵天王所見乃至阿迦尼吒#39.87天所見。菩薩天眼所見者，四天王天#39.88乃至阿迦尼吒天所#39.89不知、不見。舍利弗！是菩薩摩訶薩天眼，見十方如恒河沙等諸佛世界中眾生死此生彼。舍利弗！是為菩薩摩訶薩天眼淨。」
^39.27
舍利弗白佛言：「世尊，云何菩薩摩訶薩慧眼淨？」
佛告舍利弗：「慧眼菩薩不作是念：有法若有為、若無為，若世間、若出世間，若有漏、若無漏。是慧眼菩薩，無法不見，無法不聞，@t25p348a無法不知，無法不識。#39.94舍利弗！是為菩薩摩訶薩慧眼淨。」#39.95
^40.1
舍利弗白#40.1言：「世尊！云何菩薩摩訶薩法眼淨？」
%32.360 1、菩薩法眼，知聲聞、辟支佛道@yA053p91
佛告舍利弗：「菩薩摩訶薩以法眼知是人隨信行、是人隨法行#40.2、是人無相行#40.3，是人~1138行空解脫門、是人行無相解脫門、是人行無作解脫門，得五根，得五根故得無間三昧，得無間三昧故得解脫智，得解脫智故斷#40.4三結──有眾見、疑、齋戒取，是人名為須陀洹；是人得思惟道，薄婬、恚、癡，當得斯陀含；增進思惟道，斷婬、恚#40.5，得#40.6阿那含；增進思惟道，斷色染、無色染、無明、慢、掉，得阿羅漢。是人行空、無相、無作解脫門，得五根，得五根故得無間三昧，得無間三昧故得解脫智，得解脫智故知所有集法皆是滅法，作辟支佛──是為菩薩#40.7法眼淨。
%32.361 2、知菩薩種種道@yA053p91
%32.362 ※ 知「行六度乃至不墮二乘」
復次，舍利弗！菩薩摩訶薩知是菩薩初發意行檀波羅蜜乃至行般若波羅蜜，成就信根、精進根，善根純厚；用方便力故，為眾生受身──若@t25p349a生剎利大姓，若生婆羅門大姓，若生居士大家；若生四天王天處乃至他化自在天處；是菩薩於其中住，成就眾生，隨其所樂，皆給施之；亦淨佛世界，值遇諸佛，供養、恭敬、尊重、讚歎，乃至阿耨多羅三藐三菩提，亦不墮聲聞、辟支佛地#40.8──是為菩薩摩訶薩法眼淨。
%32.363 ※ 知「退不退乃至有魔無魔」
復次，舍利弗！菩薩摩訶薩如#40.9是（1）知是菩薩於阿耨多羅三藐三菩提退、知是菩薩於阿耨多羅三藐三菩提不退，（2）知是菩薩受阿耨多羅三藐三菩提記、知是菩薩未受阿耨多羅三藐三菩提記，（3）知是菩薩到阿鞞跋致地、知是菩薩未到阿鞞跋致地，（4）知是菩薩具足神通、知是菩薩未具足神通；知是菩薩已具足神通，飛到十方如恒河沙等世界，見諸佛供養恭敬，尊重讚歎；（5）知是菩薩未得神通、當得神通；（6）知#40.10是菩薩當淨佛世界、未#40.11淨佛世界，（7）是#40.12菩薩成就眾生、未成就眾生，（8）是菩薩為諸佛所稱譽、所不稱譽，（9）是菩薩親近諸佛、不親近佛，（10）是菩薩壽命有量、壽命無量，（11）是菩薩得佛時，比丘眾有量、比丘眾無量；（12）是菩薩得阿耨多羅三藐三菩提時，以菩薩為僧、不以菩薩為僧；（13）是菩薩當修苦行難行、不修苦行難行，（14）是菩薩一生補處、未一生補處，（15）是菩薩受最後身、未受最後身，（16）是菩薩能坐道場、不能坐道場，（17）是菩薩有魔、無魔。如是，舍利弗！是為~1139菩薩摩訶薩法眼淨。」
^40.2
%32.393 （五）佛眼淨
舍利弗白佛言：「世尊！云何菩薩摩訶薩佛眼淨？」
佛告舍利弗：「有菩薩摩訶薩求佛道心，次第入如金剛三昧，得一切種智。爾時，成就十力、四無所畏、四無礙智、十八不共法、大慈大悲。是菩薩摩訶薩用一切種#40.59，一切法中，無法不見，無法不聞，無法不知，無法不識。舍利弗！是為菩薩摩訶薩得阿耨多羅三藐三菩提時佛眼淨。
%32.394 （六）結成
如是，舍利弗！菩薩摩訶薩欲得五眼，當學六波羅蜜。何以故？舍利弗！是六#40.60波羅蜜中，攝一切善法──若聲聞法、辟支佛法、菩薩法、佛法。#40.61
舍利弗！若有實語，能攝一切善法者，般若波羅蜜是。#40.62
舍利弗！般若波羅蜜能生五眼，菩薩學五眼者，得阿耨多羅三藐三菩提。#40.63
^40.3
舍利弗！有菩薩摩訶薩行般若波羅蜜時，修神通波羅蜜。
%32.420 一、神足通
以是神通波羅蜜，受種種如意事：能動大地；變一身為無數身，無數身還為一身；隱顯自在；山壁樹木，皆過無礙，如行空中；履#40.84水如地；凌#40.85虛如鳥；出沒地中，如出入水；身出烟炎，如大火聚；身中出水，如雪山水流；日月大德，威力難當，而能摩捫#40.86；乃至梵天，身得自在。亦不著是如意神通，神通事及己身皆不可得；自性空故、自性離故、自性無生故。不作是念：『我得如意神通。』除為薩婆若心。如是，舍利弗！菩薩摩訶薩行般若波羅蜜時，得如意神通智證。
%32.421 二、天耳通
是菩薩以天耳淨，過於人耳，聞二種聲：天聲、人聲。亦不著是天耳神通，天耳與聲及己身皆不可得，自性空故、自性離故、自性無生故。不作是念：『我有是天耳。』除為薩婆若心。如是，舍利弗！菩薩摩訶薩行般若波羅蜜時，得天耳神通智證。
%32.422 三、他心通
是菩薩如實知他眾生心：若欲心，如實知欲心；離欲心，如實知離欲心；瞋心，如實知瞋心；離瞋心，如實知離瞋心；癡心，如實知癡心；離癡心，如實知離癡心；渴愛心，如實知渴愛心；無渴愛心，如實知無渴愛心；有受心，如實知有受心；無受心，~1148如實知無受心；攝心，如實知攝心；散心，如實知散心；小心，如實知小心；大心，如實知大心；定心，如實知定心；亂心，如實知亂心；解脫心，如實知解脫心；不解脫心，如實知不解脫心；有上心，如實知有上心；無上心，如實知無上心。亦不著是心！何以故？是@t25p351c心非心相不可思議故，#40.87自性空故、自性離故、自性無生故。不作是念：『我得他心智證。』除為薩婆若心。如是，舍利弗！菩薩摩訶薩行般若波羅蜜時，得他心神通智證。
%32.423 四、宿命通
是菩薩以宿命智證通，念一心乃至百心，念一日乃至百日，念一月乃至百月，念一歲乃至百歲，念一劫乃至百劫、無數百劫、無數千劫、無數百千劫，乃至無數百千萬億劫世──我是處如是姓、如是名、如是生、如是食、如是久住、如是壽限、如是長壽、如是受苦樂；我是中死、生彼處，彼處死、生是處，有相有因緣。亦不著是宿命神通，宿命神通事及己身皆不可得，自性空故、自性離故、自性無生故。不作是念：『我有是宿命神通。』除為薩婆若心。如是，舍利弗！菩薩摩訶薩行般若波羅蜜時，得宿命神通智證。
%32.424 五、天眼通
是菩薩以天眼見眾生死時、生時，端政#40.88、醜陋，惡處、好處，若大、若小；知眾生隨業因緣──是諸眾生身惡業成就、口惡業成就、意惡業成就故，謗毀聖人、受邪見因緣故，身壞命終#40.89墮惡道，生地獄中；是諸眾生身善業成就、口善業成就、意善業成就，不謗毀聖人、受正見因緣故，命終入善道，生天上。亦不著是天眼神#40.90通，天眼神通事及己身皆不可得，自性空故、自性離故、自性無生故。不作是念：『我有是天眼神通。』除為薩婆若心。如是，舍利弗！菩薩摩訶薩行般若波羅蜜時，得天眼神通智證。
亦見十方如恒河沙等世界中眾生生死，乃至生天上；四神通亦如是。
%32.425 六、漏盡通
是菩薩摩訶薩漏盡神通，雖得漏盡神通，不墮@t25p352a聲聞、辟支佛地；乃至阿耨多羅三藐三菩提，亦不依異法。亦不著是漏盡神通，漏盡神通事及己身皆不可得，自性空故、自性離故、自性無生故。不作是念：『我得漏盡神通。』除為薩婆若心。如是，舍利弗！菩薩摩訶薩行般若波羅蜜時，得漏盡神通智證。
%32.426 七、結
如是，舍利弗！菩薩摩訶薩行般若波羅蜜時，具足神通波羅蜜；具足神通波羅蜜已，增益阿耨多羅三藐三菩提。
^40.4
%32.444 （参拾玖～肆拾肆）「第三十九～四十四類菩薩」：菩薩應行般若時別住六度──六人@yF041p375
%32.445 一、約六度明六人
%32.446 （一）第三十九類菩薩
舍利弗！有菩薩摩訶薩行般若波羅蜜時，住檀波羅蜜，淨薩婆若道，畢竟空，不生慳心故。
%32.447 （二）第四十類菩薩
舍利弗！有菩薩摩訶薩行般若波羅蜜時，住尸羅波羅蜜，淨薩婆若道，畢竟空，罪不罪不著故。
%32.448 （三）第四十一類菩薩
舍利弗！有菩薩摩訶薩行般若波羅蜜時，住羼提波羅蜜，淨薩婆若道，畢竟空，不瞋故。
~1151
%32.449 （四）第四十二類菩薩
舍利弗！有菩薩摩訶薩行般若波羅蜜時，住毘梨耶波羅蜜，淨薩婆若道，畢竟空，身心精進不懈息#40.104故。
%32.450 （五）第四十三類菩薩
舍利弗！有菩薩摩訶薩行般若波羅蜜時，住禪波羅蜜，淨薩婆@t25p352c若道，畢竟空，不亂不味#40.105故。
%32.451 （六）第四十四類菩薩
舍利弗！有菩薩摩訶薩行般若波羅蜜時，住般若波羅蜜，淨薩婆若道，畢竟空，不生癡心故。
%32.452 二、畢竟空故，不分別施者受者，乃至智愚等事
如是，舍利弗！菩薩摩訶薩行般若波羅蜜時，住六波羅蜜，淨薩婆若道，畢竟空故，不來不去故，不施不受故，非戒非犯故，非忍非瞋故，不進不怠故，不定不亂故，不智不愚故。
%32.453 三、顯得益
爾時，菩薩摩訶薩不分別布施不布施、持戒犯戒、忍辱瞋恚、精進懈怠、定心亂心、智慧愚癡，不分別毀害、輕慢、恭敬。何以故？舍利弗！無生法中，無有受毀者、無有受害者、無有受輕慢恭敬者。
舍利弗！菩薩摩訶薩行般若波羅蜜，得如是諸功德，聲聞、辟支佛所無有。得是功德具足，成就眾生，淨佛世界，得一切種智！
^40.5
復次，舍利弗！菩薩摩訶薩行般若波羅蜜時，（1）一切眾生中生等心；（2）一切眾生中生等心已，得一切諸法等；（3）得一切諸法等已，立一切眾生於諸法等中。
（4）是菩薩摩訶薩，現世為十方諸佛所念，亦為一切菩薩、一切聲聞、辟支佛所念。（5）是菩薩在所生處，眼終不見不愛色，乃至意不覺不愛法。
如是，舍利弗！菩薩摩訶薩行般若波羅蜜，不減於阿耨多羅三藐三菩提。」
^40.6
%32.475 肆、時眾得益受記
%32.476 （壹）三百比丘及六萬欲天得佛授記
說是〈般若波羅蜜品〉時，三百比丘從坐起，以所著衣上佛，發阿耨多羅三藐三菩提~1154心。佛爾時微笑，種種色光從口中出。
爾時#40.118，慧命阿難從坐起，整衣服，合掌，右膝著地，白佛言：「佛何因緣微笑？」
佛告阿難：「是三百比丘從是已後六十一劫當得#40.119作佛，皆號名大相。是三百比丘捨此身已#40.120，當生阿閦佛國#40.121；及六萬欲天子皆發阿耨多羅三藐三菩提心，於彌勒佛法中出家行佛道。」
%32.477 （貳）時眾依佛力，見佛與嚴淨世界，十千人發願得佛受記
是時，佛之威神故，此間四部眾見十方面各千佛；是十方世界嚴淨，此娑婆世界所不能#40.122及。#40.123
爾時，十千人作願言#40.124：「我等修淨願行，以#40.125淨願行故，當生彼佛@t25p353c世界。」
爾時，佛知是善男子深心，而復微笑，種種色#40.126光從口中出。
阿難整衣服，合掌白佛：「佛何因緣微笑？」
佛告阿難：「汝見是十千人不？」
阿難言：「見！」
佛言：「是十千人於此壽終，當生彼世界，終不離諸佛；後當作佛，皆號莊嚴王#40.127。」
^40.7
%33.0 壹、眾聖稱歎般若
%33.1 （壹）歎法
%33.2 一、正歎般若
爾時，慧命舍利弗、慧命目犍#40.142連、慧命須菩提、慧命摩訶迦葉，如是等諸多知識比丘及諸菩薩摩訶薩、諸優婆塞、優婆夷從坐起，合掌白佛言：「世尊！（1）摩訶波羅蜜，是菩薩摩訶薩般若波羅蜜。（2）尊波羅蜜、（3）第一波羅蜜、（4）勝波羅蜜、（5）妙波羅蜜、（6）無上波羅蜜、（7）無等波羅蜜、（8）無等等波羅蜜、（9）如虛空波羅蜜，是菩薩摩訶薩般若波羅蜜。世尊！（10）自相空波羅蜜，是菩薩摩訶薩般若波羅蜜；世尊！（11）自性空波羅蜜，是菩薩摩訶薩般若波羅蜜。（12）諸法空波羅蜜、（13）無法有法空波羅蜜、（14）開一切功德波羅蜜、（15）成就一切功德波羅蜜、（16）不可壞波羅蜜，是諸菩薩摩訶薩般若波羅蜜。
%33.3 二、具足無等等六度乃至成佛轉法輪皆由行般若得
%33.4 ※ 菩薩行般若
諸菩薩摩訶薩行是般若波羅蜜，無等等布施，具足無等等檀波羅蜜，得無等等身，得無等等法，所謂阿耨多羅三藐三菩提。#40.143尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜亦如是。
%33.5 ※ 三世諸佛亦行般若
世尊本亦復行此般若波羅蜜，具足無等等六波羅蜜，得無等等法；得無等等色#40.144，無等等受、想、行、識，佛轉無等等法輪；過去佛亦如是行此般若波羅蜜，具足無等等布施，乃至轉無等等法輪；未來世佛亦行此般若波羅蜜，當作無等等布施，乃至當轉無等等法輪。
%33.6 三、結勸修行
以是故，世尊！菩薩摩訶薩欲度一切法彼岸，當習行般若波羅蜜！
%33.7 （貳）歎行般若之人
唯！世尊！是行般若波羅蜜菩薩摩訶薩，一切世間天及人、阿修羅應當禮#40.145敬供養！」
~1158
%33.8 貳、如來述成
%33.9 （壹）應禮敬供養行般若之菩薩
佛告眾弟子#40.146及諸菩薩摩訶薩：「如是！如是！諸善男子行是般若波羅蜜者，一切世間天及人、阿修羅應當禮#40.147敬供養。
%33.10 （貳）菩薩行般若故能生世間、出世間果，一切世間諸樂具皆由菩薩有
何以故？因菩薩來故，@t25p354c出生人道、天道，剎利大姓、婆羅門大姓、居士大家、轉輪聖王、四天王天乃至阿迦尼吒天；出生須陀洹乃至阿羅漢、辟支佛、諸佛。
因菩薩來故，世間便有飲食、衣服、臥具、房舍、燈燭、摩尼、真珠、毘琉璃、珊瑚、金銀等諸寶物生。
舍利弗！世間所有樂具──若人中、若天上、若離欲樂，是一切樂具皆由菩薩有。何以故？舍利弗！菩薩摩訶薩行菩薩道時，住六波羅蜜，自行布施，亦以布施成就眾生；乃至自行般若波羅蜜，亦以般若波羅蜜成就眾生。
舍利弗！是故菩薩摩訶薩為安樂一切眾生故出現於世。」
^40.8
%34.0 壹、佛出舌相放光明
爾時，世尊出舌相，遍覆三千大千世界；從其舌相出無數無量色光明，普照十方如恒河沙等諸佛世界。
%34.1 貳、十方菩薩眾及諸天並集
%34.2 （壹）十方菩薩眾集
%34.3 一、見瑞疑問
是時，東方如恒河沙等世界中無量無數諸菩薩見是大光明，各各白其佛言：「世尊！是誰神#40.159力故，有是大光明，普照諸佛#40.160世界？」
%34.4 二、十方佛釋
諸佛告諸菩薩言：「諸善男子！西方有世界名娑婆，是中有佛名釋迦牟尼，是其舌相出大光明，普照東方如恒河沙等諸佛世界；南西北方、四維、上下，亦復如是；為諸菩薩摩訶薩說般若波羅蜜故。」
%34.5 三、十方菩薩欲來供養
是時，諸菩薩各白其佛言：「我欲往供養釋迦牟尼佛及諸菩薩摩訶薩，并欲聽般若波羅蜜！」
%34.6 四、十方佛許
諸佛告諸菩薩：「善男子！汝自知時！」
%34.7 五、諸菩薩持供養具至釋迦佛所
是時，諸菩薩摩訶薩持諸供養具、無量華蓋、幢幡、瓔珞、眾香、金銀、寶花，向娑婆世界，詣釋迦牟尼佛所。
%34.8 （貳）諸天眾集
爾時，四天王諸天乃至阿迦尼吒諸天，各持天上天香、末香、澤香、天樹香、葉香、天種種蓮華──青、赤、紅、白，向釋迦牟尼佛所。
%34.9 參、因供養重現瑞相
是諸菩薩摩訶薩及諸天所散諸華，於三千大千世界虛空中化成四柱大寶#40.161臺，種種異色，莊嚴分明。
%34.10 肆、時眾悟道發願
是時，釋迦牟尼佛眾中，有十萬億人皆@t25p356a從坐起，合掌白佛言：「世尊！我等於未來世中，亦當得如是法，如今釋迦牟尼佛！弟子、侍從、大眾，說法，亦爾！」
~1163
%34.11 伍、佛歡喜授記
是時，佛知善男子至心，於一切諸法不生不滅、不出不作，得是法忍。#40.162
佛便微笑，種種色光從口中出。
阿難白佛言：「世尊！何因緣故微笑？」
佛告阿難：「是眾中十萬億人，於諸法中得無生忍。是諸人於未來世過六十八億劫當得#40.163作佛，劫名華積，佛皆號覺花。」
^41.1
#41.2
%35.0 壹、佛命須菩提為菩薩說般若波羅蜜
爾時，佛告慧命須菩提：「汝當教諸菩薩摩訶薩般若波羅蜜，如諸菩薩摩訶薩所應成就般若波羅蜜！」
%35.1 貳、須菩提依佛力為菩薩說般若
%35.2 （壹）大眾見佛命須菩提說般若而生疑
即時諸菩薩摩訶薩及聲聞大弟子、諸天等作是念：「慧命須菩提自以智慧力當為諸菩薩摩訶薩說般若波羅蜜耶？為是佛力？」#41.3
%35.3 （貳）釋眾疑
慧命須菩提知諸菩薩摩訶薩、大弟子、諸天心所念，語慧命舍利弗：「敢#41.4佛弟子所說法、所教授，皆是佛力。佛所說法，法相不相違背；#41.5是善男子學是法，得證此法；佛說如燈。舍利弗！一切聲聞、辟支佛實無力能為菩薩摩訶薩說般若波羅蜜。」
%35.4 （參）須菩提述所悟
爾時，慧命須菩提白佛言#41.6：「世尊所說菩薩、菩薩字#41.7，何等法名菩薩？
~1166世尊！我等不見是法名菩薩，云何教菩薩般若波羅蜜？」
%35.5 參、佛顯深義
%35.6 （壹）總明三假觀
%35.7 一、菩薩字、菩薩、般若但有名字，名字不在內、不在外、不在中間
佛告須菩提：「般若波羅蜜，亦但有名字，名為般若波羅蜜；菩薩、菩薩字，亦但有名字；是名字不在內，不在外，不在中間。#41.8
%35.8 二、舉喻明理
%35.9 （一）約我等十六種異名為喻
須菩提！譬如說我名#41.9，和合故有；是我名，不生不滅，但@t25p357b以世間名字故說。如眾生、壽、命、生者、養育者#41.10、眾數、人、作者、使作者、起者、使起者、受者、使受者、知者、見者#41.11等，和合法故有；是諸名，不生不滅，但以世間名字故說。
般若波羅蜜、菩薩、菩薩字亦如是，皆和合故有；是亦不生不滅，但以世間名字故說。
%35.10 （二）約五蘊為喻
須菩提！譬如身和合故#41.12有；是亦不生不滅，但以世間名字故說。#41.13
須菩提！譬如色#41.14、受、想、行、識，亦和合故有；是亦不生不滅，但以世間名字故說。
須菩提！般若波羅蜜、菩薩、菩薩字亦如是，皆是和合故有；是亦不生不滅，但以世間名字故說。
%35.11 （三）約十二處、十八界為喻
%35.12 1、十二處
須菩提！譬如眼#41.15，和合故有；是亦不生不滅，但以世間名字故說；是眼不在內、不在外、不在中間。耳、鼻、舌、身、意，和合故有；是亦不生不滅，但以世間名~1167字故說。
色乃至法亦如是。
%35.13 2、十八界
眼界#41.16，和合故有；是亦不生不滅，但以世間名字故說。乃至意識界亦如是。
須菩提！般若波羅蜜、菩薩、菩薩字亦如是，皆和合故有；是亦不生不滅，但以名字故說；是名字亦#41.17不在內、不在外、不在中間。
%35.14 （四）約內身為喻
須菩提！譬如內身#41.18，名為頭，但有名字，項#41.19、肩、臂、脊、肋#41.20、髀#41.21、𨄔#41.22、脚，是和合故有；是法及名字，亦不生不滅，但以名字故說；是名字亦不在內、不在外、不在中間。
須菩提！般若波羅蜜、菩薩、@t25p357c菩薩字亦如是，皆和合故有，但以名字故說；是亦不生不滅，不在內、不在外、不在中間。
%35.15 （五）約外物為喻
須菩提！譬如外物──草、木、枝、葉、莖、節，如#41.23是一切但以名字故說；是法及名字，亦不生不滅，非內非外，非中間住。
須菩提！般若波羅蜜、菩薩、菩薩字亦如是，皆和合故有；是法及名字，亦不生不滅，非內、非外、非中間住。
%35.16 （六）約過去諸佛為喻
須菩提！譬如過去諸佛，名字#41.24和合故有；是亦不生不滅，但以名字故#41.25說；是亦非~1168內、非外、非中間住。#41.26
般若波羅蜜、菩薩、菩薩字亦如是。
%35.17 （七）約夢影幻化等為喻
須菩提！譬如夢、響#41.27、影、幻、炎、佛所化，皆是和合故有，但以名字說；#41.28是法及名字不生不滅，非內、非外、非中間住。
般若波羅蜜、菩薩、菩薩字亦如是。
%35.18 三、結──菩薩行般若波羅蜜，當學三假
如是，須菩提！菩薩摩訶薩行般若波羅蜜，名假施設、受假施設、法假施設，如是應當學。
^41.2
%35.63 （貳）別明三假
%35.64 一、別釋名假
%35.65 （一）無分別觀#41.70
%35.66 1、五蘊
復次，須菩提！#41.71菩薩摩訶薩行般若波羅蜜時#41.72，不見色名字是常，不見受、想、行、識名字是常，不見色名字無常，不見受、想、行、識名字無常；不見色名字樂，不見色名字苦；不見色名字我，不見色名字無我；不見色名字空，不見色名字無相，不見色名字無作；不見色名字寂滅；不見色名字垢，不見色名字淨；不見色名字生，不見色名字滅；不見色名字內，不見色名字外，不見色名字中間住。受、想、行、識亦如是。
%35.67 2、六根、六境、六識、六觸、六受
眼、色、眼識、眼觸、眼觸因緣生諸受，乃至意、法、意識、意觸、意觸因緣生諸受亦如是。
何以故？菩薩摩訶薩行般若波羅蜜，般若波羅蜜字、菩薩、菩薩字，有為性中亦不見，無為性中亦不見。菩薩摩訶薩行般若波羅蜜，是法皆不作分別#41.73。
~1175
%35.68 （二）實相觀
是菩薩行般若波羅蜜，住不壞法中，#41.74修四念處時，不見般若波羅蜜、不見般若波羅蜜字、不見菩薩、不見菩薩字；乃至修十八不共法時，不見般若波羅蜜、不見般若波羅蜜字、不見菩薩、不見菩薩字。菩薩摩訶薩如是行般若波羅蜜時，但知諸法實相──諸法實相者，無垢無淨。#41.75
%35.69 （三）無依著觀
如是，須菩提！@t25p359a菩薩摩訶薩行般若波羅蜜時，當作是知名字假施設。
知假名字#41.76已，不著色，不著受、想、行、識；不著眼乃至意；不著色乃至法；不著眼識乃至不著意識；不著眼觸乃至不著意觸；不著眼觸因緣生受──若苦、若樂、若不苦不樂，乃至不著意觸因緣生受──若苦、若樂、若不苦不樂；不著有為性，不著無為性；不著檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜；不著三十二相，不著菩薩身；不著菩薩肉眼，乃至不著佛眼；不著智波羅蜜，不著神通波羅蜜；不著內空乃至不著無法有法空；不著成就眾生，不著淨佛世界，不著方便法。何以故？是諸法無著者、無著法、無著處，皆無故。
%35.70 （四）顯得益
如是，須菩提！菩薩摩訶薩行般若波羅蜜時，不著一切法，便增益檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜，入菩薩位，得阿鞞跋致地，具足菩薩神通；遊一佛國，至一佛國，成就眾生，恭敬、尊重、讚歎諸佛；為淨佛世界、為見諸佛供養，供養之具，善根成就故隨意悉得；亦聞諸佛所說法，#41.77聞已乃至阿耨多羅三藐三菩提終不忘失，得諸陀羅尼門、諸三昧門。
%35.71 （五）結勸菩薩學
如是，須菩提！菩薩摩訶薩行般若波羅蜜時，當知諸法名假施設！」
%35.72 二、別釋受假
%35.73 （一）歷舉諸科問答
%35.74 1、就「有」以明即離俱無菩薩#41.78
~1176
%35.75 （1）即諸法非菩薩
%35.76 A、五蘊非菩薩
「須菩提！於汝意云何？#41.79色是菩薩不？受、想、行、識是菩薩不？」
「不也！世尊！」
%35.77 B、六根非菩薩
「眼、耳、鼻、舌、身、意是菩薩不？」
「不也！世尊！」
%35.78 C、六境非菩薩
「色、聲、香、味、觸、法是菩薩不？」
「不也！世尊！」
%35.79 D、六識非菩薩
「眼識乃至意識是菩薩不？」
「不也！世尊！」
%35.80 E、六界非菩薩
「須菩提！於汝意云何？地種是菩薩不？」
「不也！世尊！」
「水、火、風、空、識種是菩薩不？」
「不也！世尊！」
%35.81 F、十二因緣非菩薩
「於須菩提意云何？無明是@t25p359b菩薩不？」
「不也！世尊！」
「乃至老死是菩薩不？」
「不也！世尊！」
%35.82 （2）離諸法非菩薩──離五蘊乃至離十二因緣非菩薩
「於須菩提意云何？離色是菩薩不？」
「不也！世尊！」
「乃至離老死是菩薩不？」
「不也！世尊！」
%35.83 2、就「如」以明即離俱無菩薩#41.80
%35.84 （1）即五蘊如相乃至即十二因緣如相非菩薩
「須菩提！於汝意云何？色如相是菩薩不？」
「不也！世尊！」
「乃至老死如相是菩薩不？」
~1177「不也！世尊！」
%35.85 （2）離五蘊如相乃至離十二因緣如相非菩薩
「離色如相乃至離老死如相是菩薩不？」
「不也！世尊！」
%35.86 （二）佛重責何以即諸法、離諸法、即諸法如、離諸法如皆非菩薩
佛告須菩提：「汝觀何等義言『色非菩薩，乃至老死非菩薩；離色非菩薩，乃至離老死非菩薩；色如相非菩薩，乃至老死如相非菩薩；離色如相非菩薩，乃至離老死如相非菩薩』？」
%35.87 （三）須菩提答眾生不可得、諸法畢竟不可得故
須菩提言：「世尊！眾生畢竟不可得，何況當是菩薩！色不可得，何況色、離色、色如、離色如是菩薩！乃至老死不可得，何況老死、離老死、老死如、離老死如是菩薩！」#41.81
%35.88 （四）如來稱歎勸學
佛告須菩提：「善哉！善哉！如是，須菩提！菩薩摩訶薩、眾生不可得故，般若波羅蜜亦不可得，當作是學！」#41.82
%35.89 三、別釋法假
%35.90 （一）諸法不可得
%35.91 1、舉諸法問答
%35.92 （1）五蘊非菩薩義
「於須菩提意云何#41.83？色是菩薩義不？」#41.84
~1178「不也！世尊！」
「受、想、行、識是菩薩義不？」
「不也！世尊！」
%35.93 （2）五蘊常、無常非菩薩義
「於須菩提意云何？色常是菩薩義不？」
「不也！世尊！」
「受、想、行、識常是菩薩義不？」
「不也！世尊！」
「色無常是菩薩義不？」
「不也！世尊！」
「受、想、行、識無常是菩薩義不？」
「不也！世尊！」
%35.94 （3）五蘊樂、苦非菩薩義
「色樂是菩薩義不？」
「不也！世尊！」
「受、想、行、識樂是菩薩義不？」
「不也！世尊！」
「色苦是菩薩義不？」
「不也！世尊！」
「受、想、行、識苦是菩薩義不？」
「不也！世尊！」
%35.95 （4）五蘊我、非我非菩薩義
「色我是菩薩義不？」
「不也！世尊！」
「受、想、行、識我是菩薩義不？」
「不也！世尊！」
「色非我是菩薩義不？」
「不也！世尊！」
「受、想、行、識非我是菩薩義不？」
「不也！世尊！」
%35.96 （5）五蘊空、非空非菩薩義
「於須菩提意云何？色空是菩薩義不？」
「不也！世尊！」@t25p359c
「受、想、行、識空是菩薩義不？」
「不也！世尊！」
「色非空是菩薩義不？」
「不也！世尊！」
「受、想、行、識非空是菩薩義不？」
~1179「不也！世尊！」
%35.97 （6）五蘊相、無相非菩薩義
「色相是菩薩義不？」
「不也！世尊！」
「受、想、行、識相是菩薩義不？」
「不也，世尊！」
「色無相是菩薩義不？」
「不也！世尊！」
「受、想、行、識無相是菩薩義不？」
「不也！世尊！」
%35.98 （7）五蘊作、無作非菩薩義
「色作是菩薩義不？」
「不也！世尊！」
「受、想、行、識作是菩薩義不？」
「不也！世尊！」
「色無作是菩薩義不？」
「不也！世尊！」
「受、想、行、識無作是菩薩義不？」
「不也！世尊！」
%35.99 （8）六根、六境乃至十二因緣亦如是
「乃至老死亦如是。」
%35.100 2、佛重責何以五蘊乃至十二因緣非菩薩義
佛告須菩提：「汝觀何等義言『色非菩薩義，受、想、行、識非菩薩義；乃至色、受、想、行、識無作非菩薩義；乃至老死亦如是』？」
%35.101 3、須菩提答#41.85
%35.102 （1）就根本答五蘊不可得故，五蘊、非五蘊皆非菩薩義
須菩提白佛言：「世尊！色畢竟不可得，何況無色是菩薩義！受、想、行、識，亦如是。
%35.103 （2）就相待門答
世尊！色常畢竟不可得，何況色無常是菩薩義！乃至識亦如是。世尊！色樂畢竟不可得，何況色苦是菩薩義！乃至識亦如是。世尊！色我畢竟不可得，何況色非我是菩薩義！乃至識亦如是。世尊！色有#41.86畢竟不可得，何況色空是菩薩義！乃至識亦如是。世尊！色相畢竟不可得，何況色無相是菩薩義！乃至識亦如是。世尊！色作畢竟不可得，何況色無作是菩薩義！乃至識亦如是。」
~1180
%35.104 4、如來稱歎勸學
佛告須菩提：「善哉！善哉！如是，須菩提！菩薩摩訶薩行般若波羅蜜，色義不可得，受、想、行、識義不可得；乃至無作義不可得，當作是學般若波羅蜜！
%35.105 （二）諸法不可見
須菩提！汝言：『我不見是法名菩薩。』須菩提！諸法不見諸法。諸法不見法性，法性不見諸法。法性不見地種，地種不見法性；乃至識種不見法性，法性不見識種。法性不見眼、色、@t25p360a眼識性，眼、色、眼識性不見法性；乃至法性不見意、法、意識性，意、法、意識性不見法性。須菩提！有為性不見無為性，無為性不見有為性。何以故？離有為不可說無為，離無為不可說有為。
%35.106 （三）不見故得無畏
%35.107 1、不見五蘊乃至佛道故，不見我乃至見者故
如是，須菩提！菩薩摩訶薩行般若波羅蜜，於諸法無所見，是時不驚、不畏、不怖，心亦不沒、不悔。何以故？是菩薩摩訶薩不見色、受、想、行、識故，不見眼乃至意，不見色乃至法#41.87，不見淫、怒、癡，不見無明乃至老死，不見我乃至知者、見者，不見欲界、色界、無色界，不見聲聞心、辟支佛心，不見菩薩、不見菩薩法，不見佛、不見佛法、不見佛道。是菩薩一切法不見故，不驚、不畏、不怖、不沒、不悔！」
%35.108 2、心心所法不可得、不可見故#41.88
須菩提白佛言：「世尊！何因緣故是菩薩心不怖、不沒、不悔？」
佛告須菩提：「菩薩摩訶薩一切心心數法不可得、不可見，以是故，菩薩摩訶薩心不怖、不沒、不悔。」
%35.109 3、意及意界不可得、不可見故
「世尊！云何菩薩心不驚、不畏、不怖？」
佛告須菩提：「是菩薩意及意界不可得、不可見，以是故不驚、不畏、不怖。
%35.110 （四）如來勸學
如是，須菩提！菩薩摩訶薩一切法不可得故，應行般若波羅蜜。
%35.111 （參）結成：菩薩名、菩薩、般若不可得，即是教菩薩般若波羅蜜
須菩提！菩薩摩訶薩一切行處，不得般若波羅蜜，不得菩薩名，亦不得菩薩心，即是教菩薩摩訶薩。」
^41.3
%36.0 壹、廣舉諸行勸學般若
%36.1 （壹）欲具足六波羅蜜菩薩本業行當學般若
爾時，須菩提白佛言#41.110：「世尊！菩薩摩訶薩欲具足檀波羅蜜，當學般若波羅蜜！欲具足尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜，當學般若波羅蜜！
%36.2 （貳）欲知五蘊乃至六受等所知境當學般若
菩薩摩訶薩欲知色，當學般若波羅蜜！乃至欲知識，當學般若波羅蜜！欲知眼乃至意，欲知色乃至法，欲知眼識乃至意識，欲知眼觸乃至意觸，欲知眼觸因緣生受乃至意觸因緣生受，@t25p361a當學般若波羅蜜！
%36.3 （參）欲斷五上分結等諸煩惱當學般若
欲斷婬瞋癡，當學般若波羅蜜！菩薩摩訶薩欲斷身見、戒取、疑、婬欲、瞋恚，色愛、無色愛、掉、慢、無明等一切結使及纏等#41.111，當學般若波羅蜜！欲斷四縛#41.112、四結#41.113、~1185四顛倒，#41.114當學般若波羅蜜！#41.115
%36.4 （肆）欲知十善道乃至十八不共法等行法當學般若
欲知十善道，欲知四禪，欲知四無量心、四無色定、四念處乃至十八不共法，當學般若波羅蜜！
%36.5 （伍）欲入六神通，欲得諸三昧、陀羅尼等勝行當學般若
菩薩摩訶薩欲入覺意三昧，當學般若波羅蜜！欲入六神通、九次第定、超越三昧，當學般若波羅蜜！欲得師子遊戲三昧，當學般若波羅蜜！欲得師子奮迅三昧，欲得一切陀羅尼門，當學般若波羅蜜！菩薩摩訶薩欲得首楞嚴三昧、寶印三昧、妙月三昧、月幢相三昧、一切法印三昧、觀印三昧、畢法性三昧、畢住相三昧、如金剛三昧、入一切法門三昧、三昧王三昧、王印三昧、淨力三昧、高出三昧、畢入一切辯才三昧、入諸法名三昧、觀十方三昧、諸陀羅尼門印三昧、一切法不忘三昧、攝一切法聚印三昧、虛空住三昧、三分清淨三昧、不退神通三昧、出鉢三昧、諸三昧幢相三昧──欲得如是等諸三昧門，#41.116當學般若波羅蜜！
%36.6 （陸）欲滿一切眾生願當學般若
復次，世尊！菩薩摩訶薩欲滿一切眾生願，當學般若波羅蜜！
^41.4
%36.19 （柒）欲離四事當學般若
%36.20 一、欲不墮惡趣、不生卑賤家、不住二乘地、不墮菩薩頂，當學般若
欲得具足如是善根，常不墮惡趣；欲得不生卑賤之家，欲得不住聲聞、辟支佛地中，欲得不墮菩薩頂者，當學般若波羅蜜！」
%36.21 二、明學有得失
%36.22 （一）無方便著空故墮頂
%36.23 1、不以方便行六度，入三解脫門，不墮二乘地，亦不入菩薩位，名菩薩生，是為墮頂
爾時，慧命舍利弗問須菩提：「云何為菩薩摩訶薩墮頂？」#41.132
~1188須菩提言：「舍利弗！若菩薩摩訶薩不以方便行六波羅蜜，入空、無相、無作三昧，不墮聲聞、辟支佛地，亦不入菩薩位，#41.133是名菩薩摩訶薩法#41.134生，故墮頂。」#41.135
%36.24 2、明順道法愛生
舍利弗問須菩提：「云何名菩薩生？」
須菩提答舍利弗言：「生名愛法#41.136。」
舍利弗言：「何等法愛？」
%36.25 （1）就三三昧明法愛#41.137
須菩提言：「菩薩摩訶薩行般若波羅蜜，色是空，受念著；受、想、行、識是#41.138空，受念著。舍利弗！是名菩薩摩訶薩順道法愛生。復次，舍利弗！菩薩摩訶薩，色是無相，受念著；受、想、行、識無相，受念著。色是無作，受念著；受、想、行、識無作，受念著。@t25p361c
%36.26 （2）就寂滅、無常、苦、無我明法愛#41.139
色是寂滅，受念著；受、想、行、識寂滅，受念著。色是無常，乃至識；色是苦，乃至識；色是無我，乃至識──受念著，是為菩薩順道法愛生。
%36.27 （3）就分別諸法門明法愛
是苦應知#41.140、集應斷、盡應證、道應修，是垢法、是淨法，是應近、是不應近，~1189是菩薩所應行、是非菩薩所應行，是菩薩道、是非菩薩道，是菩薩學#41.141、是非菩薩學，是菩薩檀波羅蜜乃至般若波羅蜜、是非菩薩檀波羅蜜乃至般若波羅蜜，是菩薩方便、是非菩薩方便，是菩薩熟、是非菩薩熟。舍利弗！菩薩摩訶薩行般若波羅蜜，是諸法受念著，是為菩薩摩訶薩順道法愛生。」
^41.5
%36.51 （二）有方便巧學得入菩薩位
~1192
%36.52 1、明菩薩不見空故不起空見
舍利弗問須菩提：「云何名菩薩摩訶薩無生#41.165？」
須菩提言#41.166：「菩薩摩訶薩行般若波羅蜜時，內空中不見外空，外空中不見內空；外空中不見內外空，內外空中不見外空；內外空中不見空空，空空中不見內外空；空空中不見大空，大空中不見空空；大空中不見第一@t25p362b義空，第一義空中不見大空；第一義空中不見有為空，有為空中不見第一義空；有為空中不見無為空，無為空中不見有為空；無為空中不見畢竟空，畢竟空中不見無為空；畢竟空中不見無始空，無始空中不見畢竟空；無始空中不見散空，散空中不見無始空；散空中不見性空，性空中不見散空；性空中不見諸法空，諸法空中不見性空；諸法空中不見自相空，自相空中不見諸法空；自相空中不見不可得空，不可得空中不見自相空；不可得空中不見無法空，無法空中不見不可得空；無法空中不見有法空，有法空中不見無法空；有法空中不見無法有法空，無法有法空中不見有法空。
舍利弗！菩薩摩訶薩行般若波羅蜜，得入菩薩位。
%36.53 2、明菩薩不見有故不起有見
%36.54 （1）不見一切諸法有
復次，舍利弗！菩薩摩訶薩欲學般若波羅蜜，應如是學：不念色、受、想、行、識，不念眼乃至意，不念色乃至法，不念檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜乃至十八不共法。
%36.55 （2）不念三心故不起有見
如是！舍利弗！菩薩摩訶薩行般若波羅蜜，得是#41.167心，不應念、不應高；無等等~1193心，不應念、不應高；大心，不應念、不應高。何以故？是心非心，心相常淨故。」#41.168
%36.56 （3）別辨「心相常淨」
%36.57 A、釋心相常淨
舍利弗#41.169語須菩提：「云何名心相常淨？」
須菩提言：「若菩薩知是心相，與婬、怒、癡，不合不離；諸纏、流、縛等諸結使、一切煩惱，不合不離；聲聞、辟支佛心，不合不離。舍利弗！是名菩薩心相~1194常淨。」
%36.58 B、論無心相有無義
舍利弗語須菩提：「有是無心相心不？」
須菩提報舍利弗言：「無心相中，有心相、無心相可得不？」
舍利@t25p362c弗言：「不可得！」
須菩提言：「若不可得，不應問『有是無心相#41.170心不』！」
%36.59 C、明無心相不壞不分別
舍利弗復問：「何等是無心相？」
須菩提言：「諸法不壞不分別，是名無心相。」#41.171
%36.60 D、廣例萬法皆不壞不分別
舍利弗問須菩提：「但是心不壞不分別，色亦不壞不分別乃至佛道亦不壞不分別耶？」
須菩提言：「若能知心相不壞不分別，是菩薩亦能知色乃至佛道不壞不分別。」
%36.61 貳、舍利弗讚歎、勸學
%36.62 （壹）舍利弗讚歎須菩提
爾時，慧命舍利弗讚須菩提：「善哉！善哉！汝真是佛子！從佛口生，從見法生，從法化生，取法分，不取財分，法中自信，身得證。如佛所說：『得無諍三昧中，汝最第一。』#41.172實如佛所舉。須菩提！菩薩摩訶薩應如是學般若波羅蜜，是中亦當分別知。菩薩如汝所說行，則不離般若波羅蜜。
%36.63 （貳）勸三乘當共學般若
須菩提！善男子、善女人欲學聲聞地，亦當應聞般若波羅蜜，持、讀、誦、正憶念、如說行；欲學辟支佛地，亦當應聞般若波羅蜜，持、讀、誦、正憶念、如說行；欲學菩薩地，亦當應聞般若波羅蜜，持、讀、誦、正憶念、如說行。何以故？是般若波羅蜜中廣說三乘；是中，菩薩摩訶薩、聲聞、辟支佛當學！」
%37.1 （壹）就「空門」破諸法顯般若#42.2
%37.2 一、須菩提以「謙讓門」說般若#42.3
^42.1
%37.0 壹、就三解脫門說般若#42.1
%37.3 （一）就眾生空說#42.4
爾時，慧命須菩提白佛言：「世尊！我不覺、不得是菩薩行般若波羅蜜，當為誰說般若波羅蜜？#42.5
%37.4 （二）就法空說
%37.5 1、以「非住非不住門」破菩薩名字及諸法#42.6
%37.6 （1）總明諸法集散不可得
~1200世尊！我不得一切諸法集散#42.7，若我為菩薩作字言菩薩，或當有悔！世尊！是字不住，亦不不住。何以故？是字無所有故。#42.8以是故，是字不住，亦不不住。#42.9
%37.7 （2）別明諸法集散不可得
%37.8 A、五陰
世尊！我不得色集散乃至識集散，若不可得，云何當作名字？世尊！以@t25p364a是因緣故，是字不住，亦不不住。何以故？是名字無所有故。
%37.9 B、六根
世尊！我亦不得眼集散乃至意集散，若不可得，云何當作名字，言是菩薩？世尊！是眼名字乃至意名字不住，亦不不住。何以故？是名字無所有故。以是故，是字不住，亦不不住。
%37.10 C、六塵、六識、六觸、六受
世尊！我不得色集散乃至法集散，若不可得，云何當作名字，言是菩薩？世尊！是色字乃至法字不住，亦不不住。何以故？是字無所有故。以是故，是字不住，亦不不住。
眼識乃至意識，眼觸乃至意觸，眼觸因緣生受乃至意觸因緣生受，亦如是。
%37.11 D、十二因緣
世尊！我不得無明集散，乃至不得老死集散。世尊！我不得無明盡集散，乃至不得老死盡集散。
%37.12 E、三毒、邪見
世尊！我不得婬怒癡集散、諸邪見集散，皆亦如是。
%37.13 F、六度、三十七道品、三解脫門、諸禪定、十念，乃至佛功德
世尊！我不得六波羅蜜集散，四念處集散乃至八聖道分集散，空、無相、無作集散，四禪、四無量心、四無色定集散，念佛、念法、念僧、念戒、念捨、念天、念善、念入出息、念身、念死集散；我亦不得佛十力乃至十八不共法集散。世尊！我若不得六波羅蜜乃至十八不共法集散，云何當作字，言是菩薩？世尊！是字不~1201住，亦不不住。何以故？是字無所有故。以是故，是字不住，亦不不住。
%37.14 G、如夢、如響、如影、如焰、如化五陰
世尊！我不得如夢五陰集散，我不得如響、如影、如焰、如化五陰集散，亦如上說。
%37.15 H、離、寂滅、不生不滅、不示、不垢不淨
世尊！我不得離集散，我不得寂滅、不生不滅、不示、不垢不淨集散。世尊！我不得如、法性、實際、法相、法位集散，亦如上說。
%37.16 I、善法、不善法，有為法、無為法，有漏法、無漏法，三世法、非三世法
我不得諸善不善法集散，我不得有為無為法、有漏無漏法集散，過去、未來、現在法集散，不過去、不未來、不現在法集散。何等是不過去、不未來@t25p364b、不現在？所謂無為法。世尊！我亦不得無為法集散。
%37.17 J、諸佛、菩薩、聲聞僧
世尊！我亦不得佛集散。世尊！我亦不得十方如恒河沙等世界諸佛及菩薩、聲聞僧集散。世尊！我若#42.10不得諸佛集散，云何當教菩薩摩訶薩般若波羅蜜？世尊！是菩薩字不住，亦不不住。何以故？是字無所有故。#42.11以是故，是字不住，亦不不住。
%37.18 K、諸法實相
世尊！我亦不得是諸法實相集散，云何當與菩薩作字，言是菩薩？世尊！是諸法實相名字不住，亦不不住。何以故？是名字無所有故。以是故，是名字不住，亦不不住。
^42.2
%37.73 2、以「異門」破菩薩名字
世尊！諸法因緣和合#42.60，假名施設，所謂菩薩。是名字於五受#42.61陰中不可說，十二入、十八界，乃至十八不共法中不可說，於和合法中亦不可說。#42.62
世尊！譬如夢，於諸法中不可說；響、影、焰、化，於諸法中亦不可說；譬如名虛空#42.63，亦無法中可說。
世尊！如地、水、火、風名，亦無法中可說；戒、三昧、智慧、解脫、解脫知見名，亦無法中可說；如須陀洹名字，乃至阿羅漢、辟支佛名字，亦無法中可說；如佛名、法名，亦無法中可說；所謂若善、若不善，若常、若無常，若苦、若樂，若我、若無我，若寂滅、若離，若有、若無。#42.64
世尊！我以是義故心悔：一切諸法集散相不可得，若#42.65為菩薩作字，言是菩薩。世@t25p365c尊！是字不住，亦不不住。何以故？是字無所有故。以是故，是字不住，亦不不住。
%37.74 （三）聞般若相義，心不驚怖沒悔，必住不退性中
若菩薩摩訶薩聞作是說，般若波羅蜜如是相、如是義，心不沒、不悔、不驚、不畏、不怖，當知是菩薩必住阿鞞跋致性中，住不住法故。#42.66
^42.3
%37.95 二、須菩提以「不住門」說般若#42.79
%37.96 （一）正明無住行#42.80
~1212
%37.97 1、不住世出世法
%37.98 （1）不住世法
復次，世尊！菩薩摩訶薩欲行般若波羅蜜，色中不應住，受、想、行、識中不應住；眼、耳、鼻、舌、身、意中不應住，色、聲、香、味、觸、法中不應住；眼識乃至意識中不應住，眼觸乃至意觸中不應住，眼觸因緣生受乃至意觸因緣生受中不應住；地種，水、火、風、空、識種中不應住；無明乃至老死中不應住。
何以故？世尊！色、色相空，受、想、行，識、識#42.81相空。世尊！色空不名為色，離空亦無色；色即是空，空即是色。受、想、行，識#42.82空不名為識，離空亦無識；識即是空，空即是識。乃至老死、老死相空。世尊！老死空不名為老死，離空亦無老死；老死即是空，空即是老死。
世尊！以是因緣故，菩薩摩訶薩欲行@t25p366b般若波羅蜜，不應色中住，乃至老死中亦不應住。
%37.99 （2）不住出世法
復次，世尊！菩薩摩訶薩欲行般若波羅蜜，四念處中不應住。何以故？四念處、四念處相空。世尊！四念處空不名為四念處，離空亦無四念處；四念處即是空，空即是四念處。乃至十八不共法亦如是。
世尊！以是因緣故，菩薩摩訶薩欲行般若波羅蜜，四念處乃至十八不共法中不應住。
復次，世尊！菩薩摩訶薩欲行般若波羅蜜，檀波羅蜜中不應住，尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜中不應住。何以故？檀波羅蜜、檀波羅蜜相空，乃至般若波羅蜜、般若波羅蜜相空。世尊！檀波羅蜜空不名為檀波羅蜜，離空亦無檀波羅蜜；檀波羅蜜即是空，空即是檀波羅蜜。乃至般若波羅蜜亦如是。世尊！以是因緣故，菩薩摩訶薩欲行般若波羅蜜，不應六波羅蜜中住。
^42.4
%37.122 2、不住文字、禪定
%37.123 （1）不住文字
復次，世尊！菩薩摩訶薩欲行般若波羅蜜，文字中不應住，一字門、二字門，如是種種字門中不應住。何以故？諸字、諸字相空故，亦如上說。
%37.124 （2）不住禪定
復次，世尊！菩薩摩訶薩欲行般若波羅蜜，諸神通中不應住。何以故？諸神通、諸神通相空。神通空不名為神通，離空亦無神通；神通即是空，空即是神通。世尊！以是因緣故，菩薩摩訶薩欲行般若波羅蜜，諸神通中不應住。
^42.5
~1216
%37.133 3、不住無常、苦、無我、空、寂滅、離等聖行
復次，世尊！菩薩摩訶薩欲行般若波羅蜜，色是無常，不應住；受、想、行、識是無常，不應住。何以故？無常、無常相空。世尊！無常空不名無常，離空亦無無常；無常即是空，空即是無常。世尊！以是因緣故，菩薩摩訶薩欲行般若波羅蜜，色是無常，不應住；受、想、行、識是無常，不應住。
色是苦，不應住；受、想、行、識是苦，不應住。色是無我，不應住；受、想、行、識是無我，不應住。色是空，不應住；受、想、行、識是空，不應住。色是寂滅，不應住；受、想、行、識是寂滅，不應住。色是離，不應住；受、想、行、識是離，不應住──亦如上說。
%37.134 4、不住如、法性、法相、法位、實際
復次，世尊！菩薩摩訶薩欲行般若波羅蜜，如相中#42.101不應住。何以故？如相、如相#42.102空。世尊！如相空不名為如，離空亦無如；如即是空，空即是如。
世尊！菩薩摩訶薩欲行般若波羅蜜，法性、法相、法位、實際中不應住。何以故？實際空。世尊！實際空不名為實際，離空亦無實際；實際即是空，空即是實際。
%37.135 5、不住陀羅尼門、三昧門
復次，世尊！菩薩摩訶薩欲行般若波羅蜜，一切陀羅尼門中不應住，一切三昧門中不應住。何以故？陀羅尼門、陀羅尼門相空，三昧門@t25p367b、三昧門相空。世尊！陀羅尼門、三昧門空不名為陀羅尼門、三昧門，離空亦無陀羅尼、三昧門；陀羅尼、三昧門即是空，空即是陀羅尼、三昧門。世尊！以是因緣故，菩薩摩訶薩欲行般若波羅蜜，乃#42.103至陀羅尼、三昧門中不應住。
%37.136 （二）明有住行為失
世尊！如菩薩摩訶薩欲行般若波羅蜜，無方便故，以吾我心，於色中住，是菩薩作色行；以吾我心，於受、想、行、識中住，是菩薩作識行。若菩薩作行者，不受般若波羅蜜，亦不具足般若波羅蜜；不具足般若波羅蜜故，不能得成就薩婆若。#42.104
世尊！如是菩薩摩訶薩欲行般若波羅蜜，無方便故，以吾我心，於十二入乃至陀羅尼、三昧門中住，是菩薩作十二入乃至作陀羅尼、三昧門行。若菩薩作行者，不受~1217般若波羅蜜，亦不具足般若波羅蜜；不具足般若波羅蜜故，不能得成就薩婆若。
%37.137 （三）明無住行為得
何以故？色是不受，受、想、行、識是不受。色不受則非色，性空故；受、想、行，識不受則非識，性空故。#42.105十二入是不受，乃至陀羅尼、三昧門是不受。十二入不受，則非十二入；乃至陀羅尼、三昧門不受，則非陀羅尼、三昧門，性空故。般若波羅蜜亦不受；般若波羅蜜不受，則非般若波羅蜜，性空故。如是菩薩摩訶薩欲行般若波羅蜜，應觀諸法性空。如是觀心無行處，是名菩薩摩訶薩不受三昧廣大之用，不與聲聞、辟支佛共。#42.106
是薩婆若慧亦不受，內空故，外空、內外空、空空、大空、第一義空、有為空、無為空、畢竟空、無始空、散空、性空、自相空、諸法空、不可得空、無法空、有法空、無法有法空故。
何以故？是薩婆若@t25p367c不可以相行得，相行有垢故。
何等是垢相？色相乃至諸#42.107陀羅尼、三昧門相，是名垢相。#42.108
^42.6
%37.152 （四）舉先尼事以小說大#42.125
是相若受、若修可得薩婆若者，#42.126先尼梵志於一切智中終不生信。云何為信？信般~1220若波羅蜜，分別解知，稱量思惟，不以相法，不以無相法。如是先尼梵志，不取相，住信行中；用性空智，#42.127入諸法相，不受色，不受受、想、行、識。何以故？諸法自相空故，不可得受。#42.128
是先尼梵志非內觀得故見是智慧，非外觀得故見是智慧，非內非外觀得故見是智慧，亦不無智慧觀得故見是智慧。#42.129何以故？梵志不見是法、知#42.130者、知法、知處故。#42.131
此梵志非內色中見是智慧，非內受想行識中見是智慧；非外色中見是智慧，非外受想行識中見是智慧；非內外色中見是智慧，非內外受想行識中見是智慧；亦不離色、受、想、行、識中見是智慧，內外空故。#42.132
先尼梵志此中心@t25p368b得信解於一切智，以是故，梵志信諸法實相，一切法不可得故。如是信解已，無法可受，諸法無相、無憶念故。是梵志於諸法亦無所得──若取、若捨，取捨不可得故。#42.133是梵志智慧亦不念#42.134，諸法相不念故。#42.135
~1221
%37.153 （五）結明菩薩般若
世尊！是名菩薩摩訶薩般若波羅蜜，此彼岸不度故。是菩薩色、受、想、行、識不受，一切法不受故；乃至諸陀羅尼、三昧門亦不受，一切法不受故。是菩薩於是中亦不取涅槃，未具足四念處乃至八聖道分，未具足十力乃至十八不共法。#42.136
何以故？是四念處非四念處，乃至十八不共法非十八不共法──是諸法非法，亦不非法。是名菩薩摩訶薩般若波羅蜜，色不受乃至十八不共法不受。#42.137
^43.1
%37.187 三、須菩提以「思惟門」說般若#43.1
%37.188 （一）思惟三義──何者是般若，何故名般若，般若屬誰
「復次，世尊！菩薩摩訶薩欲行般若波羅蜜，應如是思惟：何者是般若波羅蜜？何以故名般若波羅蜜？是誰般若波羅蜜？#43.2
%37.189 1、何者是般若：諸法無所有、不可得即為般若
若菩薩摩訶薩行般若波羅蜜，如是念：若法無所有、不@t25p369c可得，是般若波羅蜜。」
%37.190 2、般若、五度、五眾，乃至十八不共法無所有、不可得
爾時，舍利弗問須菩提：「何等法無所有、不可得？」
須菩提言：「般若波羅蜜，是法無所有、不可得；禪波羅蜜、毘梨耶波羅蜜、羼提波羅蜜、尸羅波羅蜜、檀波羅蜜，是法無所有、不可得──內空故，外空、內外空、空空、大空、第一義空、有為空、無為空、畢竟空、無始空、散空、性空、自相空、諸法空、不可得空、無法空、有法空、無法有法空故。
舍利弗！色法，無所有、不可得；受、想、行、識法，無所有、不可得。
內空法，無所有、不可得；乃至無法有法空法，無所有、不可得。
舍利弗！四念處法，無所有、不可得；乃至十八不共法，無所有、不可得。
舍利弗！諸神通法，無所有、不可得；如相法，無所有、不可得；法性、法相、法~1229住、法位、實際法，無所有、不可得。
舍利弗！佛，無所有、不可得；薩婆若法，無所有、不可得；一切種智法，無所有、不可得──內空乃至無法有法空故。
%37.191 3、菩薩若觀諸法無所有、不可得，心無怖畏，當知是菩薩不離般若行
舍利弗！若菩薩摩訶薩如是思惟、如是觀時，心不沒、不悔，不驚、不畏、不怖，當知是菩薩不離般若波羅蜜行。」
舍利弗問須菩提：「何因緣故，當知菩薩不離般若波羅蜜行？」
須菩提言：「色離色性，受、想、行，識離識性；六波羅蜜離六波羅蜜性，乃至實際離實際性。」#43.3
舍利弗復問須菩提：「云何是色性？云何是受、想、行、識性？云何乃至實際性？」
須菩提言：「無所有是色性，無所有是受、想、行、識性，乃至無所有是實際性。
舍利弗！以是因緣故，當知色離色性，受、想、行，識離識性，乃至實際離實際性。
舍利弗！色亦離色相，受、想、行，識亦離識相，乃至實際亦離實際相。相亦離相，性亦離性。」#43.4@t25p370a
%37.192 （二）顯所得益
%37.193 1、漸近薩婆若，漸得三清淨，不生諸惡心
舍利弗問須菩提：「菩薩摩訶薩若如是學，得成就薩婆若？」
須菩提言：「如是！如是！舍利弗！若菩薩摩訶薩如是學，得成就薩婆若。何以故？以諸法不生、不成就故。」
舍利弗問須菩提：「何因緣故，諸法不生、不成就？」
須菩提言：「色，色空，是色生、成就不可得；受、想、行，識，識空，是識生、成就不可得。乃至實際、實際空，是實際生、成就不可得。#43.5
舍利弗！菩薩摩訶薩如是學，漸近薩婆若，漸得身清淨、心清淨、相清淨。#43.6漸得身~1230清淨、心清淨、相清淨故，是菩薩不生染心、不生瞋心、不生癡心、不生憍慢心、不生慳貪心、不生邪見心。
%37.194 2、常得化生，遊諸佛國，嚴土熟生，終不離佛
是菩薩不生染心乃至不生邪見心故，終不生母人腹中，常得化生；從一佛國至一佛國，成就眾生、淨佛世界#43.7，乃至阿耨多羅三藐三菩提，終不離諸佛。#43.8
%37.195 （三）結成
舍利弗！菩薩摩訶薩當作是行般若波羅蜜，當作是學般若波羅蜜。」
^43.2
%37.239 （貳）就「無相門」破諸法顯般若#43.50
%37.240 一、明無方便行般若
%37.241 （一）明著法而取相
%37.242 1、著於外法
爾時，須菩提白佛言：「世尊！若菩薩摩訶薩無方便欲行般若波羅蜜，若行色為行相，若行受、想、行、識為行相；#43.51若色是常行為行相，若受、想、行、識是常行為行相；若色是無常行為行相，若受、想、行、識是無常行為行相；若色是樂行為行相，若受、想、行、識是樂行為行相；若色是苦行為行相，若受、想、行、識是苦行為行相；若色是有行為行相，若受、想、行、識是有行為行相；若色是空行為行相，若受、想、行、識是空行為行相；若色是我行為行相，若受、想、行、識是我行為行相；若色是無我行為行相，若受、想、行、識是無我行為行相；若色是離行為行相，若受、想、行、識是離行為行相；若色是寂滅行為行相，若受、想、行、識是寂滅行為行相。
世尊！若菩薩摩訶薩無方便行四念處為行相，乃至#43.52十八不共法為行相。
%37.243 2、著於內法
世尊！若菩薩摩訶薩行般若波羅蜜時，作是念『我行般若波羅蜜有所得行』，亦是行相。
%37.244 3、著於行法
世尊！若菩薩摩訶薩作是念『能如是行，是修行般若波羅蜜』，亦是行相。
%37.245 4、結
當知是菩薩摩訶薩行般若波羅蜜無方便！」
%37.246 （二）無方便之失
%37.247 1、不離生死
須菩提語舍利弗：「若菩薩摩訶薩行般若波羅蜜時，色受念妄解#43.53；若色受念妄解，~1237為色故作行；若為色作行，不得離生老@t25p371c病死憂悲苦惱及後世苦。#43.54若菩薩摩訶薩行般若波羅蜜時無方便，眼受念妄解乃至意，色乃至法；眼識界乃至意識界，眼觸乃至意觸，眼觸因緣生受乃至意觸因緣生受，四念處，乃至十八不共法受念妄解，為十八不共法故作行。若為作行，是菩薩不能得離生老病死、憂悲苦惱及後世苦。
%37.248 2、失菩提果
如是菩薩尚不能得聲聞、辟支佛地證，何況得阿耨多羅三藐三菩提！無有是處。
%37.249 3、結成
舍利弗！當知是菩薩摩訶薩行般若波羅蜜無方便。」
%37.250 二、明有方便行般若
舍利弗問須菩提：「云何當知是菩薩摩訶薩行般若波羅蜜有方便？」
%37.251 （一）不受不著之行
%37.252 1、於外無所著故得
須菩提語舍利弗：「若菩薩摩訶薩欲行般若波羅蜜時，不行色，不行受、想、行、識；不行色相，不行受、想、行、識相；不行色、受、想、行、識常，不行色、受、想、行、識無常；不行色、受、想、行、識樂，不行色、受、想、行、識苦；不行色、受、想、行、識我，不行色、受、想、行、識無我；不行色、受、想、行、識空，不行色、受、想、行、識無相，不行色、受、想、行、識無作；不行色、受、想、行識離，不行色、受、想、行、識寂滅。
何以故？舍利弗！是色空為非色，離空無色，離色無空，色即是空，空即是色；受、想、行，識空為非識，離空無識，離識無空，空即是識，識即是空；乃至十八不共法空為非十八不共法，離空無十八不共法，離十八不共法無空，空即是十八不共法，十八不共法即是空。
如是，舍利弗！當知是菩薩摩訶薩行般若波羅蜜有方便。是菩薩摩訶薩如是行般若波羅蜜，能得阿耨多羅三藐三菩提。
%37.253 2、於內無所受故得
是菩薩摩訶薩行般若波羅蜜時，行亦不受，不行亦不受，@t25p372a行不行亦不受，非行非不行亦不受，不受亦不受。」#43.55
~1238舍利弗語須菩提：「菩薩摩訶薩行般若波羅蜜時，何因緣故不受？」
須菩提言：「是#43.56般若波羅蜜自性不可得故不受。何以故？無所有性是般若波羅蜜。舍利弗！以是故，菩薩摩訶薩行般若波羅蜜，行亦不受，不行亦不受，行不行亦不受，非行非不行亦不受，不受亦不受。
何以故？一切法性無所有，不隨諸法行，不受諸法相故；是名菩薩摩訶薩諸法無所受三昧廣大之用，不與聲聞、辟支佛共。是菩薩摩訶薩行是三昧不離，疾得阿耨多羅三藐三菩提。」#43.57
^43.3
%37.283 （二）於諸三昧、陀羅尼無分別念行
~1242
%37.284 1、依世俗諦說行諸三昧及陀羅尼故得益
%37.285 （1）疾得佛菩提
舍利弗言：「但不離是三昧，令菩薩摩訶薩疾得阿耨多羅三藐三菩提，更有諸餘三昧？」
須菩提語舍利弗言：「更有諸餘三昧，菩薩摩訶薩行是三昧，疾得阿耨多羅三藐三菩提。」
舍利弗言：「何等三昧，菩薩摩訶薩行是，疾得阿耨多羅三藐三菩提？」
須菩提言：「諸菩薩摩訶薩有三昧名（1）首楞嚴，行是三昧，令菩@t25p373a薩摩訶薩疾得阿耨多羅三藐三菩提；有名（2）寶印三昧、（3）師子遊戲三昧、（4）妙月三昧、（5）月幢相三昧、（6）諸法印三昧、（7）觀頂三昧、（8）畢法性三昧、（9）畢幢相三昧、（10）金剛三昧、（11）入法印三昧、（12）三昧王安立三昧#43.78、（13）放光三昧、（14）力進三昧、（15）出生三昧、（16）必入辯才三昧、（17）入名字三昧、（18）觀方三昧、（19）陀羅尼印三昧、（20）不妄三昧#43.79、（21）攝諸法海印三昧、（22）遍覆虛空三昧、（23）金剛輪三昧、（24）寶斷三昧、（25）普照三昧、（26）不求三昧、（27）無處住三昧、（28）無心三昧、（29）淨燈三昧、（30）無邊明三昧、（31）能作明三昧、（32）普遍明三昧、（33）堅淨諸三昧三昧、（34）無垢明三昧、（35）作樂三昧、（36）電光三昧、（37）無盡三昧、（38）威德三昧、（39）離盡三昧、（40）不動三昧、（41）莊嚴三昧、（42）日光三昧、（43）月淨三昧、（44）淨明三昧、（45）能作明三昧、（46）作行三昧、（47）知相三昧、（48）如金剛三昧、（49）心住三昧、（50）遍照三昧、（51）安立#43.80三昧、（52）寶頂三昧、（53）妙法印三昧、（54）法等三昧#43.81、（55）生#43.82喜三昧、（56）到法頂三昧、（57）能散三昧、（58）壞諸法處三昧、（59）字等相三昧、（60）離字三昧、（61）斷緣三昧、（62）不壞三昧、（63）無種相三昧、（64）無處行三昧、（65）離闇三昧、（66）無去三昧、（67）不動#43.83三昧、（68）度緣三昧、（69）集諸功德三昧、（70）住無心三昧、（71）妙淨華三昧、（72）覺意三昧、（73）無量辯三昧、（74）無等等三昧、（75）度諸法三昧、（76）分別諸法三昧、（77）散疑三昧、（78）無住處三昧、（79）一相三昧#43.84、〔一性~1243三昧#43.85、〕（80）生行三昧、（81）一行三昧、（82）不一行三昧、（83）妙行三昧、（84）達一切有底散三昧、（85）入言語三昧、（86）離音聲字語三昧、（87）然炬三昧、（88）淨相三昧、（89）破相三昧、（90）一切種妙足三昧、（91）不喜苦樂三昧、（92）不盡行三昧、（93）多陀羅尼三昧、（94）攝#43.86諸邪正相三昧、（95）滅憎愛三昧、（96）逆順三昧、（97）淨光三昧、（98）堅固三昧、（99）滿月淨光@t25p373b三昧、（100）大莊嚴三昧、（101）能照一切世三昧#43.87、（102）三昧等三昧#43.88、（103）無諍行三昧、（104）無住處樂三昧、（105）如住定三昧、（106）壞身衰三昧、（107）壞語如虛空三昧、（108）離著如虛空不染三昧。舍利弗！是菩薩摩訶薩行是諸三昧，疾得阿耨多羅三藐三菩提。
復有無量阿僧祇三昧門、陀羅尼門，菩薩摩訶薩學是三昧門、陀羅尼門，疾得阿耨多羅三藐三菩提。」
%37.286 （2）得諸佛授記
慧命須菩提隨佛心言：「當知是菩薩摩訶薩行是諸三昧者，以為過去諸佛#43.89所授記，今現在十方諸佛亦授是菩薩記。
%37.287 2、依勝義諦明於諸三昧不知不念
是菩薩不見是諸三昧，亦不念是三昧；亦不念：『我當入是三昧，我今入是三昧，我已入是三昧。』是菩薩摩訶薩都無分別念。」
舍利弗問須菩提：「菩薩摩訶薩住是諸三昧已，從過去佛授記耶？」
須菩提報言：「不也！舍利弗！何以故？般若波羅蜜不異諸三昧，諸三昧不異般若波羅蜜；菩薩不異般若波羅蜜及三昧，般若波羅蜜及三昧不異菩薩；般若波羅蜜即是三昧，三昧即是般若波羅蜜；菩薩即是般若波羅蜜及三昧，般若波羅蜜及三昧即是菩薩。」
舍利弗語須菩提：「若三昧不異菩薩，菩薩不異三昧，三昧即是菩薩，菩薩即是三昧，菩薩云何知一切諸法等三昧？」#43.90
~1244須菩提言：「若菩薩入是三昧，是時不作是念：『我以是法入是三昧。』以是因緣故，舍利弗！是菩薩於諸三昧不知不念。」#43.91
舍利弗言：「何以故不知不念？」
須菩提言：「諸三昧無所有故，是故菩薩不知不念。」#43.92
%37.288 三、佛述成
爾時，佛讚言：「善哉！善哉！須菩提！如我說汝行無諍三昧第一，與此義相應。@t25p373c菩薩摩訶薩應如是學般若波羅蜜、禪波羅蜜、毘梨耶波羅蜜、羼提波羅蜜、尸羅波羅蜜、檀波羅蜜；四念處乃至十八不共法，亦應如是學！」
^43.4
~1246
%37.297 四、學般若以無所得為方便
%37.298 （一）學諸法不可得是為學般若
舍利弗白佛言：「世尊！菩薩摩訶薩如是學，為學般若波羅蜜耶？」
佛告舍利弗：「菩薩摩訶薩如是學，為學般若波羅蜜，是法不可得故；乃至學檀波羅蜜，是法亦不可得故；學四念處乃至學十八不共法，是法不可得故。」#43.102
舍利弗白佛言：「世尊！如是菩薩摩訶薩學般若波羅蜜，是法不可得耶？」
佛言：「如是！菩薩摩訶薩學般若波羅蜜，是法不可得。」
%37.299 （二）明人法不可得，畢竟淨故
%37.300 1、我乃至見者不可得，五陰等諸法不可得
舍利弗言：「世尊！何等法不可得？」
佛言：「我不可得，乃至知者、見者不可得，畢竟淨故。
五陰不可得、十二入不可得、十八界不可得，畢竟淨故。
無明不可得，畢竟淨故；乃至老死不可得，畢竟淨故。
苦諦不可得，畢竟淨故；集、滅、道諦不可得，畢竟淨故。
欲界不可得，畢竟淨故；色界、無色界不可得，畢竟淨故。
四念處不可得，畢竟淨故；乃至十八不共法不可得，畢竟淨故。
六波羅蜜不可得，畢竟淨故。
須陀洹不可得，畢竟淨故；斯陀含、阿那含、阿羅漢、辟支佛不可得，畢竟淨故；菩薩不可得，畢竟淨故；佛不可得，畢竟淨故。」
%37.301 2、明「畢竟淨」
舍利弗白佛言：「世尊！何等是畢竟淨？」
佛言：「不出不生、無得無作，是名畢竟淨。」#43.103
%37.302 （三）如法而學，實無所學
%37.303 1、菩薩於諸法無所學
舍利弗白佛言：「世尊！菩薩摩訶薩若如是學，為學何等法？」
佛告舍利弗：「菩薩摩訶薩如是學，於諸法無所學。何以故？舍利弗！諸法相不如凡夫所著。」
%37.304 2、無明凡夫著無所有
%37.305 （1）諸法無所有，不知即無明
舍利弗白佛言：「世尊！諸法實相云何有？」
佛言：「諸法無所有，如是有；如@t25p374b是無所有，是事不知，名為無明。」#43.104
~1247
%37.306 （2）十八空故五陰等諸法無所有
舍利弗白佛言：「世尊！何等無所有，是事不知，名為無明？」
佛告舍利弗：「色、受、想、行、識無所有，內空乃至無法有法空故；四念處乃至十八不共法無所有，內空乃至無法有法空故。
%37.307 （3）無明凡夫取著生過
%37.308 A、凡夫無明故，不知不見諸法無所有
是中凡夫以無明力渴愛故，妄見分別，說是無明。
是凡夫為二邊所縛，是人不知不見諸法無所有，而憶想分別著色乃至十八不共法；是人著故，於無所有法而作識知見，是凡夫不知不見。#43.105
何等不知不見？
不知不見色，乃至十八不共法亦不知不見，以是故墮凡夫數，如小兒。
%37.309 B、顯所生過
%37.310 （A）不出三界，不能離二乘
是人不出。於何不出？
不出欲界，不出色界，不出無色界；聲聞、辟支佛法中不出。
%37.311 （B）不信諸法空
是人亦不信。不信何等？
不信色空，乃至不信十八不共法空。
%37.312 （C）不住六度乃至十八不共法
是人不住。不住何等？
不住檀波羅蜜，乃至不住般若波羅蜜；不住阿毘#43.106跋致地，乃至不住十八不共法。
%37.313 （D）失諸功德故名為凡夫、如小兒、著者
以是因緣故，名為凡夫，如小兒，亦名著者。
何等為著？
著色乃至識，著眼入乃至意入，著眼界乃至意識界，著婬怒癡、著諸邪見，著四念處乃至著佛道。#43.107
~1248
%37.314 五、雙明有無方便行及其得失
%37.315 （一）無方便行及其過失
舍利弗白佛言：「世尊！若菩薩摩訶薩作如是學，亦不學般若波羅蜜，不得薩婆若？」
佛語舍利弗：「菩薩摩訶薩作如是學，亦不學般若波羅蜜，不得薩婆若。」
舍利弗白佛言：「世尊！何以故菩薩摩訶薩亦不學般若波羅蜜，不得薩婆若？」
佛告舍利弗：「菩薩摩訶薩無方便故，想念分別，著般若波羅蜜，著禪波羅蜜、毘梨耶波羅蜜、羼提波羅蜜、尸羅波羅蜜、檀波羅蜜，乃至十八不共法、一切種智，隨念分別著。以是@t25p374c因緣故，菩薩摩訶薩如是學，亦不學般若波羅蜜，不得薩婆若。」
舍利弗白佛言：「世尊！若菩薩摩訶薩如是學，亦不學般若波羅蜜，不得薩婆若？」#43.108
佛告舍利弗：「菩薩摩訶薩如是學，不學般若波羅蜜，不得薩婆若。」
%37.316 （二）有方便行及其得益
舍利弗白佛言：「世尊！菩薩摩訶薩今云何應學般若波羅蜜，得薩婆若？」
佛告舍利弗言：「若菩薩摩訶薩學般若波羅蜜時，不見般若波羅蜜。舍利弗！菩薩摩訶薩如是學，學般若波羅蜜，得薩婆若，以不可得故。」
舍利弗白佛言：「世尊！云何名不可得？」
佛言：「諸法內空乃至無法有法空故。」#43.109
^44.1
$$壹、就三解脫門說般若
$$（壹）就「空門」破諸法顯般若（承上卷42～43）
$$（貳）就「無相門」破諸法顯般若（承上卷43）
%37.341 （參）就「無作門」破諸法顯般若#44.2
%37.342 一、菩薩應如幻人等學諸法而無所得
%37.343 （一）舉如幻喻
%37.344 1、明五蘊乃至佛果皆與幻無異
爾時，慧命須菩提#44.3白佛言：「世尊！若當有人問言：『幻人學般若波羅蜜，當得薩婆若不？幻人學禪波羅蜜、毘梨耶波羅蜜、羼提波羅蜜、尸羅波羅蜜、檀波羅蜜，學四念處乃至十八不共法及一切種智，得薩婆若不？』我當云何答？」
佛告須菩提：「我還問汝，隨汝意答我。須菩提！於汝意云何？色與幻有異不？受、想、行、識與幻有異不？」
須菩提言：「不也！世尊！」
佛言：「於汝意云何？眼與幻有異不？乃至意與幻有異不？色乃至法與幻有異不？眼界乃至意識界與幻有異不？眼觸乃至意觸、眼觸因緣生受乃至意觸因緣生受與幻有異不？」
須菩提言：「不也！世尊！」
「於汝意云何？四念處與幻有異不？乃至八聖道分與幻有異不？」
「不也！世尊！」
「於汝意云何？空、無相、無作與幻有異不？」
「不也！世尊！」
~1253「須菩提！於汝意云何？檀波羅蜜與幻有異不？乃至十八不共法與幻有異不？」
「不也！世尊！」
「須菩提！於汝意云何？阿耨多羅三藐三菩提與幻有異不？」
「不也！世尊！何以故？色不異幻，幻不異色，色即是幻，幻即是色。#44.4世尊！受想行識不異幻，幻不異受想行識，識即是幻，幻即是識。
世尊！眼不異幻，幻不異眼，眼即是幻，幻即是眼。眼觸@t25p376a因緣生受乃至意觸因緣生受亦如是。
世尊！四念處不異幻，幻不異四念處，四念處即是幻，幻即是四念處，乃至阿耨多羅三藐三菩提不異幻，幻不異阿耨多羅三藐三菩提，阿耨多羅三藐三菩提即是幻，幻即是阿耨多羅三藐三菩提。」
%37.345 2、諸法不生不滅，但有名字，無所得
%37.346 （1）諸法與幻無異，不垢不淨，不生不滅，無所得
佛告須菩提：「於汝意云何？幻有垢有淨不！」
「不也！世尊！」
「須菩提！於汝意云何？幻有生有滅不？」
「不也！世尊！」#44.5
「若法不生不滅#44.6，是法能學般若波羅蜜，當得薩婆若不？」
「不也！世尊！」#44.7
%37.347 （2）諸法但有名字，不作業，無所得
「於汝意云何？五受陰#44.8假名是菩薩不？」#44.9
「如是！世尊！」
「於汝意云何？五受陰假名有生滅、垢淨不？」
「不也！世尊！」
「於汝意云何？若法但有名字#44.10，非身非身業，非口非口業，非意非意業；不生不滅，不垢不淨──如是法能學#44.11般若波羅蜜，得薩婆若不？」
~1254「不也！世尊！」
「菩薩摩訶薩若能如是學般若波羅蜜，當得薩婆若，以無所得故。」#44.12
%37.348 3、當如幻人學般若
須菩提白佛言：「世尊！菩薩摩訶薩應如是學般若波羅蜜，得阿耨多羅三藐三菩提，如幻人學。何以故？世尊！當知五陰即是幻人，幻人即是五陰。」
佛告須菩提：「於汝意云何？是五陰學般若波羅蜜，當得薩婆若不？」
「不也！世尊！何以故？是五陰性無所有，無所有性亦不可得。」#44.13
%37.349 （二）略舉夢等五喻
佛告須菩提：「於汝意云何？如夢五陰學般若波羅蜜，當得薩婆若不？」
「不也！世尊！何以故？夢性無所有，無所有性亦不可得。」
「於汝意云何？如響、如影、如焰、如化五眾學般若波羅蜜，當得薩婆若不？」
「不也！世尊！何以故？響、影、焰、化性無所有，無所有性亦不可得。
六情亦如是。世尊！識即是六情，六情即是五眾。#44.14@t25p376b
%37.350 （三）明諸法以十八空故不可得
是#44.15法皆內空故不可得，乃至無法有法空故不可得。」
^44.2
%37.375 二、略說新發大乘意菩薩無方便、不得善知識，聞般若或生驚怖
須菩提白佛言#44.36：「世尊！新發大乘意菩薩聞說般若波羅蜜，將無#44.37驚、怖、畏？」#44.38
~1258佛告須菩提：「若新發大乘意菩薩於般若波羅蜜無方便，亦不得善知識，是菩薩或驚、或怖、或畏。」
%37.376 三、廣明有方便、善知識守護故，聞般若不生驚怖
%37.377 （一）明有方便
須菩提白佛言：「世尊！何等是方便？菩薩行是方便，不驚、不畏、不怖？」
%37.378 1、應薩婆若心，觀一切不可得@yD005p246#44.39
佛告須菩提：「有菩薩摩訶薩行般若波羅蜜，應薩婆若心，觀色無常相，是亦不可得，觀受、想、行、識無常相，是亦不可得。須菩提！是名菩薩摩訶薩行般若波羅蜜中方便。
復次，須菩提！菩薩摩訶薩應薩婆若心，觀色苦相，是亦不可得，受、想、行、識亦如是；應薩婆若心，觀色無我相，是亦不可得，受、想、行、識亦如是。
復次，須菩提！菩薩摩訶薩應薩@t25p377b婆若心，觀色空相，是亦不可得，受、想、行、識亦如是；觀色無相相，是亦不可得，受、想、行、識亦如是；觀色無作相，是亦不可得，受、想、行、識亦如是。觀色寂滅相，是亦不可得，乃至識亦如是；觀色離相，是亦不可得，乃至識亦如是──是名菩薩摩訶薩行般若波羅蜜中方便。
%37.379 2、慈悲為眾生修六度#44.40
%37.380 （1）布施：教眾生
復次，須菩提！菩薩摩訶薩行般若波羅蜜，觀色無常相，是亦不可得；觀色苦相、無我相、空相、無相相、無作相、寂滅相、離相，是亦不可得。受、想、行、識亦如是。
是時菩薩作是念：『我當為一切眾生說是無常法，是亦不可得；當為一切眾生說苦相、無我相、空相、無相相、無作相、寂滅相、離相，是亦不可得。』是名菩薩摩訶薩檀波羅蜜。
%37.381 （2）持戒：不起二乘心
復次，須菩提！菩薩摩訶薩不以聲聞、辟支佛心，觀色無常亦不可得；不以聲聞、辟支佛心，觀識無常亦不可得；不以聲聞、辟支佛心，觀色苦、無我、空、無相、無作、寂滅、離，亦不可得；受、想、行、識亦如是──是名菩薩摩訶薩尸羅波羅蜜。
~1259
%37.382 （3）忍：忍欲樂
復次，須菩提！菩薩摩訶薩行般若波羅蜜，是諸法無常相，乃至離想#44.41，忍欲樂#44.42──是名菩薩摩訶薩羼提波羅蜜。
%37.383 （4）精進：心不捨息
復次，須菩提！菩薩摩訶薩行般若波羅蜜，應薩婆若心，觀色無常相亦不可得，乃至離相亦不可得；受、想、行、識亦如是。應薩婆若心，不捨不息──是名菩薩摩訶薩毘梨耶波羅蜜。
%37.384 （5）禪：不起二乘心及餘不善心
復次，須菩提！菩薩摩訶薩行般若波羅蜜，不起聲聞辟支佛意#44.43及餘不善心──是名菩薩摩訶薩禪波羅蜜。
%37.385 （6）般若：知法本空
復次，須菩提！菩薩摩訶薩行般若波羅蜜，如是思惟：『不以空色故色空#44.44，色即是空，空即是色；@t25p377c受、想、行、識亦如是。不以空眼故眼空，眼即是空，空即是眼；乃至意觸因緣生受，不以空受故受空，受即是空，空即是受。不以空四念處故四念處空，四念處即是空，空即是四念處；乃至不以空十八不共法故十八不共法空，十八不共法即是空，空即是十八不共法。』
%37.386 3、小結
如是，須菩提！菩薩摩訶薩行般若波羅蜜，不驚、不畏、不怖。」
%37.387 （二）善知識守護#44.45
須菩提白佛言：「世尊！何等是菩薩摩訶薩善知識守護故，聞說是般若波羅蜜，不驚、不畏、不怖？」
佛告須菩提#44.46：「菩薩摩訶薩善知識者，說色無常亦不可得，持是善根，不向聲聞、辟支佛道，但向一切智，是名菩薩摩訶薩善知識；說受、想、行、識無常亦不可得，持是善根，不向聲聞、辟支佛道，但向一切智，是名菩薩摩訶薩善知識。
須菩提！菩薩摩訶薩復有善知識，說色苦亦不可得，說受、想、行、識苦亦不可得；說色無我亦不可得，受、想、行、識無我亦不可得；說色空、無相、無作、寂滅、~1260離亦不可得，受想行識空、無相、無作，寂滅、離亦不可得。持是善根，不向聲聞、辟支佛道，但向一切智。須菩提！是名菩薩摩訶薩善知識。
須菩提！菩薩摩訶薩復有善知識，說眼無常乃至離亦不可得；乃至意觸因緣生受，說無常乃至離亦不可得。持是善根，不向聲聞、辟支佛道，但向一切智，是名菩薩摩訶薩善知識。
須菩提！菩薩摩訶薩復有善知識，說修四念處法乃至離亦不可得；持是善根，不向聲聞、辟支佛道，但向一切智。須菩提！是名菩薩摩訶薩善知識。乃至說修十八不共法，修一切智亦@t25p378a不可得；持是善根，不向聲聞、辟支佛道，但向一切智，是名菩薩摩訶薩善知識。」
^44.3
%37.402 四、廣明菩薩無方便、隨惡知識，聞般若而生驚怖
須菩提白佛言：「世尊！云何菩薩摩訶薩行般若波羅蜜無方便、隨惡知識，聞說是般若波羅蜜，驚、怖、畏？」
%37.403 （一）無方便：離一切智心，觀法有所得@yF027p359
佛告須菩提：「菩薩摩訶薩離一切智心，修般若波羅蜜，得是般若波羅蜜，念是般若波羅蜜；禪波羅蜜、毘梨耶波羅蜜、羼提波羅蜜、尸羅波羅蜜、檀波羅蜜，皆得、皆念。#44.52
復次，須菩提！菩薩摩訶薩離薩婆若心，觀色內空乃至無法有法空，觀受、想、行、識內空乃至無法有法空；觀眼內空乃至無法有法空，乃至觀意觸因緣生受內空乃至無法有法空──於諸法空有所念、有所得。
復次，須菩提！菩薩摩訶薩行般若波羅蜜，離薩婆若心，修四念處，亦念、亦得；~1262乃至修十八不共法，亦念、亦得。
如是，須菩提！菩薩摩訶薩行般若波羅蜜，以無方便故，聞是般若波羅蜜，驚、怖、畏。」
%37.404 （二）惡知識：教離六度，不為說魔罪魔事@yF042p377
%37.405 1、教離六度@yF042p377
須菩提白佛言：「世尊！云何菩薩摩訶薩隨惡知識，聞般若波羅蜜驚、怖、畏。」
佛告須菩提：「菩薩摩訶薩惡知識教離般若波羅蜜，離禪波羅蜜、毘梨耶波羅蜜、羼提波羅蜜、尸羅波羅蜜、檀波羅蜜。須菩提！是名菩薩摩訶薩惡知識。
%37.406 2、不為說魔罪魔事@yF042p377
%37.407 （1）魔化作佛像教@yF042p377
%37.408 A、用修六度為@yF042p377
須菩提！菩薩摩訶薩復有惡知識，不說魔事、不說魔罪，不作是言：『惡魔作佛形像來教菩薩離六波羅蜜，語菩薩言：「善男子！用修般若波羅蜜為？用修禪波羅蜜、毘梨耶波羅蜜、羼提波羅蜜、尸羅波羅蜜、檀波羅蜜為？」』當知是菩薩摩訶薩惡知識。
%37.409 B、為說小乘十二部經@yF042p377
復次，須菩提！惡魔復作佛形像到菩薩所，為說聲聞經──@t25p378c若修妬路乃至優波提舍──教詔#44.53分別演說如是經；終不為說魔事、魔罪，當知是菩薩摩訶薩惡知識。
%37.410 C、汝非真菩薩心，不能成佛@yF042p377
復次，須菩提！惡魔作佛形像到菩薩所，作是語：『善男子！汝無真菩薩心，亦非阿毘跋致地，汝亦不能得阿耨多羅三藐三菩提。』不為說如是魔事、魔罪，當知是菩薩惡知識。#44.54
%37.411 D、一切皆空，何用成佛@yF042p377
復次，須菩提！惡魔作佛形像到菩薩所，語菩薩言：『善男子！色空，無我、無我所；受、想、行、識空，無我、無我所；眼空，無我、無我所；乃至意觸因緣生受空，無我、無我所；檀波羅蜜空，乃至般若波羅蜜空；四念處空，乃至十八不共法空；汝用阿耨多羅三藐三菩提為？』如是魔事、魔罪，不說、不教，當知是菩薩惡知識。
%37.412 （2）魔化作辟支佛像──十方皆空，無佛菩薩及聲聞（《大智度論筆記》［F042］p.377）
復次，須菩提！惡魔作辟支佛身到菩薩所，語菩薩言：『善男子！十方皆空，是中無佛、無菩薩、無聲聞。』如是魔事、魔罪，不說、不教，當知是菩薩摩訶薩惡知識。
~1263
%37.413 （3）魔化作和尚、阿闍梨身──教離菩薩道，入三解脫取聲聞證（《大智度論筆記》［F042］p.377）
復次，須菩提！惡魔作和尚、阿闍梨身到菩薩所，教離菩薩道，教離一切種智；教離四念處乃至八聖道分；教離檀波羅蜜，乃至教離十八不共法；教入空、無相、無作；作是言：『善男子！汝修念是諸法，得聲聞證，用阿耨多羅三藐三菩提為？』如是魔事、魔罪，不說、不教，當知是菩薩惡知識。
%37.414 （4）魔化作父母形──令為小果勤精進，勿為大覺@yF042p377
復次，須菩提！惡魔作父母形像到菩薩所，語菩薩言：『子！汝為須陀洹果證故勤精進，乃至阿羅漢果證故勤精進，汝用阿耨多羅三藐三菩提為？求阿耨多羅三藐三菩提，當受無量阿僧祇劫生死，截手截腳，受諸苦痛！』如是魔事、魔罪，不說、不教，當知是菩薩惡知識。
%37.415 （5）魔化作比丘形──一切法可得@yF042p377
復次，須菩@t25p379a提！惡魔作比丘形像到菩薩所，語菩薩言：『眼無常可得法，乃至意無常可得法；#44.55眼苦，眼無我，眼空、無相、無作、寂滅、離，說可得法，乃至意亦如是。用有所得法，說四念處；乃至用有所得法，說佛十八不共法。』須菩提！如是魔事、魔罪，不教、不說，當知是菩薩惡知識。
%37.416 3、勸應遠離惡知識
知已，當遠離之！」
^44.4
%37.433 貳、就「菩薩、摩訶薩」說般若#44.62
%37.434 （壹）就「菩薩」說般若
%37.435 一、闡述菩薩句義#44.63
%37.436 （一）述意：無句義是菩薩句義
爾時，須菩提白佛言：「世尊！云何為菩薩句義？」
佛告須菩提#44.64：「無句義是菩薩句義。何以故？阿耨多羅三藐三菩提中無有義處，亦無我；以是故，無句義是菩薩句義。#44.65
~1266
%37.437 （二）舉喻
%37.438 1、鳥飛虛空等七喻
須菩提！譬如鳥飛虛空無有足跡，菩薩句義無所有亦如是。
須菩提！譬如夢中所見無處所，菩薩句義無所有亦如是。
須菩提！譬如幻無有實義，如焰、如響、如影、如佛所化無有實義，菩薩句義無所有亦如是。#44.66
%37.439 2、如、法性、法相、法位、實際
須菩提！譬如如、法性、法相、法位、實際無有義，菩薩句義無所有亦如是。
%37.440 3、幻人無五蘊乃至無十八不共法
須菩提！譬如幻人色無有義，幻人受、想、行、識無有義；菩薩摩訶薩行般若波羅蜜時，菩薩句義無所有亦如是。
須菩提！如幻人眼無有義乃至意無有義。須菩提！如幻人色無有義乃至法無有義，眼觸乃至意觸因緣生受無有義；菩薩摩訶薩行般若波羅蜜時，菩薩句義@t25p379c無所有亦如是。
須菩提！如幻人行內空時無有義，乃至行無法有法空無有義；菩薩摩訶薩行般若波羅蜜時，菩薩句義無所有亦如是。
須菩提！如幻人行四念處乃至十八不共法無有義；菩薩摩訶薩行般若波羅蜜時，菩薩句義無所有亦如是。
%37.441 4、佛無五蘊乃至無十八不共法
須菩提！如多陀阿伽度、阿羅訶、三藐三佛陀色無有義，是色無有故；菩薩摩訶薩行般若波羅蜜時，菩薩句義無所有亦如是。
須菩提！如多陀阿伽度、阿羅訶、三藐三佛陀受、想、行、識無有義，是識無有故；菩薩摩訶薩行般若波羅蜜時，菩薩句義無所有亦如是。
須菩提！如佛眼無處所乃至意無處所，色乃至法無處所，眼觸乃至意觸因緣生受無處所；菩薩摩訶薩行般若波羅蜜時，菩薩句義無所有亦如是。
須菩提！如佛內空無處所，乃至無法有法空無處所；菩薩摩訶薩行般若波羅蜜時，菩薩句義無所有亦如是。
須菩提！如佛四念處無處所，乃至十八不共法無處所；菩薩摩訶薩行般若波羅蜜時，菩薩句義無所有亦如是。
%37.442 5、有為性、無為性中互無
須菩提！如有為性中無無為性義，無為性中無有為性義；菩薩摩訶薩行般若波羅蜜時，菩薩句義無所有亦如是。#44.67
~1267
%37.443 6、不生不滅、不作、不出、不得、不垢不淨無處所
須菩提！如不生不滅義無處所；菩薩摩訶薩行般若波羅蜜時，菩薩句義無所有亦如是。
須菩提！如不作、不出、不得、不垢、不淨無處所，菩薩句義無所有亦如是。」
須菩提白佛言：「何法不生、不滅故無處所？何法不作、不出、不得、不垢、不淨故無處所？」
佛告須菩提：「色不生不滅故無處所，受、想、行、識@t25p380a不生不滅故無處所，乃至不垢不淨亦如是；入、界不生不滅故無處所，乃至不垢不淨亦如是；四念處不生不滅故無處所，乃至不垢不淨亦如是；乃至十八不共法不生不滅故無處所，乃至不垢不淨亦如是。
須菩提！菩薩摩訶薩行般若波羅蜜時，菩薩句義無所有亦如是。
%37.444 7、三十七道品乃至佛德淨義不可得
須菩提！如四念處淨義畢竟不可得；須菩提！菩薩摩訶薩行般若波羅蜜時，菩薩句義無所有亦如是。
須菩提！如四正懃，乃至十八不共法淨義畢竟不可得；菩薩摩訶薩行般若波羅蜜時，菩薩句義無所有亦如是。#44.68
%37.445 8、我乃至知者、見者無所有故，於淨中不可得
須菩提！如淨中我不可得，我無所有故；乃至淨中知者、見者不可得，知、見無所有故。須菩提！菩薩摩訶薩行般若波羅蜜時，菩薩句義無所有亦如是。
%37.446 9、日出時無有黑闇
須菩提！譬如日出時無有黑闇；菩薩摩訶薩行般若波羅蜜時，菩薩句義無所有亦如是。
%37.447 10、劫燒時無一切物
須菩提！譬如劫燒時無一切物；菩薩摩訶薩行般若波羅蜜時，菩薩句義無所有亦如是。
%37.448 11、依「佛五分法身」為喻
須菩提！佛戒中無破戒。須菩提！菩薩摩訶薩行般若波羅蜜時，菩薩句義無所有亦如是。
須菩提！如佛定中無亂心，佛慧中無有愚癡，佛解脫中無不解脫，解脫知見中無不解脫知見。須菩提！菩薩摩訶薩行般若波羅蜜時，菩薩句義無所有亦如是。
%37.449 12、依「佛光中餘光不現」為喻
須菩提！譬如佛光中日月光不現，佛光中四天王天、三十三天、夜磨天、兜率陀天、化樂天、他化自在天、梵眾天乃至阿迦尼吒天光不現。須菩提！菩薩摩訶薩行般若~1268波羅蜜時，菩薩句義無所有亦如是。
%37.450 （三）結：無相，勸學
何以故？是阿耨多羅三@t25p380b藐三菩提、菩薩、菩薩句義#44.69，是一切法皆不合、不散#44.70，無色、無形、無對，一相#44.71，所謂無相。
如是，須菩提！菩薩摩訶薩一切法無礙相中應當學，亦應當知！」#44.72
^44.5
%37.479 二、廣學一切法，入不二門，無礙不動，是名菩薩義
%37.480 （一）總說一切法應學應知
須菩提白佛言：「世尊！何等是一切法？#44.89云何一切法中無礙相應學、應知？」
佛告須菩提：「一切法者，善法、不善法，記法、無記法，世間法、出世間法，有漏法、無漏法，有為法、無為法，#44.90共法、不共法。須菩提！是名為一切法。#44.91菩薩摩訶薩，是一切法無礙相中應學、應知！#44.92」
%37.481 （二）別辨
%37.482 1、善、不善法@yJ044p531
%37.483 （1）世間善法
須菩提白佛言：「世尊！何等名世間善法？」
~1272佛告須菩提：「世間善法者，孝順父母，供養沙門、婆羅門，敬事尊長；布施福處，持戒福處，修定福處，勸導福事；方便生福德；世間十善道；九相──脹相、血相、壞相、膿爛相、青相、噉相、散相、骨相、燒相；#44.93四禪，四無量心，四無色定；念佛、念法、念僧、念戒、念捨、念天、念善、念安般、念身、念死。#44.94是名世間善法。」#44.95
%37.484 （2）世間不善法
「何等不善法？」
「奪他命，不與取，邪婬，妄語，兩舌，惡口，非時語，貪欲，惱害，邪見──是十不善道等，#44.96是名不善法。」
%37.485 2、記、無記法@yJ044p532
%37.486 （1）記法
「何等記法？」
「若善法、若不善法，是名記法。」
%37.487 （2）無記法
「何等無記法？」
「無記身業、口業、意業，無記四大，無記五眾、十二入、十八界，無記報──是名無記法。」
%37.488 3、世間、出世間法@yJ044p532
%37.489 （1）世間法
「何等名世間法？」
「世間法者，五眾、十二入、十八界、十善道，四禪、四無量心、四無色定──是名世間法。」
%37.490 （2）出世間法
「何等名出世@t25p381b間法？」
%37.491 A、三十七道品
「四念處、四正懃、四如意足、五根、五力、七覺分、八聖道分。
~1273
%37.492 B、三解脫門
空解脫門、無相解脫門、無作解脫門。
%37.493 C、三無漏根
三無漏根：未知欲知根、知根、知已根。
%37.494 D、三三昧
三三昧：有覺有觀三昧、無覺有觀三昧、無覺無觀三昧。
%37.495 E、明、解脫、念、慧、正憶念@yE010p303
明、解脫、念、慧、正憶。#44.97
%37.496 F、八背捨@yJ010p499
八背捨。何等八？色觀色，是初背捨；內無色相外觀色，是二背捨；淨背捨，身作證，是三背捨；過一切色相故，滅有對相故，一切異相不念故，入無邊虛空處，是四背捨；過一切無邊虛空處，入一切無邊識處，是五背捨；過一切無邊識處，入無所有處，是六背捨；過一切無所有處，入非有想非無想處，是七背捨；過一切非有想非無想處，入滅受想定──是八背捨。#44.98
%37.497 G、九次第定@yJ010p499
九次第定#44.99。何等九？離欲離惡不善法，有覺有觀，離生喜樂入初禪；滅諸覺觀內清淨故一心，無覺無觀，定生喜樂入第二禪；離喜故，行捨，受身樂，聖人能說、能捨，念、行樂，入第三禪；斷苦#44.100樂故，先滅憂喜故，不苦不樂、捨，念淨，入第四禪；過一切色相故，滅有對相故，一切異相不念故，入無邊虛空處；過一切無邊虛空處，入一切無邊識處；過一切無邊識處，入無所有處；過一切無所有處，入非有想非無想處；過一切非有想非無想處，入滅受想定。
%37.498 H、十八空乃至佛德等
復有出世間法：內空乃至無法有法空，佛十力、四無所畏、四無礙智、十八不共法，一切智。
是名出世間法。」
%37.499 4、有漏法、無漏法@yJ044p532
%37.500 （1）有漏法
「何等為有漏法？」
~1274「五受眾、十二入、十八界，六種、六觸、六受，四禪乃至四無色定，是名有漏法。」
%37.501 （2）無漏法
「何等為無漏法？」
「四念處乃至十八不共法，及一切種智，是名無漏法。」
%37.502 5、有為法、無為法@yJ044p532
%37.503 （1）有為法
「何等為有為@t25p381c法？」
「若法生、住、滅，欲界、色界、無色界五眾乃至意觸因緣生受，四念處乃至十八不共法及一切智，是名有為法。」
%37.504 （2）無為法
「何等為無為法？」
「不生、不住、不滅，若染盡、瞋盡、癡盡，如、不異、法相、法性、法住、實際，是名無為法。」
%37.505 6、共法、不共法@yJ044p532
%37.506 （1）共法
「何等為共法？」
「四禪、四無量心、四無色定，如是等是名共法。」#44.101
%37.507 （2）不共法
「何等為不共法？」
「四念處乃至十八不共法，是名不共法。」
%37.508 （三）結成：知一切法不二相，不動故，是名菩薩義
「菩薩摩訶薩於是自相空法中不應著#44.102，不動故；菩薩亦應知一切法不二相，不動故──是名菩薩義。」#44.103
^45.1
$$壹、就三解脫門說般若（承上卷42～卷44）
$$貳、就「菩薩、摩訶薩」說般若（承上卷44）
$$（壹）就「菩薩」說般若（承上卷44）
%37.554 （貳）明「摩訶薩」義
%37.555 一、佛以「畢定眾中之上首」為摩訶薩
%37.556 （一）菩薩為畢定眾之上首
爾時，須菩提白佛言：「世尊！何以故名為摩訶薩？」
佛告須菩提：「是菩薩於畢#45.2定眾中為上首，是故名為摩訶薩。」#45.3
須菩提白佛言：「世尊！何等為畢定眾，是菩薩摩訶薩而為上首？」
佛告須菩提：「畢定眾者，性地人、八人、須陀洹、斯陀含、阿那含、阿羅漢、辟支佛、初發心菩薩，乃至阿鞞跋致地菩薩。須菩提！是為畢定眾，菩薩為上首。
%37.557 （二）菩薩以八心為畢定眾之上首
%37.558 1、金剛心
%37.559 （1）發大心，心堅如金剛不可壞
菩薩摩訶薩於是中生大心不可壞如金剛，當為畢定眾作上首。」
須菩提白佛言：「世尊！何等是菩薩摩訶薩生大心不可壞如金剛？」
%37.560 （2）舉十心明菩薩自行化他
佛告須菩提：「菩薩摩訶薩應生如是心：
%37.561 A、五心化他
我當於無量生死中大誓#45.4莊嚴；我應當捨一切所有；我應當等心於一切眾生；我應當以三乘度脫一切眾生，令入無餘涅槃；我度一切眾生已，無有乃至一人入涅槃者。
%37.562 B、五心自行
我應當解一切諸法不生相；我應當純以薩婆若心行六波羅蜜；我應當學智慧，@t25p382c~1281了達一切法；我應當了達諸法一相智門；我應當了達乃至無量相智門。
%37.563 C、結
須菩提！是名菩薩摩訶薩生大心不可壞如金剛。
是菩薩摩訶薩住是心中，於諸畢定眾中而為上首，是法用無所得故。
%37.564 （3）代一切眾生受苦，眾生度盡，方證菩提
須菩提！菩薩摩訶薩應生如是心：我當代十方一切眾生──若地獄眾生、若畜生眾生、若餓鬼眾生，受諸苦痛；為一一#45.5眾生無量百千億劫代受地獄中苦，乃至是眾生入無餘涅槃。以是法故，為是眾生受諸勤苦；是眾生入無餘涅槃已，然後自種善根，無量百千萬億阿僧祇劫，當得阿耨多羅三藐三菩提。
須菩提！是為菩薩摩訶薩大心不可壞如金剛。住是心中，為畢定眾作上首。
%37.565 2、大快心
復次，須菩提！菩薩摩訶薩生大快心，住是大快心中，為畢定眾作上首。」#45.6
須菩提白佛言：「世尊！何等是菩薩摩訶薩大快心？」
佛言：「菩薩摩訶薩從初發意乃至阿耨多羅三藐三菩提，不生染心、瞋恚心、愚癡心，不生惱心，不生聲聞、辟支佛心，是名菩薩摩訶薩大快心。住是心中，為畢定眾作上首，亦不念有是心。
%37.566 3、不動心
復次，須菩提！菩薩摩訶薩應生不動心！」
須菩提白佛言：「云何名不動心？」
佛言：「常念一切種智心，亦不念有是心，是名菩薩摩訶薩不動心。
%37.567 4、利益安樂心
復次，須菩提！菩薩摩訶薩於一切眾生中，應生利益安樂心。
云何名利益安樂心？
救濟@t25p383a一切眾生，不捨一切眾生，是事亦不念有是心，是名菩薩摩訶薩於一切眾生中生利益安樂心。如是，須菩提！是菩薩摩訶薩行般若波羅蜜，於畢定眾中最為上首！
%37.568 5、欲法、喜法、樂法心
復次，須菩提！菩薩摩訶薩應當行欲法、喜法、樂法心。
何等是法？所謂不破諸法實相，是名為法。
何等名欲法、喜法？信法、忍法、受法，是名欲法、喜法。
何等名樂法？常修行是法，是名樂法。
如是，須菩提！菩薩摩訶薩行般若波羅蜜，於畢定眾中能為上首，是法用無所得故。#45.7
~1282
%37.569 6、住十八空心
復次，須菩提！菩薩摩訶薩行般若波羅蜜時，住內空乃至無法有法空，能為畢定眾作上首，是法用無所得故。
%37.570 7、住四念處乃至十八不共法心
復次，須菩提！菩薩摩訶薩行般若波羅蜜時，住四念處中乃至住十八不共法中，能為畢定眾作上首，是法用無所得故。
%37.571 8、住諸三昧心
復次，須菩提！菩薩摩訶薩行般若波羅蜜時，住如金剛三昧#45.8乃至離著虛空不染三昧#45.9中住，於畢定眾作上首，是法用無所得故。
%37.572 （三）結
如是，須菩提！菩薩摩訶薩住是諸法中，能為畢定眾作上首。以是因緣故，名為摩訶薩。」
^45.2
$$一、佛以「畢定眾中之上首」為摩訶薩（見卷45〈13摩訶薩品〉）
%37.607 二、舍利弗以「有方便斷諸見故而說法」為摩訶薩
%37.608 （一）舍利弗欲說摩訶薩義
爾時，慧命舍利弗白佛言：「世尊！我亦欲說所以為摩訶薩！」
佛告舍利弗：「便說！」
%37.609 （二）舍利弗陳所悟
%37.610 1、斷眾生見
舍利弗言：「我見、眾生見、壽見、命見、生見、養育見、眾數見、人見、作見、使作見、起見、使起見、受見、使受見、知者見、見者見，#45.26
%37.611 2、斷邪見
斷見、常見，有見、無見，
%37.612 3、斷法見
陰見、入見、界見，諦見、因緣見，四念處見乃至十八不共法見，佛道見，成就眾生見、淨佛世界見，佛見，轉法輪見。
為斷如是諸見故而為說法，是名摩訶薩。」
%37.613 （三）辨有無方便之得失
須菩提語舍利弗言：「何因緣故色見是妄見？何因緣故受、想、行、識乃至轉法輪見是名妄見？」
舍利弗語須菩提：「菩薩摩訶薩行般若波羅蜜時，無方便故，於色生見，用有所得故；於受、想、行、識乃至轉法輪生見，用有所得故。
是中菩薩摩訶薩行般若波羅蜜，以方便力斷諸見故而為說法，用無所得故。」#45.27
^45.3
~1289
%37.622 三、須菩提以「三心不念不著」為摩訶薩
%37.623 （一）於菩提心、無等等心、不共二乘心無所著
爾時，須菩提白佛言：「世尊！我亦欲說所@t25p385a以為摩訶薩！」
佛言：「便說！」
須菩提言：「世尊！是阿耨多羅三藐三菩提心、無等等心、不共聲聞辟支佛心。何以故？是一切智心無漏不繫故。是一切智心無漏不繫中亦不著，以是因緣故，名摩訶薩。」#45.32
舍利弗語須菩提：「何等為菩薩摩訶薩無等等心、不共聲聞辟支佛心？」
須菩提言：「菩薩摩訶薩從初發意已來，不見法有生有滅#45.33、有增有減、有垢有淨。舍利弗！若法無生無滅乃至無垢無淨，是中無聲聞心、無辟支佛心、無阿耨多羅三藐三菩提心、無佛心。舍利弗！是名菩薩摩訶薩無等等心、不共聲聞辟支佛心。」#45.34
%37.624 （二）非但一切智心無漏不繫不著，凡夫心等及五眾等法亦無漏不繫不著，性空故
%37.625 1、五眾乃至十八不共法等亦不著
舍利弗語須菩提：「如須菩提說：『一切智心無漏心不繫心中不著。』須菩提！色亦不著，受、想、行、識亦不著，四念處亦不著，乃至十八不共法亦不著，何以故但說是心不著？」
須菩提言：「如是！如是！舍利弗！色亦不著，乃至十八不共法亦不著。」#45.35
%37.626 2、凡夫心、二乘心、諸佛心及五眾乃至十八不共法亦無漏不繫，性空故
舍利弗語須菩提：「凡夫人心亦無漏不繫，性空故；諸聲聞、辟支佛心、諸佛心亦無漏不繫，性空故。」
須菩提言：「如是！舍利弗！」
舍利弗言：「須菩提！若色亦無漏不繫，性空故；受、想、行、識無漏不繫，性空故；乃至意觸#45.36因緣生受無漏不繫，性空故。」
須菩提言：「爾！」
~1290舍利弗言：「四念處亦無漏不繫，性空故；乃至十八不共法亦無漏不繫，性空故。」
須菩提言：「爾！如舍利弗所言：『凡夫人心亦無漏不繫，性空故；乃至十八不共法亦無漏不繫，性空故。』」
%37.627 3、諸法空，心無故，不著心；五眾等法無故，不著五眾等法
舍利弗語須菩提：「如須菩提所說：『空，無心故，不著是心。』須菩提！色無故，不著色；受、想、行、識，乃至意觸因緣生受@t25p385b無故，不著受；四念處無故，不著四念處；乃至十八不共法無故，不著十八不共法。」
須菩提言：「如是！舍利弗！色無故，色中不著；乃至十八不共法無故，十八不共法中不著。#45.37
%37.628 （三）結：三心不念不著，以無所得故，是名摩訶薩
如是，舍利弗！菩薩摩訶薩行般若波羅蜜時，以阿耨多羅三藐三菩提心、無等等心、不共聲聞辟支佛心；不念有是心，亦不著是心，以一切法無所得故，以是故名摩訶薩。」
^45.4
%37.636 四、富樓那以三事明「摩訶薩」
%37.637 （一）總標三事#45.43
爾時，富樓那彌多羅尼子白佛言：「世尊！我亦樂說所以為摩訶薩！」
佛言：「便說！」
富樓那彌多羅尼子言：「是菩薩大莊嚴，是菩薩發趣大乘，是菩薩乘於大乘；以是故，是菩薩名摩訶薩。」#45.44
%37.638 （二）廣辨三事
%37.639 1、依「大莊嚴」明「摩訶薩」
舍利弗語富樓那言：「云何名菩薩摩訶薩大莊嚴？」
%37.640 （1）唯菩薩得大莊嚴之名
%37.641 A、心無分別，普度一切眾生故名大莊嚴
富樓那語舍利弗：「菩薩摩訶薩不分別為爾所人故住檀波羅蜜，行檀波羅蜜；為一切眾生故住檀波羅蜜，行檀波羅蜜。#45.45不為爾所人故，住尸羅波羅蜜，行尸羅波羅蜜，羼提波羅蜜，毘梨耶波羅蜜，禪波羅蜜，般若波羅蜜；為一切眾生故，住般若波羅蜜，行般若波羅蜜。菩薩摩訶薩大莊嚴，不齊限眾生，我當度若干人，不度餘人；不言：『我令若干人至阿耨多羅三藐三菩提，餘人不至。』是菩薩摩訶薩普為一切眾生故大莊嚴。
%37.642 B、自具六度，亦令他行
復作是念：『我當自具足檀波羅蜜，亦令一切眾生行檀波羅蜜；自具足尸羅波羅蜜，羼提波羅蜜，毘梨耶波羅蜜，禪波羅蜜；自具足般若波羅蜜，亦令一切眾生行般若波羅蜜。』
%37.643 C、於一行中，具攝餘行
%37.644 （A）檀度攝六
復次，舍利弗！菩薩摩訶薩行檀波羅蜜時，所有布施應薩婆若心，共一切眾生，迴向阿耨多羅三藐三菩提。舍利弗！是名菩薩摩訶薩行檀波羅蜜時檀波羅蜜大莊嚴。
~1293復次，舍利弗！菩薩摩訶薩行檀波羅蜜時，應薩婆若心布施，不向聲聞、辟支佛地。舍利弗！是名菩薩摩訶薩行檀@t25p386a波羅蜜時尸羅波羅蜜大莊嚴。
復次，舍利弗！菩薩摩訶薩行檀波羅蜜時，應薩婆若心布施，是諸施法信忍欲。是名行檀波羅蜜時羼提波羅蜜大莊嚴。#45.46
復次，舍利弗！菩薩摩訶薩行檀波羅蜜時，應薩婆若心布施，勤修不息。是名行檀波羅蜜時毘梨耶波羅蜜大莊嚴。
復次，舍利弗！菩薩摩訶薩行檀波羅蜜時，應薩婆若心布施，攝心不起聲聞、辟支佛意。是名行檀波羅蜜時禪波羅蜜大莊嚴。
復次，舍利弗！菩薩摩訶薩行檀波羅蜜時，應薩婆若心布施，觀諸法如幻，不得施者、不得所施物、不得受者。是名行檀波羅蜜時般若波羅蜜大莊嚴。
如是，舍利弗！若菩薩摩訶薩應薩婆若心，不取不得諸波羅蜜相，當知是菩薩摩訶薩大莊嚴。
%37.645 （B）戒度攝五
復次，舍利弗！菩薩摩訶薩行尸羅波羅蜜時，應薩婆若心布施，共一切眾生，迴向阿耨多羅三藐三菩提。是名菩薩摩訶薩行尸羅波羅蜜時檀波羅蜜。
復次，舍利弗！菩薩摩訶薩行尸羅波羅蜜時，諸法信忍欲。是名菩薩摩訶薩行尸羅波羅蜜時羼提波羅蜜。
復次，舍利弗！菩薩摩訶薩行尸羅波羅蜜時，勤修不息。是名菩薩摩訶薩行尸羅波羅蜜時毘梨耶波羅蜜。
復次，舍利弗！菩薩摩訶薩行尸羅波羅蜜時，不受聲聞、辟支佛心。是名菩薩摩訶薩行尸羅波羅蜜時禪波羅蜜。
復次，舍利弗！菩薩摩訶薩行尸羅波羅蜜時，觀一切法如幻，亦不念有是戒，用無所得故。是名菩薩摩訶薩行尸羅波羅蜜時般若波羅蜜。
如是，舍利弗！菩薩摩訶薩行尸羅@t25p386b波羅蜜時，攝諸波羅蜜，以是故名大莊嚴。
%37.646 （C）忍度攝五
復次，舍利弗！菩薩摩訶薩行羼提波羅蜜時，應薩婆若心布施，共一切眾生，迴向阿耨多羅三藐三菩提。是為菩薩摩訶薩行羼提波羅蜜時檀波羅蜜。
復次，舍利弗！菩薩摩訶薩行羼提波羅蜜時，不受聲聞、辟支佛心，但受薩婆若心。是名菩薩摩訶薩行羼提波羅蜜時尸羅波羅蜜。
復次，舍利弗！菩薩摩訶薩行羼提波羅蜜時，應薩婆若心，身心精進，不休不息。是名菩薩摩訶薩行羼提波羅蜜時#45.47毘梨耶波羅蜜。
~1294復次，舍利弗！菩薩摩訶薩行羼提波羅蜜時，攝心一處，雖有苦事，心不散亂。是名菩薩摩訶薩行羼提波羅蜜時禪波羅蜜。
復次，舍利弗！菩薩摩訶薩行羼提波羅蜜時，應薩婆若心，觀諸法空，無作者，無受者；若有呵罵割截者，心如幻夢。是名菩薩摩訶薩行羼提波羅蜜時般若波羅蜜。#45.48
%37.647 （D）勤度攝五
復次，舍利弗！菩薩摩訶薩行毘梨耶波羅蜜時，應薩婆若心布施時，不令身心懈怠。是名菩薩摩訶薩行毘梨耶波羅蜜時檀波羅蜜。
復次，舍利弗！菩薩摩訶薩行毘梨耶波羅蜜時，應薩婆若心，始終具足清淨持戒。是名菩薩摩訶薩行毘梨耶波羅蜜時尸羅波羅蜜。
復次，舍利弗！菩薩摩訶薩行毘梨耶波羅蜜時，應薩婆若心，修行忍辱。是名菩薩摩訶薩行毘梨耶波羅蜜時羼提波羅蜜。
復次，舍利弗！菩薩摩訶薩行毘梨耶波羅蜜時，應薩婆若心，攝心離欲，入諸禪定。是名菩薩摩訶薩行毘梨耶波羅蜜時禪波羅蜜。
復次，舍利弗！菩薩摩訶薩@t25p386c行毘梨耶波羅蜜時，應薩婆若心，不取一切諸法相，於不取相亦不著。是名菩薩摩訶薩行毘梨耶波羅蜜時般若波羅蜜。
如是，舍利弗！菩薩摩訶薩行毘梨耶波羅蜜時，攝諸波羅蜜。
%37.648 （E）禪度攝五
復次，舍利弗！菩薩摩訶薩行禪波羅蜜時，應薩婆若心，定心布施，不令心亂。是名菩薩摩訶薩行禪那波羅蜜時檀波羅蜜。
復次，舍利弗！菩薩摩訶薩行禪波羅蜜時，應薩婆若心持戒，禪定力故，破戒諸法不令得入。是名菩薩摩訶薩行禪波羅蜜時尸羅波羅蜜。
復次，舍利弗！菩薩摩訶薩行禪波羅蜜時，應薩婆若心，慈悲定故，忍諸惱害。是名菩薩摩訶薩行禪波羅蜜時羼提波羅蜜。
復次，舍利弗！菩薩摩訶薩行禪波羅蜜時，應薩婆若心，於禪不味不著，常求增進，從一禪至一禪。是名菩薩摩訶薩行禪波羅蜜時毘梨耶波羅蜜。
復次，舍利弗！菩薩摩訶薩行禪波羅蜜時，應薩婆若心，於一切法無所依止，亦不隨禪生。是名菩薩摩訶薩行禪波羅蜜時般若波羅蜜。
如是，舍利弗！菩薩摩訶薩行禪波羅蜜時，攝諸波羅蜜。
%37.649 （F）慧度攝五
復次，舍利弗！菩薩摩訶薩行般若波羅蜜時，應薩婆若心，布施內外所有，無所愛惜，不見與者、受者及以財物。是名菩薩摩訶薩行般若波羅蜜時檀波羅蜜。
復次，舍利弗！菩薩摩訶薩行般若波羅蜜時，應薩婆若心，持戒、破戒二事不~1295見故。是名菩薩摩訶薩行般若波羅蜜時尸羅波羅蜜。
復次，舍利弗！菩薩摩訶薩行般若波羅蜜時，應薩婆若心，不見訶者、罵者，打者、殺者，亦不見@t25p387a用是空能忍辱。是名菩薩摩訶薩行般若波羅蜜時羼提波羅蜜。
復次，舍利弗！菩薩摩訶薩行般若波羅蜜時，應薩婆若心，觀諸法畢竟空，以大悲心故，行諸善法。是名菩薩摩訶薩行般若波羅蜜時毘梨耶波羅蜜。
復次，舍利弗！菩薩摩訶薩行般若波羅蜜時，應薩婆若心，入禪定，觀諸禪離相、空相、無相相、無作相。是名菩薩摩訶薩行般若波羅蜜時禪波羅蜜。
如是，舍利弗！菩薩摩訶薩行般若波羅蜜時，攝諸波羅蜜。
%37.650 （G）結
舍利弗！如是名為菩薩摩訶薩大莊嚴。
%37.651 （2）十方諸佛歡喜讚歎
是大莊嚴菩薩，十方諸佛歡喜，於大眾中稱名讚歎：『某世界某菩薩摩訶薩大莊嚴，成就眾生，淨佛世界！』」
^45.5
%37.678 2、依「發趣大乘」明「摩訶薩」
慧命舍利弗問富樓那彌多羅尼子：「云何菩薩摩訶薩發趣大乘？」
%37.679 （1）約「禪波羅蜜」說發趣大乘
%37.680 A、行禪起四無量心，以無所得為方便，共一切眾生迴向佛道
富樓那語舍利弗：「菩薩摩訶薩行六波羅蜜時，離諸欲，離諸惡不善法，有覺有觀，離生喜樂入初禪乃至入第四禪中，以慈廣大，無二、無量，無怨、無恨、無惱心行，遍滿一方、二三四方、四維、上下，遍一切世間。悲、喜、捨心，亦如是。
是菩薩入禪時、起時，諸禪、無量心及支，共一切眾生，迴向薩婆若。是名菩薩摩訶薩禪波羅蜜發趣大乘。#45.61
~1299
%37.681 B、行禪攝餘五度
是菩薩摩訶薩住禪、無量心，作是念：『我當得一切種智，為斷一切眾生煩惱故，當說法。』是名菩薩摩訶薩行禪波羅蜜時檀波羅蜜。#45.62
若菩薩摩訶薩應薩婆若心，修初禪，住初禪，二、三、四禪亦如是，不受餘心──所謂聲聞、辟支佛心。是名菩薩摩訶薩行禪波羅蜜時尸羅波羅蜜。
若菩薩摩訶薩應薩婆若心入諸禪，作是念：『我為斷一切眾生煩惱故當說法，是諸心欲樂忍。』是名菩薩摩訶薩行禪波羅蜜時羼提波羅蜜。
若菩薩摩訶薩應薩婆若心入諸禪，諸善根皆迴向薩婆若，勤修不息。是@t25p388b名菩薩摩訶薩行禪波羅蜜時毘梨耶波羅蜜。
若菩薩摩訶薩應薩婆若心，入四禪及支，觀無常相、苦相、無我相、空相、無相相、無作相，共一切眾生，迴向薩婆若。是名菩薩摩訶薩行禪波羅蜜時般若波羅蜜。
舍利弗！是名菩薩摩訶薩發趣大乘。#45.63
%37.682 C、行四無量心攝五度
復次，菩薩摩訶薩行慈心，作是念：『我當安樂一切眾生；入悲心，我當救濟一切眾生；入喜心，我當度一切眾生；入捨心，我當令一切眾生得諸漏盡。』是名菩薩摩訶薩行無量心時檀波羅蜜。
復次，菩薩摩訶薩，是諸禪無量心，不向聲聞辟支佛地，但迴向薩婆若。是名菩薩摩訶薩行無量心時尸羅波羅蜜。
復次，舍利弗！菩薩摩訶薩行四無量心，不貪聲聞、辟支佛地，但忍樂欲薩婆若。是名菩薩摩訶薩行無量心時羼提波羅蜜。
若菩薩摩訶薩應薩婆若心，行四無量心，但行清淨行。是名菩薩摩訶薩行無量心時毘梨耶波羅蜜。
復次，菩薩摩訶薩入禪、入無量心時，亦不隨禪、無量心生。是名菩薩摩訶薩行無量心時方便般若波羅蜜。
舍利弗！是名菩薩摩訶薩發趣大乘。
~1300
%37.683 （2）約「修三十七道品乃至十八不共法」說發趣大乘
復次，舍利弗！菩薩摩訶薩發趣大乘，一切種修四念處，乃至一切種修八聖道分；一切種修三解脫門，乃至十八不共法。是名菩薩摩訶薩發趣大乘。#45.64
%37.684 （3）約「十八空慧、離二邊慧」明發趣大乘
%37.685 A、十八空慧
復次，舍利弗！菩薩摩訶薩內空中智慧，用無所得故；乃至無法有法空中智慧，用無所得故。是名菩薩摩訶薩發趣大乘。
%37.686 B、離二邊慧
%37.687 （A）不亂不定慧
復次，舍利弗！菩薩摩訶薩一切法中不亂不定智慧，是名菩薩摩訶薩發趣大乘。
%37.688 （B）非正非倒慧
復次，舍利弗！菩@t25p388c薩摩訶薩發趣大乘，非常、非無常智慧，非樂、非苦，非實、非虛，非我、非無我智慧。是名菩薩摩訶薩發趣大乘，用無所得故。
%37.689 （C）非行非不行慧
%37.690 a、不行三世，亦非不知三世
復次，舍利弗！菩薩摩訶薩智，不行過去世、不行未來世、不行現在世，亦非不知三世。是名菩薩摩訶薩發趣大乘，用無所得故。
%37.691 b、不行三界，亦非不知三界
復次，菩薩摩訶薩發趣大乘智，不行欲界、不行色界、不行無色界，亦非不知欲界、色界、無色界，用無所得故。是名菩薩摩訶薩發趣大乘。
%37.692 c、不行世間出世間、有為無為、有漏無漏法，亦非不知
復次，菩薩摩訶薩發趣大乘智，不行世間法、不行出世間法，不行有為法、不行無為法，不行有漏法、不行無漏法；亦非不知世間法出世間法、有為無為、有漏無漏法，用無所得故。舍利弗！是名菩薩摩訶薩發趣大乘。」
^46.1
$$四、富樓那以三事明「摩訶薩」（承上卷45〈15 大莊嚴品〉）
$$（一）總標三事#46.1（承上卷45〈15 大莊嚴品〉）
$$（二）廣辨三事（承上卷45〈15 大莊嚴品〉）
$$1、依「大莊嚴」明「摩訶薩」（承上卷45〈15 大莊嚴品〉）
$$2、依「發趣大乘」明「摩訶薩」（承上卷45〈15 大莊嚴品〉）
%37.708 3、依「乘於大乘」明「摩訶薩」#46.2
爾時，慧命舍利弗問富樓那：「云何名菩薩摩訶薩乘於大乘？」
%37.709 （1）自利乘@yB012p128
%37.710 A、修行六度，三輪體空@yB012p128
富樓那答舍利弗言：「菩薩摩訶薩行般若波羅蜜時，乘檀波羅蜜，亦不得檀波羅蜜，亦不得菩薩，亦不得受者，用無所得故，是名菩薩摩訶薩乘檀波羅蜜。#46.3菩薩摩訶薩行般若波羅蜜時，乘尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜；乘般若波羅蜜，亦不得般若波羅蜜，亦不得菩薩，用無所得故，是為菩薩摩訶薩乘於般若波羅蜜。如是，舍利弗！是#46.4為菩薩摩訶薩乘於大乘。
%37.711 B、修諸妙行，修亦不得@yB012p128
復次，舍利弗！菩薩摩訶薩摩訶衍，一心應薩婆若，修四念處，法壞故；乃至一心應薩婆若，修十八不共法，法壞故──是亦不可得。#46.5
~1304如是，舍利弗！是名菩薩摩訶薩乘於大乘。
%37.712 C、若我若法達不可得@yB012p128
%37.713 （A）我不可得
復次，舍利弗！菩薩摩訶薩作是念：『菩薩但有名字，眾生不可得故。』是名菩薩摩訶薩乘於大乘。
%37.714 （B）法不可得
復次，舍利弗！若#46.6菩薩摩訶薩作是念：『色但有名字，色不可得故；受、想、行，識但有名字，識不可得故。
眼但有名字，眼不可得故；乃至意亦如是。
四念處但有名字，四念處不可得故；乃至八聖道分但有名字，八聖道分不可得故。
內空但有名字，內空不可得故；乃至無法有法空但有名字，無法有法空不可得故；乃至十八不共法但有名字，十八不共法不可@t25p389c得故。
諸法如但有名字，如不可得故；法相、法性、法#46.7住、實際但有名字，實際不可得故。
阿耨多羅三藐三菩提及佛但有名字，佛不可得故。』
如#46.8是，舍利弗！是名菩薩摩訶薩乘於大乘。
%37.715 （2）利他乘：具足神通，成就眾生@yB012p128
復次，舍利弗！若菩薩摩訶薩從初發意已來，具足菩薩神通，成就眾生，從一佛國至一佛國，恭敬、供養、尊重、讚歎諸佛，從諸佛聽受法教，所謂菩薩大乘。
是菩薩乘此大乘，從一佛國至一佛國，淨佛世界、成就眾生，初無佛國想、亦無眾生想。此人住不二法中，為眾生受身，隨其所應，自變其形而教化之；乃至一切智，終不離菩薩乘。
是菩薩得一切種智已，轉法輪，聲聞、辟支佛及天龍、鬼神、阿修羅、世間人民所不能轉。爾時，十方如恒河沙等諸佛皆歡喜稱名讚歎，作是言：『某方某國某菩薩摩訶薩乘於大乘，得一切種智，轉法輪！』
舍利弗！是名菩薩摩訶薩乘於大乘。」
^46.2
%37.722 五、取定「大莊嚴」義以明「摩訶薩」#46.17
%37.723 （一）佛示大莊嚴
爾時，須菩提白佛言：「世尊！菩薩摩訶薩大莊嚴#46.18，何等是大莊嚴？何等菩薩能大莊嚴？」#46.19
%37.724 1、何等是大莊嚴：明大莊嚴之所行法
佛語須菩提：「菩薩摩訶薩摩訶衍大莊嚴，所謂檀波羅蜜乃至般若波羅蜜莊嚴；四念處莊嚴，乃至八聖道分；內空莊嚴，乃至無@t25p390b法有法空；十力乃至十八不共法，及一切種智莊嚴。
%37.725 2、何等菩薩能大莊嚴：明大莊嚴之能行者
%37.726 （1）六波羅蜜是大莊嚴（攝諸功德）#46.20@yB012p128
%37.727 A、布施波羅蜜
變身如佛莊嚴，光明遍照三千大千世界，亦照東方如恒河沙等世界；南西北方、四維、上下，亦復如是。三千大千世界六種振#46.21動，亦動東方如恒河沙等諸世界；南西北方、四維、上下，亦復如是。
是菩薩摩訶薩住檀波羅蜜摩訶衍大莊嚴，是三千大千世界，變為琉璃；化作轉輪聖王，隨眾生所欲，須食與食，須飲與飲，衣服、臥具、花香、纓#46.22珞、搗#46.23香、~1307澤香#46.24、房舍、燈燭、醫藥種種所須盡給與之；與已，而為說法──所謂應六波羅蜜法#46.25。眾生聞是法者，終不離六#46.26波羅蜜，乃至阿耨多羅三藐三菩提。
如是，須菩提！是名菩薩摩訶薩摩訶衍大莊嚴。
須菩提！譬如工幻師、若幻師弟子，於四衢道中，化作大眾於前，須食與食，須飲與飲，乃至種種所須盡給與之。
於須菩提意云何？是幻師實有眾生有給#46.27與不？」
須菩提言：「不也！世尊！」
「須菩提！菩薩摩訶薩亦如是，化作轉輪聖王，種種具足，須食與食，須飲與飲，乃至種種所須盡給與之；雖有所施，實無所與。何以故？須菩提！諸法相如幻故。
%37.728 B、持戒波羅蜜
復次，須菩提！菩薩摩訶薩住尸羅波羅蜜，現生轉輪聖王家，以十善道教化眾生，又以四禪、四無量心、四無色定、四念處乃至十八不共法教化眾生；聞是法者，至阿耨多羅三藐三菩提，終不離是法。
譬如幻師、若幻師弟子，於四衢道中，化作大眾，以十善道教化令行，又以四禪、四無量心、四無色定、四念處乃至十八不共法，教化令行。
須菩提！於汝意云何？是幻師，實有眾生，教@t25p390c化令行十善道乃至十八不共法不？」
須菩提言：「不也！世尊！」
「須菩提！菩薩摩訶薩亦如是，以十善道教化眾生令行，乃至十八不共法；實無眾生行十善道乃至十八不共法。何以故？諸法相如幻故。
須菩提！是名菩薩摩訶薩大莊嚴。
%37.729 C、忍波羅蜜
復次，須菩提！菩薩摩訶薩住羼提波羅蜜，教化眾生忍辱。
須菩提！云何菩薩摩訶薩住羼提波羅蜜，教化眾生著忍辱波羅蜜中？
須菩提！菩薩摩訶薩從初發意已來，如是大莊嚴──若一切眾生來罵詈、刀杖傷害，菩薩摩訶薩於此中不起一念，亦教一切眾生行此忍辱。
譬如幻師、若幻師弟子，於四衢道中，化作大眾，令行忍辱；餘如上說。
須菩提！是名菩薩摩訶薩大莊嚴。
%37.730 D、精進波羅蜜
復次，須菩提！菩薩摩訶薩住毘梨耶波羅蜜，教化#46.28一切眾生令行毘梨耶波羅蜜。
~1308須菩提！云何菩薩摩訶薩住毘梨耶波羅蜜，教一切眾生令行毘梨耶波羅蜜？
須菩提！菩薩摩訶薩應薩婆若心，身心精進，教化眾生。
譬如幻師、若幻師#46.29弟子，於四衢道中，化作大眾，教令行身心精進；餘如上說。是名菩薩摩訶薩大莊嚴。
%37.731 E、禪波羅蜜
復次，須菩提！菩薩摩訶薩住禪波羅蜜，教一切眾生令行禪波羅蜜。
須菩提！云何菩薩摩訶薩住禪波羅蜜，教一切眾生令行禪波羅蜜？
須菩提！菩薩摩訶薩住諸法等中，不見法若亂若定。
如是，須菩提！菩薩摩訶薩住禪波羅蜜，教一切眾生令行禪波羅蜜，乃至阿耨多羅三藐三菩提，終不離禪波羅蜜。
譬如工幻師、若幻師弟子，於四衢道中，化作大眾，教令行禪波羅@t25p391a蜜；餘如上說。
須菩提！是名菩薩摩訶薩大莊嚴。
%37.732 F、般若波羅蜜
復次，須菩提！菩薩摩訶薩住般若波羅蜜，教一切眾生令行般若波羅蜜。
須菩提！云何菩薩摩訶薩住般若波羅蜜，教一切眾生令行般若波羅蜜？
須菩提！菩薩摩訶薩行般若波羅蜜時，無有法得此岸、彼岸。如是菩薩摩訶薩住般若波羅蜜中，教一切眾生令行般若波羅蜜。
譬如幻#46.30師、若幻師弟子，於四衢道中，化作大眾，教令行般若波羅蜜。#46.31
須菩提！是名菩薩摩訶薩大莊嚴。
%37.733 G、十方隨緣現身，自住六度亦教化眾生令行六度
復次，須菩提！菩薩摩訶薩大莊嚴，十方如恒河沙等世界中#46.32，隨其所應，自變其身，住檀波羅蜜乃至般若波羅蜜，亦教眾生令行檀波羅蜜乃至般若波羅蜜。是眾生行是法乃至阿耨多羅三藐三菩提，終不離是法。
須菩提！譬如幻師、若幻師弟子，於四衢道中，化作眾生，教令行六波羅蜜；餘如上說。
如是，須菩提！是名菩薩摩訶薩大莊嚴。
%37.734 （2）大誓莊嚴是大莊嚴@yB012p128
復次，須菩提！菩薩摩訶薩大莊嚴，應薩婆若心，不生是念：『我教若干人住檀波~1309羅蜜，不教若干人住檀波羅蜜。#46.33乃至般若波羅蜜亦如是。』
不生是念：『我教若干人住四念處，不教若干人住四念處。乃至十八不共法亦如是。』亦不生是念：『我教若干人令得須陀洹果、斯陀含果、阿那含果、阿羅漢果、辟支佛道、一切種智，亦不教若干人令得須陀洹#46.34果乃至一切種智。』
我當令無量無邊阿僧祇眾生住檀波羅蜜乃至般若波羅蜜，立眾生於四念處乃至十八不共法，令無量無邊阿僧祇眾生得須陀洹果乃至一切種智。
譬@t25p391b如工幻師、若幻師弟子，於四衢道中，化作大眾，教令住#46.35六波羅蜜乃至得一切種智。餘如上說。
須菩提！是名菩薩摩訶薩大莊嚴。」
^46.3
%37.749 （二）須菩提自陳大莊嚴義：諸法相空，無大莊嚴為大莊嚴
爾時，須菩提白佛言：「世尊！如我從佛所聞義，菩薩摩訶薩無大莊嚴為大莊嚴，諸法自相空故。#46.45所謂色、色相空，受、想、行，識、識相空；眼、眼相空，乃至意、意相空；色、色相空，乃至法、法相空。眼識、眼識相空，乃至意識、意識相空；眼觸、眼觸相空，乃至意觸、意觸相空；眼觸因緣生受、受相空，乃至意觸因緣生受、受相空。世尊！檀波羅蜜、檀波羅蜜相空，乃至般若波羅蜜、般若波羅蜜相空。內空、內空空#46.46相空，乃至無法有法空、無法有法空相空。四念處、四念處相空，乃至十八不共法、十八不共法相空。菩薩、菩薩相空。
世尊！以是因緣故，當知#46.47菩薩摩訶薩無大莊嚴為大莊嚴。」
%37.750 （三）佛舉人法二空述成
%37.751 1、正明人法二空答無作
佛告須菩提：「如是！如是！如汝所說#46.48。須菩提！薩婆若非作法，眾生亦非作法，菩薩為是眾生大莊嚴。」#46.49
須菩提白佛言：「世尊！何因緣故，薩婆@t25p392a若非作法，是眾生亦非作法，菩薩為是眾生大莊嚴？」
佛語須菩提：「作者不可得故，薩婆若非作非起法，是諸眾生亦非作非起法。何以故？須菩提！色非作非不作，受、想、行、識非作非不作；#46.50眼非作非不作，乃至意非作非不作；色乃至法，眼識乃至意識，眼觸乃至意觸，眼觸因緣生受乃至意觸因緣生受，非作非不作。
須菩提！我非作非不作，乃至知者、見者非作非不作。何以故？是諸法畢竟不可得故。
~1312
%37.752 2、舉夢幻等喻
須菩提！夢非作非不作，何以故？畢竟不可得故；幻、嚮#46.51、影、焰、化非作非不作，何以故？畢竟不可得故。
%37.753 3、舉十八空
須菩提！內空非作非不作，畢竟不可得故；乃至無法有法空非作非不作，畢竟不可得故。
%37.754 4、舉三十七道品乃至十八不共法
須菩提！四念處非作非不作，畢竟不可得故；乃至十八不共法非作非不作，何以故？是法皆畢竟不可得故。
%37.755 5、舉如、法性、實際等
須菩提！諸法如、法相、法性、法住、法位、實際，非作非不作，畢竟不可得故。
%37.756 6、舉佛、菩薩、一切智、一切種智
須菩提！菩薩#46.52非作非不作，畢竟不可得故；薩婆若及一切種智，非作非不作，畢竟不可得故。
%37.757 7、結
以是因緣故，須菩提！薩婆若非作非起法，是眾生亦非作非起法，菩薩為是眾生大莊嚴。
%37.758 （四）須菩提再陳「無縛無脫為大莊嚴」
%37.759 1、明諸法無縛無脫
%37.760 （1）五眾無縛無脫
%37.761 A、略說
爾時，須菩提白佛言：「如我觀佛所說義，世尊！色無縛無脫，受、想、行、識無縛無脫。」
~1313爾時，富樓那彌多羅尼子語須菩提：「色是無縛無脫？受、想、行、識是無縛無脫？」
須菩提言：「如是！如是！色是無縛無脫，受、想、行、識是無縛無脫。」
%37.762 B、廣釋
富樓那彌多羅尼子問須菩提：「何等色無縛無脫？何等受、想、行、識無縛無脫？」
%37.763 （A）約夢幻等喻
須菩提言：「@t25p392b如夢色無縛無脫，如夢受、想、行、識無縛無脫。如嚮、如影、如幻、如焰、如化色受想行識無縛無脫。
%37.764 （B）約三世
富樓那彌多羅尼子！過去色無縛無脫，過去受、想、行、識無縛無脫；未來色無縛無脫，未來受、想、行、識無縛無脫；現在色無縛無脫，現在受、想、行、識無縛無脫。
何以故無縛無脫？是色無所有故，無縛無脫；受、想、行、識無所有故，無縛無脫。離故、寂滅故、不生故，無縛無脫。
%37.765 （C）約三性
富樓那！善色、受、想、行、識無縛無脫；不善色、受、想、行、識無縛無脫；無記色無縛無脫，無記受、想、行、識無縛無脫。
%37.766 （D）約世間出世間，有漏、無漏等
世間、出世間、有漏、無漏色無縛無脫，受、想、行、識亦無縛無脫。何以故？無所有故、離故、寂滅故、不生故，無縛無脫。
%37.767 （2）一切法無縛無脫
富樓那！一切法亦無縛無脫，無所有故、離故、寂滅故、不生故。#46.53
%37.768 （3）六度無縛無脫
富樓那！檀波羅蜜無縛無脫，尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜無縛無脫；無所有故、離故、寂滅故、不生故，無縛無脫。
%37.769 （4）十八空無縛無脫
富樓那！內空亦無縛無脫，乃至無法有法空亦無縛無脫。
%37.770 （5）三十七道品乃至十八不共法無縛無脫
四念處無縛無脫，乃至十八不共法無縛無脫；無所有故、離故、寂滅故、不生故，無縛無脫。
%37.771 （6）佛、菩薩及一切智、一切種智無縛無脫
阿耨多羅三藐三菩提無縛無脫，一切智、一切種智無縛無脫。
菩薩無縛無脫，佛亦無縛無脫；無所有故、離故、寂滅故、不生故，無縛無脫。
~1314
%37.772 （7）如、法性、實際等無縛無脫
富樓那！諸法如、法相、法性、法住、法位、實際、無為法無縛無脫，無所有故、離故、寂滅故、不生故，無縛無脫。
%37.773 （8）結
富樓那！是名菩薩摩訶薩無縛無脫檀波羅蜜乃至般若波羅蜜，四念處乃至一切種智無縛無脫。
%37.774 2、明無縛無脫故得益
是菩薩摩訶薩住無縛無@t25p392c脫檀波羅蜜中，乃至住無縛無脫般若波羅蜜；住無縛無脫四念處，乃至住無縛無脫一切種智；無縛無脫成就眾生，無縛無脫淨佛世界；無縛無脫諸佛當供養，無縛無脫當聽法；無縛無脫諸佛終不離，無縛無脫諸神通終不離，無縛無脫五眼終不離；無縛無脫陀羅尼門終不離，無縛無脫諸三昧終不離；無縛無脫當生道種智，無縛無脫當得一切種智；無縛無脫法輪轉，無縛無脫眾生安立三乘。
如是，富樓那！菩薩摩訶薩行無縛無脫六波羅蜜，當知一切法無縛無脫，無所有故、離故、寂滅故、不生故。
富樓那！是名菩薩摩訶薩無縛無脫大莊嚴。」#46.54
^46.4
$$壹、就「三解脫門」說般若（承上卷42～卷44）
$$貳、就「菩薩、摩訶薩」說般若（承上卷44～卷46）
%37.785 參、就「摩訶衍義」說般若#46.66
%37.786 （壹）須菩提問摩訶衍等五義
爾時，須菩提白佛言：「世尊！（1）何等是菩薩摩訶薩摩訶衍？#46.67
（2）云何當知菩薩摩訶薩發趣大乘？#46.68
~1317（3）是乘發何處？是乘至何處？#46.69
（4）當#46.70住何處？#46.71
（5）誰當乘是乘出者#46.72？#46.73」#46.74
%37.787 （貳）佛答摩訶衍等五義
%37.788 一、答第一問：何等是「摩訶衍」#46.75
%37.789 （一）六度是摩訶衍
佛告須菩提：「汝問：『何等是菩薩摩訶薩摩訶衍？』須菩提！六波羅蜜是菩薩摩訶薩摩訶衍。何等六？檀波羅蜜，尸羅波羅蜜，羼提波羅蜜，毘梨耶波羅蜜，禪波羅蜜，般若波羅蜜。
%37.790 1、布施波羅蜜
云何名檀波羅蜜？
須菩提！菩薩摩訶薩以應薩婆若心，內、外所有布施，共一切眾生，迴向阿耨多羅三藐三菩提，用無所得故。須菩提！是名菩薩摩訶薩檀波羅蜜。#46.76
~1318
%37.791 2、持戒波羅蜜
云何名#46.77尸羅波羅蜜？
須菩提！菩薩摩訶薩以應薩婆若心，自行十善道，亦教他行十善道，用無所得故。是名菩薩摩訶薩不著尸羅波羅蜜。
%37.792 3、忍波羅蜜
云何名#46.78羼提波羅蜜？
須菩提！菩薩摩訶薩以應薩婆若心，自具足忍辱，亦教他行忍辱，用無所得故。是名菩薩摩訶薩羼提波羅蜜。
%37.793 4、精進波羅蜜
云何名毘梨耶波羅蜜？
須菩提！菩薩摩訶薩以應薩婆若心，行五波羅蜜，懃修不息，亦安立一切眾生於五波羅蜜，用無所得故。是名菩薩摩訶薩毘梨耶波羅蜜。
%37.794 5、禪波羅蜜
云何名禪波羅蜜？
須菩提！菩薩摩訶薩以應薩婆若心，自以方便入諸禪#46.79，不隨禪生，亦教他令入諸禪，用無所得故。是名菩薩摩訶薩禪波羅蜜。
%37.795 6、般若波羅蜜
云何名般若波羅蜜？
須菩提！菩薩摩訶薩以應薩婆若心，不著一切法，亦觀一切法性，用無所得故；亦教他不著一切法，亦#46.80觀一切法性，用無所得故。是名菩薩摩訶薩般若波羅蜜。
須菩提！@t25p393c是為菩薩摩訶薩摩訶衍。
%37.796 （二）十八空、四空是摩訶衍
%37.797 1、十八空
復次，須菩提！菩薩摩訶薩復有#46.81摩訶衍，所謂內空、外空、內外空、空空、大空、第一義空、有為空、無為空、畢竟空、無始空、散空、性空、自相空、諸法空、不可得空、無法空、有法空、無法有法空。」
（1）須菩提白佛言：「何等為內空？」
佛言：「內法名眼、耳、鼻、舌、身、意。眼、眼空，非常非滅故。何以故？性自爾。耳、耳空，鼻、鼻空，舌、舌空，身、身空，意、意空，非常非滅故。何以故？性自爾。是名內空。」
~1319（2）何等為外空？
外法#46.82名色、聲、香、味、觸、法。色、色空，非常非滅故。何以故？性自爾。聲、聲空，香、香空，味、味空，觸、觸空，法、法空，非常非滅故。何以故？性自爾。是名外空。
（3）何等為內外空？
內、外法名內六入、外六入。內法、內法空，非常非滅故。何以故？性自爾。外法、外法空，非常非滅故。何以故？性自爾。是名內外空。
（4）何等為空空？
一切法空，是空亦空，非常非滅故。何以故？性自爾。是名空空。
（5）何等為大空？
東方、東方#46.83空，非常非滅故。何以故？性自爾。南西北方、四維、上下，南西北方、四維、上下空，非常非滅故。何以故？性自爾。是名大空。
（6）何等為第一義空？
第一義#46.84名涅槃。涅槃、涅槃空，非常非滅故。何以故？性自爾。是名第一義空。
（7）何等為有為空？
有為法名欲界、色界、無色界。欲界、欲界空，色界、色界空，無色界、無色界空，非常非滅故。何以故？性自爾。是名有為空。
（8）何等為無為空？
無為法名為無生相、無住相、無滅相。無為法、無為法空，非常非滅故。何以故？性自爾。是名無為空。
（9）何等為畢竟空？
畢竟名諸法至竟不可得，非常非滅故。何以故？性@t25p394a自爾。是名畢竟空。
（10）何等為無始空？
若法初來處不可得，非常非滅故。何以故？性自爾。是名#46.85無始空。
（11）何等為散空？#46.86
散名諸法無滅，非常非滅故。何以故？性自爾。是名散空。
~1320（12）何等為性空？
一切法性──若有為法性，若無為法性，是性非聲聞、辟支佛所#46.87作，非佛所作，亦非餘人所作。是性、性空，非常非滅故。何以故？性自爾。是名性空。
（13）何等為自相空？
自相名#46.88色──壞相，受──受相，想──取相，行──作相，識──識相；如是等有為法#46.89、無為法各各#46.90自相空，非常非滅故。何以故？性自爾。是名自相空。
（14）何等為諸法空？
諸法名色、受、想、行、識，眼、耳、鼻、舌、身、意，色、聲、香、味、觸、法，眼界、色界、眼識界，乃至意界、法界、意識界。是諸法、諸法#46.91空，非常非滅故。何以故？性自爾。是為諸法空。
（15）何等為不可得空？
求#46.92諸法不可得。是不可得空，非常非滅故。何以故？性自爾。是名不可得空。
（16）何等為無法空？
若法無，是亦空，非常非滅故。何以故？性自爾。是名無法空。
（17）何等為有法空？
有法名諸法和合中有自性相。是有法空，非常非滅故。何以故？性自爾。是名有法空。
（18）何等為無法有法空？
諸法中無法，諸法和合中有自性相。是無法有法空，非常非滅故。何以故？性自爾。是名無法有法空。
%37.798 2、四空
復次，須菩提！法法相空，無法無法相空，自法自法相空，他法他法相空。
（1）何等名法法相空？
法名五眾，五眾空，是名法#46.93法相空。
（2）何等名無法無法相空？
無法名無為法，是名無法無法相空。
（3）何等名自法自法空#46.94？
諸法自法空，是空非智作、非見作，是名自法自法@t25p394b空。
~1321（4）何等名他法他法空？
若佛出、若佛未出，法住、法相、法位、法性、如、實際；過此諸法空，是名他法他法空。#46.95
是名菩薩摩訶薩摩訶衍。
^47.1
$$（一）六度是摩訶衍（承上卷46〈18 釋摩訶衍品〉）
$$（二）十八空、四空是摩訶衍（承上卷46〈18 釋摩訶衍品〉）
%37.856 （三）百八三昧是摩訶衍#47.2
%37.857 1、標列
復次，須菩提！菩薩摩訶薩摩訶衍，所謂名（1）首楞嚴三昧，（2）寶印三昧，（3）師子遊戲三昧，（4）妙月三昧，（5）月幢相三昧，（6）出諸法三昧，（7）觀頂三昧，（8）畢法性三昧，（9）畢幢相三昧，（10）金剛三昧，（11）入法@t25p396c印三昧，（12）三昧王安立三昧，（13）放光三昧，（14）力進三昧，（15）高出三昧，（16）必入辯才三昧，（17）釋名字三昧，（18）觀方三昧，（19）陀羅尼印三昧，（20）無誑三昧，（21）攝諸法海三昧，（22）遍覆虛空三昧，（23）金剛輪三昧，（24）斷寶#47.3三昧，（25）能照三昧，（26）不求三昧，（27）無住三昧，（28）無心三昧，（29）淨燈三昧，（30）無邊明三昧，（31）能作明三昧，（32）普照明三昧，（33）堅淨諸三昧三昧，（34）無垢明三昧，（35）歡喜三昧，（36）電光三昧，（37）無盡三昧，（38）威德三昧，（39）離盡三昧，（40）不動三昧，（41）不退三昧，（42）日燈三昧，（43）月淨三昧，（44）淨明三昧，（45）能作明三昧，（46）作行三昧，（47）知相三昧，（48）如金剛三昧，（49）心住三昧，（50）普明三昧，（51）安立三昧，（52）寶聚三昧，（53）妙法印三昧，（54）法等三昧，（55）斷喜三昧，（56）到法頂三昧，（57）能散三昧，（58）分別諸法句三昧，（59）字等相三昧，（60）離字三昧，（61）斷緣三昧，（62）不壞三昧，（63）無種相三昧，（64）無處行三昧，（65）離曚昧三昧，（66）無去三昧，（67）不變異三昧，（68）度緣三昧，（69）集諸功德三昧，（70）住無心三昧，（71）妙淨#47.4華三昧，（72）覺意三昧，（73）無量辯三昧，（74）無等等三昧，（75）度諸法三昧，（76）分別諸法三昧，（77）散疑三昧，（78）無住處三昧，（79）一莊嚴三昧，（80）生行三昧，（81）一行三昧，（82）不一行三昧，（83）妙行三昧，（84）達一切有底散三昧，（85）入名語三昧，（86）離音聲字語三昧，（87）然炬三昧，（88）淨相三昧，（89）破相三昧，（90）一切種妙足三昧，（91）不喜苦樂三昧，（92）無盡相三昧，（93）陀羅尼三昧#47.5，（94）攝諸邪正相三昧，（95）滅憎愛三昧，（96）逆順三昧，（97）淨光三昧，（98）堅固三昧，~1332（99）滿月淨光三昧，（100）大莊嚴三昧，（101）能照一切世三昧#47.6，（102）三昧等三昧，（103）攝一切有諍無諍三昧，（104）不樂一切住處三昧，（105）如住定三昧，（106）壞身衰三昧，（107）壞語如虛空三昧，（108）離著虛空不染三昧。
%37.858 2、釋義
（1）云何名首楞嚴@t25p397a三昧？知諸三昧行處，是名首楞嚴三昧。
（2）云何名寶印三昧？住是三昧，能印諸三昧，是名寶印三昧。
（3）云何名師子遊戲三昧？住是三昧，能遊戲諸三昧中如師子，是名師子遊戲三昧。
（4）云何名妙月三昧？住是三昧，能照諸三昧如淨月，是名妙月三昧。
（5）云何名月幢相三昧？住是三昧，能持諸三昧相，是名月幢相三昧。#47.7
（6）云何名出諸法三昧？住是三昧，能出生諸三昧，是名出諸法三昧。
（7）云何名觀頂三昧？住是三昧，能觀諸三昧頂，是名觀頂三昧。
（8）云何名畢法性三昧？住是三昧，決定知法性，是名畢法性三昧。#47.8
（9）云何名畢幢相三昧？住是三昧，能持諸三昧幢，是名畢幢相三昧。
（10）云何名金剛三昧？住是三昧，能破諸三昧，是名金剛三昧。#47.9
（11）云何名入法印三昧？住是三昧，入諸法印，是名入法印三昧。
（12）云何名三昧王安立三昧？住是三昧，一切諸三昧中安立住如王，是名三昧王安立三昧。
（13）云何名放光三昧？住是三昧，能放光照諸三昧，是名放光三昧。
（14）云何名力進三昧？住是三昧，於諸三昧能作力勢，是名力進三昧。#47.10
（15）云何名高出三昧？住是三昧，能增長諸三昧，是名高出三昧。
（16）云何名必入辯才三昧？住是三昧，能辯說諸三昧，是名必入辯才三昧。
（17）云何名釋名字三昧？住是三昧，能釋諸三昧名字，是名釋名字三昧。
（18）云何名觀方三昧？住是三昧，能觀諸三昧方，是名觀方三昧。
（19）云何名陀羅尼印三昧？住是三昧，持諸三昧印，是名陀羅尼印三昧。
（20）云何名無誑三昧？住是三昧，於諸三昧不欺誑，是名無誑三@t25p397b昧。#47.11
~1333（21）云何名攝諸法海三昧？住是三昧，能攝諸三昧如大海水，是名攝諸法海三昧。#47.12
（22）云何名遍覆虛空三昧？住是三昧，遍覆諸三昧如虛空，是名遍覆虛空三昧。
（23）云何名金剛輪三昧？住是三昧，能持諸三昧分，是名金剛輪三昧。#47.13
（24）云何名斷寶三昧？住是三昧，斷諸三昧煩惱垢，是名斷寶三昧。#47.14
（25）云何名能照三昧？住是三昧，能以光明顯照諸三昧，是名能照三昧。
（26）云何名不求三昧？住是三昧，無法可求，是名不求三昧。
（27）云何名無住三昧？住是三昧，一切三昧中不見法住，是名無住三昧。#47.15
（28）云何名無心三昧？住是三昧，心心數法不行，是名無心三昧。#47.16
（29）云何名淨燈三昧？住是三昧，於諸三昧中作明如燈，是名淨燈三昧。
（30）云何名無邊明三昧？住是三昧，與諸三昧作無邊明，是名無邊明三昧。
（31）云何名能作明三昧？住是三昧，即時能為諸三昧作明，是名能作明三昧。#47.17
（32）云何名普照明三昧？住是三昧，即能照諸三昧門，是名普照明三昧。
（33）云何名堅淨諸三昧三昧？住是三昧，能堅淨諸三昧相，是名堅淨諸三昧三昧。
（34）云何名無垢明三昧？住是三昧，能除諸三昧垢，亦能照一切三昧，是名無垢明三昧。
（35）云何名歡喜三昧？住是三昧，能受諸三昧喜，是名歡喜三昧。
（36）云何名電光三昧？住是三昧，照諸三昧如電光，是名電光三昧。
（37）云何名無盡三昧？住是三昧，於諸三昧不見盡，是名無盡三昧。#47.18
（38）云何名威德三昧？住是三昧，於諸三昧威德照然，是名威德三昧。
（39）云何名離盡三昧？住是三昧，不見諸三昧盡，是名離盡三昧。#47.19
（40）云何@t25p397c名不動三昧？住是三昧，令諸三昧不動不戲，是名不動三昧。#47.20
（41）云何名不退三昧？住是三昧，能不見諸三昧退，是名不退三昧。
~1334（42）云何名日燈三昧？住是三昧，放光照諸三昧門，是名日燈三昧。
（43）云何名月淨三昧？住是三昧，能除諸三昧闇，是名月淨三昧。
（44）云何名淨明三昧？住是三昧，於諸三昧得四無礙智，是名淨明三昧。
（45）云何名能作明三昧？住是三昧，於諸三昧門能作明，是名能作明三昧。#47.21
（46）云何名作行三昧？住是三昧，能令諸三昧各有所作，是名作行三昧。#47.22
（47）云何名知相三昧？住是三昧，見諸三昧知相，是名知相三昧。
（48）云何名如金剛三昧？住是三昧，能貫達諸法亦不見達，是名如金剛三昧。#47.23
（49）云何名心住三昧？住是三昧，心不動不轉不惱亦不念有是心，是名心住三昧。
（50）云何名普明三昧？住是三昧，普見諸三昧明，是名普明三昧。
（51）云何名安立三昧？住是三昧，於諸三昧安立不動，是名安立三昧。
（52）云何名寶聚三昧？住是三昧，普見諸三昧如見寶聚，是名寶聚三昧。
（53）云何名妙法印三昧？住是三昧，能印諸三昧，以無印印故，是名妙法印三昧。
（54）云何名法等三昧？住是三昧，觀諸法等、無法不等，是名法等三昧。#47.24
（55）云何名斷喜三昧？住是三昧，斷一切法中喜，是名斷喜三昧。
（56）云何名到法頂三昧？住是三昧，滅諸法闇亦在諸三昧上，是名到法頂三昧。
（57）云何名能散三昧？住是三昧中，能破散諸法，是名能散三昧。
（58）云何名分別諸法句三昧？住是三昧，能#47.25分別諸三昧諸法句，是名分別諸法句三昧。
（59）云何名字等@t25p398a相三昧？住是三昧，得諸三昧字等，是名字等相三昧。
（60）云何名離字三昧？住是三昧，諸三昧中乃至不見一字，是名離字三昧。
（61）云何名斷緣三昧？住是三昧，斷諸三昧緣，是名斷緣三昧。#47.26
（62）云何名不壞三昧？住是三昧，不得諸法變異，是名不壞三昧。#47.27
（63）云何名無種相三昧？住是三昧，不見諸法種種，是名無種相三昧。#47.28
（64）云何名無處行三昧？住是三昧，不見諸三昧處，是名無處行三昧。
（65）云何名離曚昧三昧？住是三昧，離諸三昧微闇，是名離曚#47.29昧三昧。
~1335（66）云何名無去三昧？住是三昧，不見一切三昧去相，是名無去三昧。
（67）云何名不變異三昧？住是三昧，不見諸三昧變異相，是名不變異三昧。
（68）云何名度緣三昧？住是三昧，度一切三昧緣境界，是名度緣三昧。#47.30
（69）云何名集諸功德三昧？住是三昧，集諸三昧功德，是名集諸功德三昧。
（70）云何名住無心三昧？住是三昧，於諸三昧心不入，是名住無心三昧。
（71）云何名淨妙華三昧？住是三昧，令諸三昧得淨妙如華，是名淨妙華三昧。
（72）云何名覺意三昧？住是三昧，諸三昧中得七覺分，是名覺意三昧。
（73）云何名無量辯三昧？住是三昧，於諸法中得無量辯，是名無量辯三昧。
（74）云何名無等等三昧？住是三昧，諸三昧中得無等等相，是名無等等三昧。
（75）云何名度諸法三昧？住是三昧，度一切三昧#47.31，是名度諸法三昧。#47.32
（76）云何名分別諸法三昧？住是三昧，諸三昧及諸法分別見，是名分別諸法三昧。
（77）云何名散疑三昧？住是三昧，得散諸法疑，是名散疑三昧。
（78）云何名無住處三昧？住是三昧，@t25p398b不見諸法住處，是名無住處三昧。
（79）云何名一莊嚴三昧？住是三昧，終不見諸法二相，是名一莊嚴三昧。#47.33
（80）云何名生行三昧？住是三昧，不見諸行生，是名生行三昧。#47.34
（81）云何名一行三昧？住是三昧，不見諸三昧此岸、彼岸，是名一行三昧。#47.35
（82）云何名不一行三昧？住是三昧，不見諸三昧一相，是名不一行三昧。#47.36
（83）云何名妙行三昧？住是三昧，不見諸三昧二相，是名妙行三昧。#47.37
~1336（84）云何名達一切有底散三昧？住是三昧，入一切有、一切三昧，智慧通達亦無所達，是名達一切有底散三昧。#47.38
（85）云何名入名語三昧？住是三昧，入一切三昧名語，是名入名語三昧。
（86）云何名離音聲字語三昧？住是三昧，不見諸三昧音聲字語，是名離音聲字語三昧。
（87）云何名然炬三昧？住是三昧，威德照明如炬，是名然炬三昧。
（88）云何名淨相三昧？住是三昧，淨諸三昧相，是名淨相三昧。
（89）云何名破相三昧？住是三昧，不見諸三昧相，是名破相三昧。#47.39
（90）云何名一切種妙足三昧？住是三昧，一切諸三昧種皆具足，是名一切種妙足三昧。
（91）云何名不喜苦樂三昧？住是三昧，不見諸三昧苦樂，是名不喜苦樂三昧。
（92）云何名無盡相三昧？住是三昧，不見諸三昧盡，是名無盡相三昧。#47.40
（93）云何名陀羅尼#47.41三昧？住是三昧，能持諸三昧，是名陀羅尼三昧。
（94）云何名攝諸邪正相三昧？住是三昧，於諸三昧不見邪正相，是名攝諸邪正相三昧。#47.42
（95）云何名滅憎愛三昧？住是三昧，不見諸三昧憎愛，是名滅憎愛三昧。
（96）云何名逆順三昧？住是三昧，不見諸法、諸三昧逆順，是@t25p398c名逆順三昧。
（97）云何名淨光三昧？住是三昧，不得諸三昧明垢，是名淨光三昧。#47.43
（98）云何名堅固三昧？住是三昧，不得諸三昧不堅固，是名堅固三昧。
（99）云何名滿月淨光三昧？住是三昧，諸三昧滿足如月十五日，是名滿月淨光三昧。
（100）云何名大莊嚴三昧？住是三昧，大莊嚴成就諸三昧，是名大莊嚴三昧。
（101）云何名能照一切世三昧？住是三昧，諸三昧及一切法能照，是名能照一切世三昧。
（102）云何名三昧等三昧？住是三昧，於諸三昧不得#47.44定亂相，是名三昧等三昧。
（103）云何名攝一切有諍無諍三昧？住是三昧，能使諸三昧不分別有諍無諍，是名攝一切有諍無諍三昧。
（104）云何名不樂一切住處三昧？住是三昧，不見諸三昧依處，是名不樂一切住處三~1337昧。
（105）云何名如住定三昧？住是三昧，不過諸三昧如相，是名如住定三昧。#47.45
（106）云何名壞身衰三昧？住是三昧，不得身相，是名壞身衰三昧。#47.46
（107）云何名壞語如虛空三昧？住是三昧，不見諸三昧語業如虛空，是名壞語如虛空三昧。
（108）云何名離著虛空不染三昧？住是三昧，見諸法如虛空無礙亦不染，是#47.47名離著虛空不染三昧。
須菩提！是名菩薩摩訶薩摩訶衍。」
^48.1
　
　　$$（一）六度是摩訶衍（承上卷46〈18 釋摩訶衍品〉）
　　$$（二）十八空、四空是摩訶衍（承上卷46〈18 釋摩訶衍品〉）
　　$$（三）百八三昧是摩訶衍（承上卷47）
　　%37.980 （四）三十七道品是摩訶衍
%37.981 1、四念處#48.2@yE006p296
%37.982 （1）總標
佛告須菩提：「菩薩摩訶薩摩訶衍，所謂四念處。何等四？
%37.983 A、明循身觀不可得
須菩提！菩薩摩訶薩，內身中循#48.3身觀，亦無身覺，以不可得故；外身中、內外身中循身觀，亦無身覺，以不可得故。勤精進一心，除世間貪憂。
%37.984 B、循受、心、法觀不可得
內受、內心、內法，外受、外心、外法，內外受、內外心、內外法，循法觀，亦無法覺，以不可得故。勤精進一心，除世間貪憂。
%37.985 （2）別釋
%37.986 A、明身念處
%37.987 （A）依內身說
須菩提！菩薩摩訶薩，云何內身中循身觀？
%37.988 a、行住坐臥正知而住
須菩提！若菩薩摩訶薩行時知行、住時知住、坐時知坐、臥時知臥──如身所行如是知。
須菩提！菩薩摩訶薩如是內身中循身觀，勤精進一心，除世間貪憂，以不可得故。#48.4
~1355
%37.989 b、來去、衣食、臥覺、語默、坐禪，常一心
復次，須菩提！@t25p403a菩薩摩訶薩若來若去，視瞻#48.5一心，屈申#48.6俯仰#48.7、服僧伽梨#48.8、執持衣鉢、飲食、臥息、坐立、睡覺、語默，入禪、出禪，亦常一心。
如是，須菩提！菩薩摩訶薩行般若波羅蜜，內身中循身觀，以不可得故。
%37.990 c、繫心觀息
復次，須菩提！菩薩摩訶薩內身中循身觀時，一心念：『入息時知入息，出息時知出息；入息長時知入息長，出息長時知出息長；入息短時知入息短，出息短時知出息短。譬如旋#48.9師、若旋師弟子，繩長知長，繩短知短。』#48.10
菩薩摩訶薩，亦如是一心念：『入息時知入息，出息時知出息；入息長時知入息長，出息長時知出息長；入息短時知入息短，出息短時知出息短。』
如是，須菩提！菩薩摩訶薩內身中循身觀，勤精進一心，除世間貪憂，以不可得故。
%37.991 d、觀身四大
復次，須菩提！菩薩摩訶薩觀身四大，作是念：『身中有地大、水大、火大、風大。』譬如屠牛師、若屠牛弟子，以刀殺牛，分作四分，作四分已，若立若坐，觀此四分。#48.11
菩薩摩訶薩亦如是，行般若波羅蜜時，種種觀身四大──地大、水大、火大、風大。
如是，須菩提！菩薩摩訶薩內身中循身觀，以不可得故。
%37.992 e、觀內身不淨：身三十六種不淨#48.12
復次，須菩提！菩薩摩訶薩觀內身，從足至頂，周匝#48.13薄皮#48.14，種種不淨充滿身中；作是念：『身中有髮、毛、爪、齒、薄皮、厚皮、筋、肉、骨、髓、脾、腎、心、肝、肺、小腸、大腸、胃、胞、𡱁、尿#48.15、垢、汗、目、淚、涕、#48.16唾、~1356膿、血、黃、白痰、陰、肪、𦙽#48.17、腦、膜#48.18。』
譬如田夫#48.19倉#48.20中，隔盛雜穀，種種充滿，稻、麻、黍、粟、豆、麥；明眼之人，開倉即知是麻、是黍、是稻、是粟、是麥、是豆，分別悉知。
菩薩摩訶薩亦如是觀是身，從足至頂，周匝薄皮，種種不@t25p403b淨充滿身中──髮毛、爪齒，乃至腦膜。
如是，須菩提！菩薩摩訶薩觀內身，勤精進一心，除世間貪憂，以不可得故。
%37.993 f、觀外身敗壞：九相觀#48.21
%37.994 （a）青瘀膨脹壞相
復次，須菩提！菩薩摩訶薩若見棄死人身，一日、二日，至于五日，膖脹、青瘀，膿汁流出；自念：『我身亦如是相、如是法，未脫此法。』
如是，須菩提！菩薩摩訶薩內身中循身觀，勤精進一心，除世間貪憂，以不可得故。
%37.995 （b）噉相
復次，須菩提！菩薩摩訶薩若見棄死人身，若六日、若七日，烏、鵄#48.22、雕#48.23、鷲#48.24、犲豺狼、狐、狗如是等種種禽獸爴#48.25裂食之；自念：『我身#48.26如是相、如是法，未脫此法。』
如是，須菩提！菩薩摩訶薩內身中循身觀，勤精進一心，除世間貪憂，以不可得故。
~1357
%37.996 （c）膿爛相
復次，須菩提！菩薩摩訶薩若見棄死人身，禽獸食已，不淨爛臭；自念：『我身如是相、如是法，未脫此法。』乃至除世間貪憂。
%37.997 （d）血塗相
復次，須菩提！菩薩摩訶薩若見棄死人身，骨鎖#48.27血肉塗染，筋骨相連；自念：『我身如是相、如是法，未脫此法。』乃至除世間貪憂。
%37.998 （e）異赤相
復次，須菩提！菩薩摩訶薩若見棄死人身，骨瑣#48.28血肉已離，筋骨相連；自念：『我身如是相、如是法，未脫此法。』乃至除世間貪憂。
%37.999 （f）分散相
復次，須菩提！菩薩摩訶薩若見棄死人身，骨瑣已散在地；自念：『我身如是相、如是法，未脫此法。』如是，須菩提！菩薩摩訶薩觀內身，乃至除世間貪憂。
%37.1000 （g）骨相
復次，須菩提！菩薩摩訶薩若見棄@t25p403c死人身，骨散在地，腳骨異處，膞#48.29骨、髀#48.30骨，腰骨、肋#48.31骨，脊骨、手骨，項骨、髑髏，各各異處；自念：『我身如是相、如是法，未脫此法。』如是，須菩提！菩薩摩訶薩觀內身，乃至除世間貪憂。
%37.1001 （h）白骨相
復次，須菩提！菩薩摩訶薩見是棄死人骨在地，歲久風吹日曝，色白如貝；自念：『我身如是相、如是法，未脫此法。』如是，須菩提！菩薩摩訶薩觀內身，乃至除世間貪憂，以不可得故。#48.32▼
%37.1002 （i）散壞相#48.33
~1358復次，須菩提！菩薩摩訶薩見是棄死人骨在地，歲久#48.34，其色如鴿，腐朽爛壞，與土共合，自念：『我身如是法、如是相，未脫此法。』
%37.1003 g、結［於內身中循身觀］
如是，須菩提！菩薩摩訶薩內身中循身觀，勤精進一心，除世間貪憂，以不可得故。
%37.1004 （B）例同外身、內外身
外身、內外身亦如是。
%37.1005 B、例同受、心、法念處
受念處、心念處、法念處亦應如是廣說。
須菩提！是名菩薩摩訶薩摩訶衍。
%37.1006 2、四正勤@yE006p296
復次，須菩提！菩薩摩訶薩摩訶衍，所謂四正勤。
何等四？須菩提！菩薩摩訶薩未生諸惡不善法為不生故，欲生勤精進攝心行道；已生諸惡不善法為斷故，欲生勤精進攝心行道；未生諸善法為生故，欲生勤精進攝心行道；已生諸善法為住不失修滿增廣故，欲生勤精進攝心行道。
以不可得故。須菩提！是名菩薩摩訶薩摩訶衍。
%37.1007 3、四如意分@yE006p296
復次，須菩提！菩薩摩訶薩摩訶@t25p406b衍，所謂四如意分。
何等四？欲定斷行成就修如意分，心定斷行成就修如意分，精進定斷行成就修如意分，思惟定斷行成就修如意分。
以不可得故。須菩提！是名菩薩摩訶薩摩訶衍。
%37.1008 4、五根
復次，須菩提！菩薩摩訶薩摩訶衍，所謂五根。
何等五？信根、精進根、念根、定根、慧根。
是名菩薩摩訶薩摩訶衍，以不可得故。
%37.1009 5、五力
復次，須菩提！菩薩摩訶薩摩訶衍，所謂五力。
何等五？信力、精進力、念力、定力、慧力。
是名菩薩摩訶薩摩訶衍，以不可得故。
%37.1010 6、七覺分
復次，須菩提！菩薩摩訶薩摩訶衍，所謂七覺分。
何等七？菩薩摩訶薩修念覺分，依離、依無染、向涅槃；擇法覺分、精進覺分、喜~1359覺分、除覺分、定覺分、捨覺分，依離、依無染、向涅槃。以不可得故，是名菩薩摩訶薩摩訶衍。
%37.1011 7、八聖道分
復次，須菩提！菩薩摩訶薩摩訶衍，所謂八聖道分。
何等八？正見、正思惟、正語、正業、正命、正精進、正念、正定。
是名菩薩摩訶薩摩訶衍，以不可得故。
%37.1012 （五）三三昧是摩訶衍
復次，須菩提！菩薩摩訶薩摩訶衍，所謂三三昧。
何等三？空、無相、無作三昧。
%37.1013 1、空三昧
「空三昧」名諸法自相空，是為空解脫門。
%37.1014 2、無相三昧
「無相」名壞諸法相，不憶不念，是為無相解脫門。
%37.1015 3、無作三昧
「無作」名諸法中不作願，是為無作解脫門。#48.35
是名菩薩摩訶薩摩訶衍，以不可得故。
%37.1016 （六）十一智是摩訶衍
復次，須菩提！菩薩摩訶薩摩訶衍，所謂苦智、集智、滅智、道智、盡智、無生智、法智、比智、世智、他心智、如實智。
%37.1017 1、苦智
云何名苦智？知苦不生，是名苦智。
%37.1018 2、集智
云何名集智？知集應斷，是名集智。
%37.1019 3、滅智
云何名滅智？知苦滅，是名滅智。
%37.1020 4、道智
云何名道智？知八聖道分，是名道智。
%37.1021 5、盡智
云何名盡智？知諸@t25p406c婬怒癡盡，是名盡智。
%37.1022 6、無生智
云何名無生智？知諸有中無生，是名無生智。#48.36
%37.1023 7、法智
云何名法智？知五眾本事分別知無，是名法智。#48.37
~1360
%37.1024 8、比智
云何名比智？知眼無常乃至意觸因緣生受無常，是名比智。
%37.1025 9、世智
云何名世智？知因緣、名字，是名世智。
%37.1026 10、他心智
云何名他心智？知他眾生心，是名他心智。
%37.1027 11、如實智
云何名如實智？知諸佛一切種智，是名如實智。
須菩提！是名菩薩摩訶薩摩訶衍，以不可得故。
%37.1028 （七）三根是摩訶衍
復次，須菩提！菩薩摩訶薩摩訶衍，所謂三根：未知欲知根、知根、知者根。
%37.1029 1、未知欲知根
云何名未知欲知根？諸學人未得果信根、精進根、念根、定根、慧根，是名未知欲知根。#48.38
%37.1030 2、知根
云何名知根？諸學人得果信根乃至慧根，是名知根。#48.39
%37.1031 3、知者根
云何名知者根？諸無學人──若阿羅漢、若辟支佛、諸佛信根乃至慧根，是名知者根。
須菩提！是名菩薩摩訶薩摩訶衍，以不可得故。
%37.1032 （八）覺觀等三三昧是摩訶衍
復次，須菩提！菩薩摩訶薩摩訶衍，所謂三三昧。
何等三？有覺有觀三昧，無覺有觀三昧，無覺無觀三昧。
%37.1033 1、有覺有觀三昧
云何名有覺有觀三昧？離諸欲、離惡不善法，有覺有觀，離生喜樂入初禪，是名有覺有觀三昧。
%37.1034 2、無覺有觀三昧
云何名無覺有觀三昧？初禪二禪中間，是名無覺有觀三昧。
%37.1035 3、無覺無觀三昧
云何名無覺無觀三昧？從二禪乃至非有想非無想定，是名無覺無觀三昧。
是名菩薩摩訶薩摩訶衍，以不可得故。
~1361
%37.1036 （九）十念是摩訶衍
復次，須菩提！菩薩摩訶薩摩訶衍，所謂十念。
何等十？（1）念佛、（2）念法、（3）念僧、（4）念戒、（5）念捨、（6）念天、（7）念滅#48.40、（8）念出入息、（9）念身、（10）念死。
須菩提！是名菩薩摩訶薩摩訶衍，以不可得故。
%37.1037 （十）四禪、四無量心、四無色定、八背捨、九次第定等諸禪定是摩訶衍
復次，須菩提！菩薩摩訶薩摩訶衍，所謂四禪、四無量心、@t25p407a四無色定、八背捨、九次第定。須菩提！是名菩薩摩訶薩摩訶衍，以不可得故。
%37.1038 （十一）佛十力是摩訶衍
復次，須菩提！菩薩摩訶薩摩訶衍，所謂佛十力。
何等十？（1）佛如實知一切法是處不是處相，一力也；（2）如實知他眾生過去、未來、現在諸業諸受法，知造業處、知因緣、知報，二力也；（3）如實知諸禪、解脫、三昧、定垢淨分別相，三力也；（4）如實知他眾生諸根上下相，四力也；（5）如實知他眾生種種欲解，五力也；（6）如實知世間種種無數性，六力也；（7）如實知一切至處道，七力也；（8）知種種宿命，有相、有因緣，一世、二世乃至百千世，劫初劫盡，我在彼眾生中生──如是姓，如是名，如是飲食、苦樂、壽命長短；彼中死、是間生，是間死、還生是間，此間生姓名、飲食、苦樂、壽命長短亦如是，八力也；（9）佛天眼淨，過諸天眼#48.41，見眾生死時生時、端正醜陋、若大若小、若墮惡道若墮善道；如是業因緣受報──是諸眾生惡身業成就、惡口業成就、惡意業成就，謗毀聖人，受邪見業因緣故，身壞死時入惡道，生地獄中；是諸眾生善身業成就，善口業成就，善意業成就，不謗毀聖人，受正見業因緣故，身就壞#48.42時入善道，生天上，九力也；（10）佛如實知諸漏盡故，無漏心解脫，無漏慧解脫；現在法中自證知入是法，所謂我生已盡，梵行已作，從今世不復見後世，十力也。
須菩提！是名菩薩摩訶薩摩訶衍，以不可得故。
%37.1039 （十二）四無所畏是摩訶衍
復次，須菩提！菩薩摩訶薩摩訶衍，所謂四無所畏。
何等四？
%37.1040 1、正知一切法無所畏
佛作誠言：『我是一切正智人。』若有沙門、婆羅門，若天、若魔、若梵、若復餘眾，如實難言：『是法@t25p407b不知。』乃至不見是微畏相#48.43。以是故，我得安隱，得無所畏，安住聖主處，在大眾中師子吼，能轉梵輪；諸沙門、婆羅門，若天、若魔、若梵、若復餘眾，實不能轉。一無畏也。
%37.1041 2、盡一切漏習無所畏
佛作誠言：『我一切漏盡。』若有沙門、婆羅門，若天、若魔、若梵、若復餘眾，~1362如實難言：『是漏不盡。』乃至不見是微畏相。以是故，我得安隱，得無所畏，安住聖主處，在大眾中師子吼，能轉梵輪；諸沙門、婆羅門，若天、若魔、若梵、若復餘眾，實不能轉。二無畏也。
%37.1042 3、說一切障道法無所畏
佛作誠言：『我說障法。』若有沙門、婆羅門，若天、若魔、若梵、若復餘眾，如實難言：『受是法不障道。』乃至不見是微畏相。以是故，我得安隱，得無所畏，安住聖主處，在大眾中師子吼，能轉梵輪；諸沙門、婆羅門，若天、若魔、若梵、若復餘眾，實不能轉。三無畏也。
%37.1043 4、說盡苦聖道無所畏
佛作誠言：『我所說聖道，能出世間，隨是行能盡苦。』若有沙門、婆羅門，若天、若魔、若梵、若復餘眾，如實難言：『行是道不能出世間，不能盡苦。』乃至不見是微畏相。以是故，我得安隱，得無所畏，安住聖主處，在大眾中師子吼，能轉梵輪；諸沙門、婆羅門，若天、若魔、若梵、若復餘眾，實不能轉。四無畏也。
須菩提！是名菩薩摩訶薩摩訶衍，以不可得故。
%37.1044 （十三）四無礙智是摩訶衍
復次，須菩提！菩薩摩訶薩摩訶衍，所謂四無礙智。
何等四？義無礙、法無礙、辭無礙、樂說無礙。
%37.1045 1、義無礙智
義無礙者，知諸法實相義。
%37.1046 2、法無礙智
法無礙者，知諸法名。
%37.1047 3、辭無礙智
辭無礙者，言辭中無礙。
%37.1048 4、樂說無礙智
樂說無礙者，審諦#48.44言無盡。#48.45
須菩提！是名菩薩摩訶薩摩訶衍，以不可得故。
%37.1049 （十四）十八不共法是摩訶衍
復次，須菩提！菩薩摩訶薩摩訶衍，所謂十八不共法。
何等十八？@t25p407c一、諸佛身無失，二、口無失，三、念無失；四、無異想；五、無不定心；六、無不知已捨心；七、欲無減，八、精進無減，九、念無減，十、慧無減，十一、解脫無減，十二、解脫知見無減；十三、一切身業隨智慧行，十四、一切口業隨智慧行，十五、一切意業隨智慧行；十六、智慧知見過去世無礙無障，十七、智慧知見未來世無礙無障，十八、智慧知見現在世無礙無障。
須菩提！是名菩薩摩訶薩摩訶衍，以不可得故。#48.46
^48.2
▲
%37.1107 （十五）四十二字門是摩訶衍
%37.1108 1、字等、語等諸字入門是摩訶衍
復次，須菩提！菩薩摩訶薩摩訶衍，所謂字等、語等諸字入門。#48.96
%37.1109 2、別釋四十二字門
何等為字等、語等諸字入門？
~1372（1）阿（a）#48.97字門，一切法初（ādi）不生故。#48.98
（2）羅（ra）字門，一切法離垢（rajas）故。#48.99
（3）波（pa）字門，一切法第一義（paramārtha）故。#48.100
（4）遮（ca）字門，一切法終不可得故，諸法不終（cyavana）不生故。#48.101
（5）那（na）字門，諸法離名（nāma），性相不得不失故。#48.102
（6）邏（la）字門，諸法度世間（loka）故，亦愛枝（latā）因緣#48.103滅故。#48.104
（7）陀（da）字門，諸法善心生故，亦施相故。#48.105
（8）婆（ba）字門，諸法婆字離故。#48.106
（9）荼（ḍa）字門，諸法荼字淨故。#48.107
（10）沙（ṣa）字門，諸法六自在王性清淨故。#48.108
~1373（11）和（va）字門，入諸法語言道（vāk-patha）斷故。#48.109
（12）多（ta）字門，入諸法如相（tathātā）不動故。#48.110
（13）夜（ya）字門，入諸法如實（yathāvat）不生故。#48.111
（14）吒（ṣṭa或sta？）字門，入諸法制伏（stambha）不可得故。#48.112
（15）迦（ka）字門，入諸法作者（kāraka）不可得故。#48.113
（16）娑#48.114（sa）字門，入諸法時不可得故，諸法時來#48.115轉故。#48.116
（17）磨（ma）字門，入諸法我所（mama-kāra）不可得故。#48.117
（18）伽（ga）字門，入諸法去者不可得故。#48.118
~1374（19）他（tha或stha？）字門，入諸法處不可得故。#48.119
（20）闍（ja）字門，入諸法生（jāti）不可得故。#48.120
（21）簸#48.121（śva）字門，入諸法簸字（śvāsa）不可得故。#48.122
（22）䭾（dha）字門，入諸法性（dharmadhātu）不可得故。#48.123
（23）賒#48.124（śa）字門，入諸法定（śamatha）不可得故。#48.125
（24）呿#48.126（kha）字門，入諸法虛空（kha）不可得故。#48.127
（25）叉（kṣa）字門，入諸法盡（kṣaya）不可得故。#48.128
（26）哆（sta）字門，入諸法有不可得故。#48.129@t25p408a
~1375（27）若（jña）字門，入諸法智（jñāna）不可得故。#48.130
（28）拖#48.131（rta或tha？）字門，入諸法拖字不可得故。#48.132
（29）婆（bha）字門，入諸法破壞（bhaṅga）不可得故。#48.133
（30）車（cha）字門，入諸法欲（chanda）不可得故，如影（chāyā）五眾亦不可得故。#48.134
~1376（31）魔（sma或śma？）字門，入諸法魔字不可得故。#48.135
（32）火（hva）字門，入諸法喚（āhvāna）不可得故。#48.136
（33）蹉#48.137（tsa）字門，入諸法蹉字不可得故。#48.138
（34）伽（gha）字門，入諸法厚（ghana）不可得故。#48.139
（35）咃（ṭha）字門，入諸法處不可得故。#48.140
（36）拏（ṇa）字門，入諸法不來不去，不立不坐不臥故。#48.141
（37）頗（pha）字門，入諸法邊#48.142不可得故。#48.143
~1377（38）歌（ska）字門，入諸法聚（skandha）不可得故。#48.144
（39）醝（ysa）字門，入諸法醝字不可得故。#48.145
（40）遮（śca或ca？）字門，入諸法行（caraṇa）不可得故。#48.146
（41）咤#48.147（ṭa）字門，入諸法軀#48.148不可得故。#48.149
~1378（42）荼（ḍha）字門，入諸法邊竟#48.150處不可得故，不終不生故。#48.151
過荼無字可得。何以故？更無字故。
%37.1110 3、諸字無礙、無名、不可說示，如虛空
諸字無礙、無名，亦不#48.152滅，亦不可說、不可示、不可見、不可書。須菩提！當知一切諸法如虛空！須菩提！是名陀羅尼門，所謂阿字義。#48.153
%37.1111 4、受持讀誦諸字門，當得二十功德
若菩薩摩訶薩，是諸字門印阿字印，若聞、若受、若誦、若讀、若持、若為他說，如是知當得二十功德。何等二十？
（1）得強識念，（2）得慚愧，（3）得堅固心，（4）得經旨趣，（5）得智慧，（6）得樂說無礙，（7）易得諸#48.154陀羅尼門，（8）得無疑悔心，（9）得聞善不憙、聞惡不怒，（10）得不高不下住心得#48.155無增減，（11）得善巧知眾生語，（12）得巧分別五眾、十二入、十八界、十二因緣、四緣、四諦，（13）得巧分別眾生諸根利鈍，（14）得巧知他心，（15）得巧分別日月歲節，（16）得巧分別天耳通，（17）得巧分別宿命通，（18）得巧分別生死通，#48.156（19）得能巧說是處非處，（20）得巧知往來坐起等身威儀。
%37.1112 5、結
須菩提！是陀羅尼門#48.157、阿字門等，是名菩薩摩訶薩摩訶衍#48.158。」@t25p408b
^49.1
$$一、答第一問：何等是「摩訶衍」（承上卷46〈18 釋摩訶衍品〉～卷48）
%37.1127 二、答第二問：云何發趣大乘#49.1
%37.1128 （一）略答：以無所著、無所得行六度、歷十地，是名發趣大乘
佛告須菩提：「汝問：『云何菩薩摩訶薩大乘發趣？』#49.2若菩薩摩訶薩行六波羅蜜時，從一地至一地，是名菩薩摩訶薩大乘發趣。」#49.3
須菩提白佛言：「世尊！云何菩薩摩訶薩從一地至一地？」
佛言：「菩薩摩訶薩知一切法無來去相，亦無有法若來若去、若至若不至，諸法相不滅故。菩薩摩訶薩於諸地不念、不思惟而修治地業，亦不見地。#49.4
%37.1129 （二）十地發趣
%37.1130 1、標列
何等菩薩摩訶薩@t25p410a治地業？
%37.1131 （1）初地：行十事
菩薩摩訶薩住初地時，行十事：一者、深心堅固，是不可#49.5得故；#49.6二者、於一切眾生中等心，眾生不可#49.7得故；三者、布施#49.8，與人、受人不可得故；四者、親#49.9近善~1386知識，亦不自高；五者、求法，一切法不可得故；六者、常出家，家不可得故；七者、愛樂佛身，相好不可得故；八者、演出法教，諸法分別不可得故；九者、破憍慢法，生慧不可得故；#49.10十者、實語，諸語不可得故。菩薩摩訶薩如是初地中住，修治十事治地業。
%37.1132 （2）第二地：滿足八法
復次，須菩提！菩薩摩訶薩住二#49.11地中，常念八法。何等八？一者、戒清淨，二者、知恩報恩，三者、住忍辱，四者、受歡喜，五者、不捨一切眾生，六者、入大悲心，七者、信師恭敬諮受#49.12，八者、勤求諸波羅蜜。須菩提！是名菩薩摩訶薩住二地中，應滿足八法。
%37.1133 （3）第三地：滿足五法
復次，須菩提！菩薩摩訶薩住三地中行五法。何等五？一者、多學問無厭足，二者、淨法施亦不自高，三者、莊嚴#49.13佛國土亦不自高，四者、受世間無量勤苦不以為厭，五者、住慚愧處。須菩提！是名菩薩摩訶薩住三#49.14地中應滿足五法。
%37.1134 （4）第四地：不捨十法
復次，須菩提！菩薩摩訶薩住四地中應受行不捨十法。何等十？一者、不捨阿練若住處，二者、少欲，三者#49.15知足，四#49.16者、不捨頭陀功德，五#49.17者、不捨戒#49.18，六#49.19者、穢惡#49.20諸欲#49.21，七#49.22者、厭世間心，八#49.23者、捨一切所有，九#49.24者、心不沒#49.25，十者、不惜一切物。須菩提！是名#49.26菩薩摩訶薩住第四地中不捨十法。
~1387
%37.1135 （5）第五地：遠離十二法
復次，須菩提！菩薩摩訶薩住五地中遠離十二法。何等十二？一者、遠離親白衣，二者、遠離比@t25p410b丘尼，三者、遠離慳惜他家，四者、遠離無益談處#49.27，五者、遠離瞋恚，六者、遠離自大，七者、遠離蔑#49.28人，八者、遠離十不善道，九者、遠離大慢，十者、遠離自用#49.29，十一者、遠離顛倒，十二者、遠離婬怒癡。須菩提！是為#49.30菩薩摩訶薩住五#49.31地中遠離十二事。#49.32
%37.1136 （6）第六地：應具足六法，不應行六法
復次，須菩提！菩薩摩訶薩住六地中當具足六法。何等六？所謂六波羅蜜。復有六法所不應為。何等六？一者、不作聲聞、辟支佛意，二者、布施不應生憂心，三者、見有所索心不沒，四者、所有物布施，五者、布施之後心不悔，六者、不疑深法。須菩提！是名菩薩摩訶薩住六#49.33地中應滿具六法，遠離六法。
%37.1137 （7）第七地：不應著二十法，應具足滿二十法
復次，須菩提！菩薩摩訶薩住七地中二十法所不應著。何等二十？一者、不著我，二者、不著眾生，三者、不著壽命，四者、不著眾數乃至知者、見者；五者、不著斷見，六者、不著常見；七者、不應作相，八者、不應作因見；九者、不著名色；十者、不著五眾，十一者、不著十八界，十二者、不著十二入；十三者、不著三界；十四者、不作著處；十五者、不作所期處，十六者、不作依處；十七者、不著依佛見，十八者、不著依法見，十九者、不著依僧見，二十者、不著依戒見。是二十法所不應著。#49.34
~1388復有二十法應具足滿。何等二十？一者、具足空，二者、無相證，三者、知無作；四者、三分清淨；五者、一切眾生中具足慈悲智#49.35；六者、不念一切眾生；七者、一切法等觀，是#49.36中亦#49.37不著；八者、知諸法實相，是事亦不念；九者、無生法忍#49.38，十者、無生智；十一者、說諸法一相；十二者、破分別相；十三者、轉@t25p410c憶想；十四者、轉見；十五者、轉煩惱；十六者、等定慧地；十七者、調意；十八者、心寂滅；十九者、無礙智；二十者、不染愛。須菩提！是名菩薩摩訶薩住七#49.39地中應具足二十法。#49.40
%37.1138 （8）第八地：應具足二種五法
復次，須菩提！菩薩摩訶薩住八地中應具足五法。何等五？（1）順入眾生心；#49.41（2）遊戲諸神通；（3）觀#49.42諸佛國；（4）如所見佛國，自莊嚴其國；（5）如實觀佛身，自莊嚴佛身──是名#49.43五法具足滿。#49.44
復次，須菩提！菩薩摩訶薩住八地中復具足五法。何等五？（1）知上下諸根，（2）淨佛世界，（3）入如幻三昧，（4）常入三昧，（5）隨眾生所應善根受身。須菩提！是為菩薩摩訶薩住八#49.45地中具足五法。#49.46
~1389
%37.1139 （9）第九地：應具足十二法
復次，須菩提！菩薩摩訶薩住九地中應具足十二法。何等十二？（1）受無邊世界所度之分；（2）菩薩得如是#49.47願；（3）知諸天龍、夜叉、犍#49.48闥婆語而為說法；（4）處胎成就，（5）家#49.49成就，（6）所生#49.50成就，（7）姓成就，（8）眷屬成就，（9）出生成就，（10）出家成就，（11）莊嚴佛樹成就；（12）一切諸善功德成滿具足。須菩提！是名菩薩摩訶薩住九#49.51地中應具足十二法。#49.52
%37.1140 （10）第十地：當知如佛
須菩提！十地菩薩當知如佛。」
%37.1141 2、別釋
%37.1142 （1）初地：修行十事
爾時，慧命須菩提白佛言：（1）「世尊！云何菩薩摩訶薩深心治地業？」
佛言：「菩薩摩訶薩應薩婆若心，集諸善根，是名菩薩摩訶薩深心治地業。」
（2）「云何菩薩於一切眾生中等心？」
佛言：「若菩薩摩訶薩應薩婆若心，生四無量心，所謂慈、悲、喜、捨。是名於一切眾生中等心。」
（3）「云何菩薩修布施？」
佛言：「菩薩施與一切眾生無所分別，是名修布施。」
（4）「云何菩薩親近善知識？」
佛言：「能教入薩婆若中住──如是善知識，親近、諮受、恭敬、供養，是名親近善知識。」
（5）「云何菩@t25p411a薩求法？」
佛言：「若菩薩應薩婆若心求法，不墮聲聞、辟支佛地，是名求法。」
~1390（6）「云何菩薩常出家治地業？」
佛言：「菩薩世世不雜心，佛法中出家，無能障礙者#49.53，是名常出家治地業。」
（7）「云何菩薩愛樂佛身治地業？」
佛言：「若菩薩見佛身相，乃至阿耨多羅三藐三菩提，終不離念佛，是名愛樂佛身治地業。」
（8）「云何菩薩演出法教治地業？」
佛言：「菩薩，若佛現在#49.54、若佛滅度後，為眾生說法，初、中、後善，妙義好語，淨潔純具#49.55，所謂修妬#49.56路乃至優婆#49.57提舍，是名演出法教治地業。」
（9）「云何菩薩破於憍慢治地業？」
佛言：「菩薩破是憍慢故，終不生下賤家#49.58，是名#49.59破於憍慢治地業。」
（10）「云何菩薩實語治地業？」
佛言：「菩薩如所說，隨說#49.60行，是名實語治地業。
是為菩薩摩訶薩住初地#49.61中修行#49.62十事治地業。」
^49.2
%37.1189 （2）第二地：滿足八法
~1398（1）「云何菩薩戒#49.131清淨？」
「若菩薩摩訶薩不念聲聞、辟支佛心，及諸破戒障佛道法，是名戒清淨。」
（2）「云何菩薩知恩報恩？」
「若菩薩摩訶薩行菩薩道，乃至小恩尚不忘，何況多！是名知恩報恩。」
（3）「云何菩薩住忍辱力？」
「若菩薩於一@t25p413a切眾生無瞋無惱，是名住忍辱力。」
（4）「云何菩薩受歡喜？」
「所謂成就眾生，以此為喜，是名受歡喜。」
（5）「云何菩薩不捨一切眾生？」
「若菩薩念欲救一切眾生故，是名不捨一切眾生。」
（6）「云何菩薩入大悲心？」
「若菩薩如是念：『我為一一眾生故，如恒河沙等劫地獄中受勤#49.132苦，乃至是人得佛道、入涅槃。』如是名為為#49.133一切十方眾生忍苦，是名入大悲心。」
（7）「云何菩薩信師恭敬諮受？」
「若菩薩於諸師如世尊想，是名信師恭敬諮受。」
（8）「云何菩薩勤求諸波羅蜜？」
「若菩薩一心求諸波羅蜜無異事，是名勤求諸波羅蜜。#49.134
是為菩薩摩訶薩住二地中滿足八法。」
%37.1190 （3）第三地：滿足五法
（1）「云何#49.135菩薩摩訶薩多學問無厭足？」
「諸佛所說法#49.136，若是此#49.137間世界，若十方世界諸佛所說，盡欲聞持，是名#49.138多學問無厭足。」
（2）「云何菩薩淨法施？」
「有所#49.139法施，乃至不求阿耨多羅三藐三菩提，何況餘事！是名不求名利法施。」
（3）「云何菩薩淨佛世界？」
「以諸善根迴向淨佛世界，是名#49.140淨佛世界。」
~1399（4）「云何菩薩受世間無量勤苦不以為厭？」
「諸善根備具故，能成就眾生亦莊嚴佛界#49.141，乃至具足薩婆若，終不疲厭，是名受無量勤苦不以為厭。」#49.142
（5）「云何菩薩住慚愧處？」
「恥諸聲聞、辟支佛意，是名住慚愧處。
是為菩薩摩訶薩住三地中滿足五法。」
%37.1191 （4）第四地：不捨十法
（1）「云何菩薩不捨阿蘭若住處？」
「能過聲聞、辟支佛地，是名不捨阿蘭若住處。」
（2）「云何菩薩少欲？」
「乃至阿耨多羅三藐三菩提尚不欲，何況餘欲！是名少欲。」
（3）「云何菩薩知足？」
「得一切種智，是名知足。」
（4）「云何菩薩不捨頭陀功德？」
「觀諸深法忍，是名不捨頭陀功德。」
（5）「云何菩薩不捨戒？」
「不取戒相，是名不捨戒。」
（6）「云何菩薩穢惡諸欲？」
「欲心不生故，是名穢惡諸欲。」
（7）「云何菩薩厭世間心？」
「知一切法不作故，是名@t25p413b厭世間心。」#49.143
（8）「云何菩薩捨一切所有？」
「不惜內外諸法故，是名捨一切所有。」
（9）「云何菩薩心不沒？」
「二種識處心不生故，是名心不沒。」#49.144
~1400（10）「云何菩薩不惜一切物？」
「於一切物不著不念，是名不惜一切物。
是為#49.145菩薩於四地中不捨十法。」
%37.1192 （5）第五地：遠離十二法
（1）「云何菩薩遠離親白衣？」
「菩薩出家所生，從一佛界#49.146至一佛界，常出家、剃頭、著染衣，是名遠離親白衣。」
（2）「云何菩薩遠離比丘尼？」
「不共比丘尼住，乃至彈指頃亦不生念，是名遠離比丘尼。」#49.147
（3）「云何菩薩遠離慳#49.148惜#49.149他家？」
「菩薩如是思惟：我應安樂眾生，他今助我安樂，云何生慳？是名遠離慳惜他家。」#49.150
（4）「云何菩薩遠離無益談處#49.151？」
「若有談處，或生聲聞、辟支佛心，我當遠離，是名遠離無益談處。」
（5）「云何菩薩遠離瞋恚？」
「不令瞋心、惱心、鬪心得入，是名遠離瞋恚。」#49.152
（6）「云何菩薩遠離自大？」
「所謂不見內法故，是名遠離自大。」
（7）「云何菩薩遠離蔑人？」
「所謂不見外法故，是名遠離蔑人。」#49.153
（8）「云何菩薩遠離十不善道？」
~1401「是十不善道能障八聖道，何況阿耨多羅三藐三菩提！是名遠離十不善道。」
（9）「云何菩薩遠離大慢？」
「是菩薩不見法可作大慢者，是名遠離大慢。」#49.154
（10）「云何菩薩遠離自用？」
「是菩薩不見是法可自用者，是名遠離自用。」
（11）「云何菩薩遠離顛倒？」
「顛倒處不可得故，是名遠離顛倒。」
（12）「云何菩薩遠離婬、怒、癡？」
「婬、怒、癡處不可見故，是名遠離婬、怒、癡處。
是為菩薩住五地中遠離十二法。」
%37.1193 （6）第六地
%37.1194 A、具足六法
「云何菩薩住六地中具足六法？」
「所謂六波羅蜜。諸佛及聲聞、辟支佛，住六波羅蜜中，能度彼岸，是名具足六法。」
%37.1195 B、遠離六法
（1）「云何菩薩不作聲聞、辟支佛@t25p413c意？」
「作是念：聲聞、辟支佛意，非阿耨多羅三藐三菩提道。」
（2）「云何菩薩布施不生憂心？」
「作是念：此非阿耨多羅三藐三菩提道。」
（3）「云何菩薩見有所索#49.155心不沒？」
「作是念：此非阿耨多羅三藐三菩提道。」
（4）「云何菩薩所有物布施？」
「菩薩初發心時布施，不言#49.156是可與是不可與。」
（5）「云何菩薩布施之後心不悔？」
「慈悲力故。」
（6）「云何菩薩不疑深法？」
「信#49.157功德力故。
是為菩薩住六地中遠離六法。」
^50.1
%37.1254 （7）第七地：不應著二十法，應具足滿二十法
%37.1255 A、不應著二十法
「云何菩薩（1）不著我？」
「畢竟無我故。」
「云何菩薩（2）不著眾生、（3）不著壽命、（4）不著眾數，乃至知者、見者？」
「是諸法畢竟不可得故。」
「云何菩薩（5）不著斷見？」
「無有法斷，諸法畢竟不生故。」
「云何菩薩（6）不著常見？」
「若法不生，是不作常。」
「云何菩薩（7）不應取相？」
「無諸煩惱故。」#50.1
「云何菩薩（8）不應作因見？」
「諸見不可得故。」#50.2
「云何菩薩（9）不著名色？」
「名色處相無故。」
「云何菩薩（10）不著五眾、（11）不著十八界、（12）不著十二入#50.3？」
「是諸法性無故。」
「云何菩薩（13）不著三界？」
「三界性無故。」
「云何菩薩（14）不應作著心？云何菩薩（15）不應作願？云何菩薩（16）不應作依止？」
「是諸法性無故。」
「云何菩薩（17）不著依佛見？」
「作依見，不見佛故。」#50.4
~1413「云何菩薩（18）不著依法見？」
「法不可見故。」
「云何菩薩（19）不著依僧見？」
「僧相無為，不可依故。」
「云何菩薩（20）不著依戒見？」
「罪、無罪不著故。
是為菩薩住七地中，二十法所不應著。」
%37.1256 B、應具足滿二十法
「云何菩薩應（1）具足空？」
「具足諸法自相空故。」
「云何菩薩（2）無相證？」
「不念諸相故。」
「云何菩薩（3）知無作？」
「於三界中不作故。」#50.5
「云何菩薩（4）三分清淨？」
「十善道具足故。」
「云何菩薩（5）一切眾生中慈悲智具足？」
「得大悲故。」
「云何菩薩（6）不念一切眾生？」
「淨佛#50.6世界具足故。」#50.7
「云何菩薩（7）一切法等觀？」
「於諸法不損益故。」
「云何菩薩（8）知諸法實相？」
「諸法實相無知故。」#50.8
「云何菩薩（9）無生忍？」
「為諸法@t25p416c不生不滅、不作故#50.9。」
~1414「云何菩薩（10）無生智？」
「知名色不生故。」#50.10
「云何菩薩（11）說諸法一相？」
「心#50.11不行#50.12二相故。」#50.13
「云何菩薩（12）破分別相？」
「一切法不分別故。」#50.14
「云何菩薩（13）轉憶想#50.15？」
「小、大、無量想#50.16轉故。」#50.17
「云何菩薩（14）轉見？」
「於聲聞、辟支佛地見轉故。」#50.18
「云何菩薩（15）轉煩惱？」
「斷諸煩惱故。」#50.19
「云何菩薩（16）等定慧地？」
「所謂得一切種智故#50.20。」#50.21
「云何菩薩（17）調意#50.22？」
「於三界不動故。」#50.23
~1415「云何菩薩（18）心寂滅？」
「制六根故。」
「云何菩薩（19）無礙智？」
「得佛眼故。」
「云何菩薩（20）不染愛？」
「捨六塵故。
是為菩薩住七地中，具足二十法。」
%37.1257 （8）第八地：應具足二類五法
%37.1258 A、初五法應具足
「云何菩薩（1）順入眾生心？」
「菩薩以一#50.24心知一切眾生心及心數法。」
「云何菩薩（2）遊戲諸神通？」
「以是神通從一佛國#50.25至一佛國，亦不作佛國想。」
「云何菩薩#50.26（3）觀諸佛國？」
「自住其國，見無量諸佛國，亦無佛國想。」
「云何菩薩（4）如所見佛國，自莊嚴其國？」
「住轉輪聖王地，遍至三千大千世界以自莊嚴。」#50.27
「云何菩薩（5）如實觀佛身？」
「如實觀法身故。
是為菩薩住八地中具足五#50.28法。」
%37.1259 B、次五法應具足
「云何菩薩（1）知上下諸根？」
「菩薩住佛十力，知一切眾生上下諸根。」
「云何菩薩（2）淨佛世界？」
「淨眾生故。」
「云何菩薩（3）如幻三昧？」
「住是三昧，能成辦一切事，亦不生心相。」
~1416「云何菩薩（4）常入三昧？」
「菩薩得報生三昧故。」
「云何菩薩（5）隨眾生所應善根受身？」
「菩薩知眾生所應生善根而#50.29為受身，成就眾生故。
是為菩薩住八地中，具足五法。」
%37.1260 （9）第九地：應具足十二法
「云何菩薩（1）受無邊#50.30世界所度之分？」
「十方無量世界#50.31中眾生，如諸佛法所應度者而度脫之。」
「云何菩薩（2）得如所願？」
「六波羅蜜具足故。」
「云何菩薩@t25p417a（3）知諸天、龍、夜叉、犍闥婆#50.32語#50.33？」
「辭辯#50.34力故。」
「云何菩薩（4）胎生成就？」
「菩薩世世常化生故。」#50.35
「云何菩薩（5）家成就？」
「常在大家生故。」
「云何菩薩（6）所生成就？」
「若剎利家生，若婆羅門家生故。」
~1417「云何菩薩（7）性#50.36成就？」
「如過去菩薩所生姓，從此中生故。」#50.37
「云何菩薩（8）眷屬成就？」
「純諸菩薩摩訶薩為眷屬故。」
「云何菩薩（9）出生成就？」
「生時光明遍照無量無邊世界，亦不取相故。」#50.38
「云何菩薩（10）出家成就？」
「出家時，無量百千億諸天侍從出家，是一切眾生必#50.39至三乘。」
「云何菩薩（11）莊嚴佛樹成就？」
「是菩提樹以黃金為根，七寶為莖、節、枝、葉，莖、節、枝、葉光明，遍照十方阿僧祇三千大千世界。」
「云何菩薩（12）一切諸善#50.40功德成滿具足？」
「菩薩得眾生清淨，佛國亦淨#50.41。#50.42
是為菩薩住九地中具足十二法。」
%37.1261 （10）第十地#50.43
「云何菩薩住十地中當知如佛？」
%37.1262 A、約菩薩十地，當知如佛
「若菩薩摩訶薩具足六波羅蜜、四念處乃至十八不共法，一切種智具足滿#50.44，斷一切煩惱及習；是為#50.45菩薩摩訶薩住十地中當知如佛。#50.46
~1418
%37.1263 B、約三乘共地，第十地即是佛地
須菩提！菩薩摩訶薩住是十地中，以方便力故，行六波羅蜜，行四念處乃至十八不共法，過乾慧地、性地、八忍#50.47地、見地、薄地、離欲地、已作地、辟支佛地、菩薩地，過是九地，住於佛地。是為菩薩十地。#50.48
%37.1264 （三）總結
如是，須菩提！是名#50.49菩薩摩訶薩大乘發趣。」
^50.2
%37.1345 三、答第三問：是乘發何處，是乘至何處#50.150
%37.1346 （一）正明：大乘從三界中出，至薩婆若中住
佛告須菩提：「汝所問『是乘何處出，至何處住』#50.151者，佛言：是乘從三界中出，至薩婆若中住，以不二法故。何以故？摩訶衍、薩婆若，是二法共，不合、不散，無色、無形、無對，一相所謂無相。#50.152
%37.1347 （二）舉例：若欲使諸法出，即欲使無相法出
%37.1348 1、舉實際等無為法為類
若人欲使實際出，是人為欲使無相法出；若人欲使如、法性、不可思議性出，是人為欲使無相法出。#50.153
%37.1349 2、舉蘊、入、受等空相為類
若人欲使色空出，是人#50.154為欲使無#50.155相法出；若人欲使受、想、行、識空出，是人為欲使無相法出。何以故？須菩提！色空相不出三界，亦不住薩婆若；受、想、行、識空相不出三界，亦不住薩婆若。所以者何？色、色相空，受......想......行......，識、識相空故。
若人欲使眼空出，是人為欲使無相法出；若人欲使耳、鼻、舌、身、意空出，是人為欲使無相法出；若人欲使乃至意觸因緣生受空出，是人為欲使無相法出。何以故？須菩提！眼空不出三界，亦不住薩婆若；乃至@t25p420a意觸因緣生受空不出三界，亦不住薩婆若。所以者何？眼、眼相空，乃至意觸因緣生受、意觸因緣生受相空故。
~1431
%37.1350 3、舉夢等六事空為類
若人欲使夢出，是人為欲使無相法出；若人欲使幻、焰、響、影、化出，是人為欲使無相法出。何以故？須菩提！夢相不出三界，亦不住薩婆若；幻、焰、響、影、化相亦不出三界，亦不住薩婆若。#50.156
%37.1351 4、舉大小乘因行空為類
須菩提！若人欲使檀波羅蜜出，是人為欲使無相法出；若人欲使尸羅波羅蜜、羼提波#50.157羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜出，是人為欲使無相法出。何以故？檀波羅蜜相不出三界，亦不住薩婆若；尸羅波羅蜜乃至般若波羅蜜#50.158不出三界，亦不住薩婆若。所以者何？檀波羅蜜、檀波羅蜜相空，尸羅波羅蜜......羼提波羅蜜......毘梨耶波羅蜜......禪波羅蜜......，般若波羅蜜、般若波羅蜜相空故。
若人欲使內空出乃至無法有法空出，是人為欲使無相法出。何以故？須菩提！內空相乃至無法有法空相，不出三界，亦不住薩婆若。所以者何？內空、內空性空，乃至無法有法空、無法有法空性空故。
若人欲使四念處出，是人為欲使無相法出。何以故？四念處性不出三界，亦不住薩婆若。所以者何？四念處#50.159、四念處性空故。若人欲使四正勤、四如意足、五根、五力、七覺分、八聖道分出，是人為欲使無相法出。何以故？八聖道分性，不出三界，亦不住薩婆若。所以者何？八聖道分#50.160、八聖道分性空故。乃至十八不共法亦如是。
%37.1352 5、舉大小乘果空為類
須菩提！若人欲使阿羅漢出生處，是人為欲使無相法出；若人欲使辟支佛出生處，是@t25p420b人為欲使無相法出；若人欲使多陀阿伽度、阿羅訶、三藐三佛陀出生處，是人為欲使無相法出。何以故？須菩提！阿羅漢性、辟支佛性、佛性不出三界，亦不住薩婆若。所以者何？阿羅漢#50.161、阿羅漢性空，辟支佛#50.162、辟支佛性空，佛#50.163、佛性空故。若人欲使須陀洹果、斯陀含果、阿那含果、阿羅漢果、辟支佛道#50.164、佛道、一切種智出，是人為欲使無相法出，如上說。
~1432
%37.1353 6、舉但名字等空為類
若人欲使名字、假名、施設、相、但有語言出，是人為欲使無相法出。何以故？名字空，不出三界，亦不住薩婆若。所以者何？名字相，名字相空故，乃至施設亦如是。#50.165
%37.1354 7、舉不生不滅等法性空為類
若人欲使不生不滅法、不垢不淨、無作法出，是人為欲使無相法出。何以故？不生乃至無作法性不出三界，亦不住薩婆若。所以者何？不生性乃至無作性#50.166性空故。#50.167
%37.1355 （三）結
須菩提！以是因緣故，摩訶衍從三界中出，至#50.168薩婆若中住，不動法#50.169故。#50.170
^50.3
%37.1380 四、答第四問：是乘當住何處#50.191
%37.1381 （一）標宗：明無住而住
須菩提！汝所問『是乘何處住』者，須菩提！是大乘無住處。何以故？一切法無住相故。是乘若住，不住法住。#50.192
%37.1382 （二）舉喻
須菩提！譬如法性，不生不滅、不垢不淨、無起#50.193無作，非住非不住。
%37.1383 （三）合法
須菩提！是乘亦如是，非住非不住。#50.194
~1436
%37.1384 （四）釋理
何以故？法性相乃至無作相#50.195，非住非不住。所以者何？法性相#50.196性空故，乃至無作#50.197性、無作#50.198性性空故。諸餘法亦如是。
%37.1385 （五）結成
須菩提！以是因緣故，是乘無住處#50.199，以不住法#50.200、不動法故。#50.201
^50.4
%37.1394 五、答第五問：誰當乘是乘出者#50.208
%37.1395 （一）乘、出者、所用法、出時等諸法空無所有，故無人乘出
須菩提！汝所問『誰當乘是乘出者』#50.209，無有人乘是乘出者。
何以故？是乘及#50.210出者，所用法及出時──是一切法皆無所有；若一切法無所有，用何等法當出？#50.211
%37.1396 （二）明人法二空不可得
何以故？我不可得，乃至知#50.212者、見者不可得，畢竟淨故。
不可思議性不可得，畢竟淨故。
眾#50.213、入、界不可得，畢竟淨故。
檀波羅蜜不可得，畢竟淨故；乃至般若波羅蜜不可得，畢竟淨故。
內空不可得，畢竟淨故；乃至無法有法空不可得，畢竟淨故。
四念處不可得，乃至十八不共法不可得，畢竟淨故。
須陀洹不可得，乃至阿羅漢、辟支佛、菩薩、佛不可得，畢竟淨故。#50.214
須陀洹果，乃至阿羅漢果、辟支佛道、佛道、一切種智不可得，畢竟淨故。
不生不滅，不垢不淨，無起無作不可得，畢竟淨故。
過去世、未來世、現在世，生、住、滅不可得，畢竟淨故。
增、減不可得，畢竟淨故。
%37.1397 （三）釋不可得因緣
%37.1398 1、一切人法不可得故
何法不可得故不可得？法性不可得故不可得，如、實際、不可思議性、法性、法相、~1438法位；檀波羅蜜不可得故@t25p421c不可得，乃至般若波羅蜜不可得故不可得。內空不可得故不可得，乃至無法有法空不可得故不可得。四念處不可得故不可得，乃至十八不共法不可得故不可得#50.215。須陀洹不可得故不可得，乃至佛不可得故不可得。須陀洹果不可得故不可得，乃至佛道不可得故不可得。不生不滅，乃至不起不作不可得故不可得。
復次，須菩提！初地不可得故不可得，乃至第十地不可得故不可得，畢竟淨故。
云何為初地乃至十地？所謂乾慧地、性地、八人地、見地、薄地、離欲#50.216地、已作地、辟支佛地、菩薩地、佛地。
%37.1399 2、十八空中十地、成就眾生、淨佛世界、五眼等皆不可得故
內空中初地不可得，乃至無法有法空中初地不可得；內空乃至無法有法空中，第二、第三、第四、第五、第六、第七、第八、第九、第十地不可得。何以故？須菩提！初地非得非不得，乃至十地非得非不得，畢竟淨故。
內空乃至無法有法空中，成就眾生不可得，畢竟淨故。內空乃至無法有法空中，淨佛世界不可得，畢竟淨故。內空乃至無法有法空中，五眼不可得，畢竟淨故。
%37.1400 （四）結：以不可得故，菩薩乘摩訶衍出薩婆若
如是，須菩提！菩薩摩訶薩，以一切諸法不可得故，乘是摩訶衍出薩婆若。」
^51.1
$$壹、就「三解脫門」說般若（承上卷42～卷44）
$$貳、就「菩薩、摩訶薩」說般若（承上卷44～卷46）
$$參、就「摩訶衍義」說般若#51.1（承上卷44～卷52）
$$（壹）須菩提問摩訶衍等五義（承上卷46）
$$（貳）佛答摩訶衍等五義（承上卷46～卷50）
%37.1413 （參）須菩提以勝出等五義稱歎摩訶衍
%37.1414 一、勝出歎
慧命須菩提白佛言：「世尊！摩訶衍#51.2、摩訶衍者，勝出#51.3一切世間及諸天、人、阿修羅。
%37.1415 二、等空歎
世尊！是摩訶衍與#51.4虛空等。
%37.1416 三、含受歎
如虛空受無量無邊阿僧祇眾生，摩訶衍亦如是受無量無邊阿僧祇眾生。#51.5
~1441
%37.1417 四、不見來去住處歎
世尊！是摩訶衍不見來處，不見去處，不見住處。#51.6
%37.1418 五、三世等歎
是摩訶衍前際不可得、後際不可得、中際不可得，三世等是摩訶衍。
世尊！以@t25p422b是故，是乘名摩訶衍。」
%37.1419 （肆）佛述成，並廣述勝出等五歎
%37.1420 一、略說摩訶衍相
佛告須菩提：「如是！如是！菩薩#51.7摩訶薩摩訶衍，所謂六波羅蜜：檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜，是名菩薩摩訶薩摩訶衍。
復次，須菩提！菩薩摩訶薩摩訶衍，所謂#51.8一切陀羅尼門、一切三昧門，所謂首楞嚴三昧乃至離著虛空不染三昧，是名菩薩摩訶薩摩訶衍。
復次，須菩提！菩薩摩訶薩摩訶衍，所謂內空乃至無法有法空，是名菩薩摩訶薩摩訶衍。
復次，須菩提！菩薩摩訶薩摩訶衍，所謂四念處乃至十八不共法，是名菩薩摩訶薩摩訶衍。
%37.1421 二、廣述勝出等五歎
%37.1422 （一）勝出歎
%37.1423 1、總相說摩訶衍勝出
如須菩提所言：『是摩訶衍勝出一切世間及諸天、人、阿修羅。』#51.9
%37.1424 （1）有為法非實故
%37.1425 A、三界非實故
須菩提！若欲界當有實、不虛妄、不異、諦、不顛倒、有常、不壞相、非無法者，是摩訶衍不能勝出一切世間及諸天、人、阿修羅；須菩提！以欲界虛妄憶想分別、和合名字等有、一切無常相、無法，以是故，摩訶衍勝出一切世間及諸天、人、阿修羅。#51.10
~1442須菩提！色界、無色界若當實有、不虛妄、不異、諦、不顛倒、有常、不壞相、非無法者，是摩訶衍不能勝出一切世間及諸天、人、阿修羅；須菩提！以色界、無色界虛妄憶想分別、和合名字等有、一切無常、破壞相、無法，以是故，摩訶衍勝出一切世間及諸天、人、阿修羅。
%37.1426 B、五蘊、六根、六塵、六識、六觸、六受非實故
須菩提！若色當實有、不虛妄、不異、諦、不顛倒、有常、不壞相、非無法者，是摩訶衍不能勝出一切世間及諸天、人、阿修羅；須菩提！以色虛妄憶想分別、和合名字等有、一切無常、破壞相、無法，以是故，是摩訶衍勝出一切世間及諸天、人、阿修羅。
受、想、行、識@t25p422c亦如是。
須菩提！若眼乃至意、色乃至法、眼識乃至意識、眼觸乃至意觸、眼觸因緣生受乃至意觸因緣生受，若當實有、不虛妄、不異、諦、不顛倒、有常、不壞相、非無法者，是摩訶衍不能勝出一切世間及諸天、人、阿修羅。須菩提！以眼#51.11乃至意觸因緣生受，虛妄憶想分別、和合名字等有、一切無常、破壞相、無法，以是故，摩訶衍勝出一切世間及諸天、人、阿修羅。
%37.1427 （2）法性等無為法非實故
須菩提！若法性是有法、非無法者，是摩訶衍不能勝出#51.12一切世間及諸天、人、阿修羅；須菩提！以法性無法、非法，以是故，摩訶衍勝出一切世間及諸天、人、阿修羅。#51.13
須菩提！若如、實際、不可思議性是有法、非無法者，是摩訶衍不能勝出一切世間及諸天、人、阿修羅；須菩提！以#51.14如、實際、不可思議性無法、非法；以是故，摩訶衍勝出一切世間及諸天、人、阿修羅。
%37.1428 （3）六度等法非實故
%37.1429 A、六度非實故
須菩提！若檀波羅蜜是有法、非無法者，是摩訶衍不能勝出一切世間及諸天、人、阿修羅；以檀波羅蜜無法#51.15、非法，以是故，摩訶衍勝出一切世間及諸天、人、阿修羅。
若尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜是有法、非無法者，是摩訶衍不能勝出一切世間及諸天、人、阿修羅；以尸羅波羅蜜乃至般若波羅蜜無法、非法，以是故，摩訶衍勝出一切世間及諸天、人、阿修羅。
~1443
%37.1430 B、十八空非實故
須菩提！若內空乃至無法有法空是有法、非無法者，是摩訶衍不能勝出一切世間及諸天、人、阿修羅；以內空乃至無法有法空無法、非法，以是故，摩訶衍勝出一切世間及諸天、人、阿修羅。#51.16
%37.1431 C、三十七道品乃至十八不共法非實故
須菩提！若四念處乃至十八不共法是有法、非無法者，是摩訶衍不能勝出一切世間及諸天、人、阿修羅；以四念處乃至十八不共法無法、非法，以是故，摩訶衍勝出一切世間及諸天、人、阿修羅。
%37.1432 D、性人法乃至佛法非實故
須菩@t25p423a提！若性人法#51.17是有法、非無法者，是摩訶衍不能勝出一切世間及諸天、人、阿修羅；以性人法無法、非法，以是故，摩訶衍勝出一切世間及諸天、人、阿修羅。
須菩提！若八人法、須#51.18陀洹法、斯陀含法、阿那含法、阿羅漢法、辟支佛法、佛法是有法、非無法者，是摩訶衍不能勝出一切世間及諸天、人、阿修羅；以八人法乃至佛法無法、非法，以是故，摩訶衍勝出一切世間及諸天、人、阿修羅。#51.19
%37.1433 E、性人乃至佛非實故
須菩提！若性人是有法、非無法者，是摩訶衍不能勝出一切世間及諸天、人、阿修羅；以性人無法、非法；以是故，摩訶衍勝出一切世間及諸天、人、阿修羅。
~1444須菩提！若八人、須陀洹乃至佛是有法、非無法者，是摩訶衍不能勝出一切世間及諸天、人、阿修羅；以八人乃至佛無法、非法，以是故，摩訶衍勝出一切世間及諸天、人、阿修羅。
%37.1434 F、一切世間及諸天、人、阿修羅非實故
須菩提！若一切世間及諸天、人、阿修羅是有法、非無法者，是#51.20摩訶衍不能勝出一切世間及諸天、人、阿修羅；以一切世間及諸天、人、阿修羅無法、非法，以是故，摩訶衍勝出一切世間及諸天、人、阿修羅。
%37.1435 G、菩薩初發心乃至坐道場間諸心非實故
須菩提！若菩薩摩訶薩從初發心乃至道場，於其中間諸心，若當是#51.21有法、非無法者，是摩訶衍不能勝出一切世間及諸天、人、阿修羅；以菩薩從初發心乃至道場諸心無法、非法，以是故，摩訶衍@t25p423b勝出一切世間及諸天、人、阿修羅。
%37.1436 H、如金剛慧非實故
須菩提！若菩薩摩訶薩如金剛慧若是有法、非無法者，是菩薩摩訶薩不能知一切結使及習無法、非法，得一切種智；須菩提！以菩薩摩訶薩如金剛慧無法、非法，是故菩薩知一切結使及習無法、非法，得一切種智，以是故，摩訶衍勝出一切世間及諸天、人、阿修羅。#51.22
%37.1437 2、別相說
%37.1438 （1）諸佛三十二相非實故
須菩提！若諸佛三十二相是有法、非無法者，諸佛威德不能照然、勝出一切世間及諸天、人、阿修羅；須菩提！以諸佛三十二相無法、非法，以是故，諸佛威德照然，勝出一切世間及諸天、人、阿修羅。
%37.1439 （2）諸佛光明非實故
須菩提！若諸佛光明是有法、非無法者，諸佛光明不能普照恒河沙等世界；須菩提！以諸佛光明無法、非法，以是故，諸佛能以光明普照恒河沙等世界。
%37.1440 （3）諸佛音聲非實故
須菩提！若諸佛六十種莊嚴音聲是有法、非無法者，諸佛不能以六十種莊嚴音聲遍至十方無量阿僧祇世界；須菩提！以諸佛六十種莊嚴音聲無法、非法，以是故，諸佛能以六十種莊嚴音聲遍至十方無量阿僧祇世界。
%37.1441 （4）諸佛轉法輪度眾生非實故
須菩提！諸佛法輪若是有法、非無法者，諸佛不能轉法輪──諸沙門、婆羅門、~1445若天、若魔、若梵及世間餘眾所不能如法轉者；#51.23須菩提！以諸佛法輪無法、非法，以是故，諸佛轉法輪──諸沙門、婆羅門、若天、若魔、若梵及世間餘眾所不能如法轉者。
須菩提！諸佛為眾生轉法輪，是眾生若實有法、非無法者，不能令是眾生於無餘涅槃而般涅槃；須菩提！以諸佛為眾生轉法輪，是眾生無法、非法，以是故，眾生#51.24於無餘涅槃中已滅、今滅、@t25p423c當滅。」#51.25
^51.2
%37.1483 （二）等空歎
%37.1484 1、佛印成，並廣述虛空及摩訶衍無種種相
佛告須菩提：「汝所言：『衍與空等。』如是！如是！須菩提！摩訶衍與空等。
%37.1485 （1）無十方相
須菩提！如虛空無東方，無南方西方北方、四維、上下；須菩提！摩訶衍亦如是，無東方，無南方西方北方、四維、上下。
%37.1486 （2）非形色相
須菩提！如虛空非長非短、非方非圓；須菩提！摩訶衍亦如是，非長非短、非方非圓。
%37.1487 （3）非顯色相
須菩提！如虛空非青、非黃、非赤、非白、非黑；摩訶衍亦如是，非青、非黃、非赤、非白、非黑。
以是故說摩訶衍與空等。
%37.1488 （4）非三世相
須菩提！如虛空非過去、非未來、非現在；摩訶衍亦如是，非過去、非未來、非現在。
以是故說摩訶衍與空等。
%37.1489 （5）無增減垢淨生滅相
須菩提！@t25p424c如#51.49虛空不增不減；摩訶衍亦如是，不增不減。
須菩提！如虛空無垢無淨；摩訶衍亦如是，無垢無淨。
須菩提！如虛空無生、無滅、無住、無異；摩訶衍亦如是，無生、無滅、無住、無異。
~1450
%37.1490 （6）非三性相
須菩提！如虛空非善非不善、非記非無記；摩訶衍亦如是，非善非不善、非記非無記。
以是故說摩訶衍與空等。
%37.1491 （7）無見聞覺知相
如虛空無見、無聞、無知#51.50、無識；摩訶衍亦如是，無見、無聞、無知、無識。
%37.1492 （8）非知斷證修相
如虛空不可知、不可識、不可見、不可斷、不可證、不可修；摩訶衍亦如是，不可知、不可識#51.51、不可見、不可斷、不可證、不可修。#51.52
以是故說摩訶衍與空等。
%37.1493 （9）非染離相
如虛空非染相、非離相；摩訶衍亦如是，非染相、非離相。#51.53
%37.1494 （10）非界繫相
如虛空不繫欲界、不繫色界、不繫無色界；摩訶衍亦如是，不繫欲界、不繫色界、不繫無色界。
%37.1495 （11）無菩薩十心相
如虛空無初發心，亦無二、三、四、五、六、七、八、九、第十心；摩訶衍亦如是，無初發心，乃至無#51.54第十心。
%37.1496 （12）無三乘共地相
如虛空無乾慧地、姓#51.55地#51.56、八人地、見地、薄地、離欲地、已辦#51.57地；摩訶衍亦如是，無乾慧地乃至#51.58已作地。#51.59
~1451
%37.1497 （13）無聲聞四果相
如虛空無須陀洹果、無斯陀含果、無阿那含果、無阿羅漢果；摩訶衍亦如是，無須陀洹果乃至無#51.60阿羅漢果。
%37.1498 （14）無三乘地相
如虛空無聲聞地、無辟支佛地、無佛地；摩訶衍亦如是，無聲聞地乃至無佛地。以是故說摩訶衍與空等。
%37.1499 （15）非色非無色等相
如虛空非色非無色、非可見非不可見、非有對非無對、非合非散；摩訶衍亦如是，非色非無色、非可見非不可見、非有對非無對、非合非散。以是故說摩訶衍與空等。#51.61
%37.1500 （16）非常非無常等相
須菩提！如虛空非常非無常、非樂非苦、非我非無我；摩訶衍亦如是，非常非無常、非樂#51.62非@t25p425a苦#51.63、非我非無我。以是故說摩訶衍與空等。
%37.1501 （17）非空非不空等相
須菩提！如虛空非空非不空、非相非無相、非作非無作；摩訶衍亦如是，非空非不空、非相非無相、非作非無作。以是故說摩訶衍與空等。
%37.1502 （18）非滅離非不滅離相
須菩提！如虛空非寂滅非不寂滅、非離非不離；摩訶衍亦如是，非寂滅非不寂滅、非離非不離。以是故說摩訶衍與空等。
%37.1503 （19）非闇非明相
須菩提！如虛空非闇、非明；摩訶衍亦如是，非闇、非明。以是故說摩訶衍與空等。
%37.1504 （20）非得非不得相
須菩提！如虛空非可得、非不可得；摩訶衍亦如是，非可得、非不可得。以是故說摩訶衍與空等。
%37.1505 （21）非可說非不可說相
須菩提！如虛空非可說、非不可說；摩訶衍亦如是，非可說、非不可說。以是故說摩訶衍與空等。
%37.1506 2、結歎
須菩提！以是諸因緣故說摩訶衍與空等。
^51.3
%37.1517 （三）含受歎
%37.1518 1、佛印可須菩提所說，並總相說一切法空故能含受
%37.1519 （1）佛印可
~1453須菩提！如汝所言：『如虛空受無量無邊阿僧祇眾生，摩訶衍亦受無量無邊阿僧祇眾生。』
%37.1520 （2）總相說一切法空故能含受
%37.1521 A、眾生、虛空、摩訶衍無所有故
如是！如是！須菩提！眾生無所有故，當知虛空無所有；虛空無所#51.67有故，當知摩訶衍亦無所有。以是因緣故，摩訶衍受無量無邊阿僧祇眾生。
何以故？是眾生、虛空、摩訶衍──是法皆不可得故。
%37.1522 B、摩訶衍、阿僧祇、無量、無邊無所有故，一切法無所有
復次，須菩提！摩訶衍無所有故，當知阿僧祇無所有；阿僧祇無所有故，當知無量無所有；無量無所有故，當知無邊無所有；無邊無所有故，當知一切諸法無所有。以是因緣故，須菩提！是摩訶衍受無量無邊阿僧祇眾生。
何以故？是眾生、虛空、摩訶衍、阿僧祇、無量、無邊──是一切法不可得故。#51.68
%37.1523 2、別說諸法空故能含受
%37.1524 （1）如、法性、實際等皆不可得
復次，須菩提！我無所有乃至知者、見者無所有故，當知如、法性、實際無所有；如、法性、實際無所有故，當知乃至無量、無邊、阿僧祇無所有；無量、無邊、阿僧祇無所有故，當知一切法無所有。以是因緣故，須菩提！摩訶衍受無量無邊阿僧祇眾生。何以故？是眾生乃至知者、見者，實際乃至無量、無邊、阿僧祇──是一切法不可得故。#51.69
%37.1525 （2）不可思議性、五蘊等皆不可得
復次，須菩提！我無所有乃至知者、見者無所有故，當知不可思議性無所有；不可思議性無所有故，當知色、受、想、行、識無所有；色、受、想、行、識無所有故，當知虛空無所有；虛空無所有故，當知摩訶衍無所有；摩訶衍無所有故，當知阿僧祇無所有；阿僧祇無所有故，當知無量無所有；無量無所有故，當知無邊@t25p425c無所有；無邊無所有故，當知一切諸法無所有。以是因緣故，須菩提！~1454當知摩訶衍受無量無邊阿僧祇眾生。何以故？須菩提！我乃至知者、見者等一切法皆不可得故。
%37.1526 （3）六入等皆不可得
復次，須菩提！我無所有乃至知者、見者無所有故，當知眼無所有，耳、鼻、舌、身、意無所有；眼乃至意無所有故，當知虛空無所有；虛空無所有故，當知摩訶衍無所有；摩訶衍無所有故，當知阿僧祇無所有；阿僧祇無所有故，當知無量無所有；無量無所有故，當知無邊無所有；無邊無所有故，當知一切諸法無所有。以是因緣故，須菩提！摩訶衍受無量無邊阿僧祇眾生。何以故？須菩提！我乃至一切諸法皆不可得故。
%37.1527 （4）六度等法皆不可得
復次，須菩提！我無所有乃至知者、見者無所有故，當知檀波羅蜜無所有，尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜無所有；般若波羅蜜無所有故，當知虛空無所有；虛空無所有故，當知摩訶衍無所有；摩訶衍無所有故，當知無量無邊阿僧祇無所有；無量無邊阿僧祇無所有故，當知一切諸法無所有。以是因緣故，須菩提！摩訶衍受無量無邊阿僧祇眾生。何以故？我、眾生乃至一切諸法皆不可得故。
%37.1528 （5）十八空等皆不可得
復次，須菩提！我無所有乃至知者、見者無所有故，當知內空無所有，乃至無法有法空無所有；無法有法空無所有故，當知虛空無所有；虛空無所有故，當知摩訶衍無所有；摩訶衍無所有故，當知阿僧祇、無量、無邊無所有；阿僧祇、無量、無邊無所有故，當知一切諸法無所有。以是因緣故，須@t25p426a菩提！摩訶衍受無量無邊阿僧祇眾生。何以故？我、眾生乃至一切諸法皆不可得故。
%37.1529 （6）四念處乃至十八不共法等皆不可得
復次，須菩提！我、眾生乃至知者、見者無所有故，當知四念處無所有；四念處無所有故，乃至十八不共法無所有；十八不共法無所有故，當知虛空無所有；虛空無所有故，當知摩訶衍無所有；摩訶衍無所有故，當知阿僧祇、無量、無邊無所有；阿僧祇、無量、無邊無所有故，當知一切諸法無所有。以是因緣故，須菩提！是摩訶衍受無量無邊阿僧祇眾生。何以故？我、眾生乃至一切諸法皆不可得故。
%37.1530 （7）性地乃至已作地等皆不可得
復次，須菩提！我、眾生無所有乃至知者、見者無所有故，當知性地#51.70無所有，乃至已作地無所有；已作地無所有故，當知虛空無所有；虛空無所有故，當知摩訶衍無所有；摩訶衍無所有故，當知阿僧祇、無量、無邊無所有；阿僧祇、無量、無邊無所有故，當知一切諸法無所有。以是因緣故，是摩訶衍受無量無邊阿僧祇眾生。何以故？我、眾生乃至一切諸法皆不可得故。
~1455
%37.1531 （8）四果聖者等皆不可得
復次，須菩提！我、眾生乃至知者、見者無所有故，當知須陀洹無所有；須陀洹無所有故，當知斯陀含無所有；斯陀含無所有故，當知阿那含無所有；阿那含無所有故，當知阿羅漢無所有；阿羅漢無所有故，當知乃至一切諸法無所有。以是因緣故，須菩提！摩訶衍受無量無邊阿僧祇眾生。何以故？須菩提！我乃至一切諸法皆不可得故。
%37.1532 （9）三乘乃至一切種智等皆不可得
復次，須菩提！我乃至知者、見者無所有故，當知聲聞乘無所有；聲聞乘無所有故，當知辟支佛乘無所有；辟支佛@t25p426b乘無所有故，當知佛乘無所有；佛乘無所有故，當知聲聞人無所有；聲聞人無所有故，當知須陀洹無所有；須陀洹無所有故，乃至佛無所有；佛無所有故，當知一切種智無所有；一切種智無所有故，當知虛空無所有；虛空無所有故，當知摩訶衍無所有；摩訶衍無所有故，當知乃至一切諸法無所有。以是因緣故，摩訶衍受無量無邊阿僧祇眾生。何以故？我乃至一切諸法皆不可得故。
%37.1533 （10）舉涅槃為喻
譬如，須菩提！涅槃性中受無量無邊阿僧祇眾生，是摩訶衍亦受無量無邊阿僧祇眾生。
%37.1534 3、結成
以是因緣故，須菩提！如虛空受無量無邊阿僧祇眾生，是摩訶衍亦如是受無量無邊阿僧祇眾生。
^51.4
%37.1569 （四）不見來去住處歎
%37.1570 1、佛印可須菩提所說摩訶衍無來、無去、無住，並總說一切法亦無來、無去、無住
須菩提！汝所言：『是摩訶衍不見來處、不見去處、不見住處。』
如是！如是！須菩提！是摩訶衍不見來處、不見去處、不見住處。
何以故？須菩提！一切諸法不動相故，是法無來處、無去處、無住處。#51.91
%37.1571 2、別觀諸法之五事明無來、無去、無住
%37.1572 （1）舉五蘊說
何以故？須菩提！色，無所從來，亦無所去，亦無所住；受、想、行、識，無所從來，亦無所去，亦無所住。#51.92
須菩提！色法，無所從來，亦無所去，亦無所住；受、想、行、識法，無所從來，亦無所去，亦無所住。#51.93
須菩提！色如#51.94，無所從來，亦無所去，亦無所住；受、想、行、識如，無所從來，亦無所去，亦無所住。#51.95
須菩提！色性，無所從來，亦無所去，亦無所住；受、想、行、識性，無所從來，亦無所去，亦無所住。#51.96
須菩提！色相，無所從來，亦無所去，亦無所住；受、想、行、識相，無所從來，亦無所去，亦無所住。#51.97
%37.1573 （2）舉六根、六塵、六大說
須菩提！眼、眼法、眼如、眼性、眼相，無所從來，亦無所去，亦無所住；耳......鼻......舌......身......；意、意法、意如、意性、意相，無所從來，亦無所去，亦無所住。
~1460色、聲、香、味、觸、法亦如是。
須菩提！地種、地種法、地種如、地種性、地種相，無所從來，亦無所去，亦無所住；水......火......風......空......；識種、識種法、識種如、識種性、識種相亦如是。
%37.1574 （3）舉如、實際、不可思議說
須菩提！如、如法#51.98、如如#51.99、如性#51.100、如相，無所從來，亦無所去，亦無所住。
須菩提！實際、實際法、實際如、實際性、實際相，無所從來，亦無所去，亦無所住。
須菩提！不可思議、不可思議法、不可思議如、不可思議性、不可思議相，無所從來，亦無所去，亦無所住。
%37.1575 （4）舉六度、四念處乃至十八不共法說
須菩提！檀波羅蜜、檀波@t25p427c羅蜜法、檀波羅蜜如、檀波羅蜜性、檀波羅蜜相，無所從來，亦無所去，亦無所住；尸羅波羅蜜......羼提波羅蜜......毘梨耶波羅蜜......禪波羅蜜......；般若波羅蜜、般若波羅蜜法、般若波羅蜜如、般若波羅蜜性、般若波羅蜜相，無所從來，亦無所去，亦無所住。
須菩提！四念處、四念處法、四念處如、四念處性、四念處相，無所從來，亦無所去，亦無所住；乃至十八不共法亦如是。
%37.1576 （5）舉菩薩、佛、無上菩提說
須菩提！菩薩、菩薩法、菩薩如、菩薩性、菩薩相，無所從來，亦無所去，亦無所住。
佛、佛法、佛如、佛性、佛相，無所從來，亦無所去，亦無所住。
阿耨多羅三藐三菩提、阿耨多羅三藐三菩提法如性相，無所從來，亦無所去，亦無所住。#51.101
%37.1577 （6）舉有為法、無為法說
須菩提！有為法、有為法法、有為法如、有為法性、有為法相，無所從來，亦無所去，亦無所住。
~1461須菩提！無為法#51.102、無為法法、無為法如、無為法性、無為法相，無所從來，亦無所去，亦無所住。#51.103
%37.1578 3、結歎
以是因緣故，須菩提！是摩訶衍不見來處、不見去處、不見住處。
^51.5
%37.1596 （五）三世等歎
%37.1597 1、佛印可須菩提歎三世不可得，三世等名摩訶衍
須菩提！汝所言：『是摩訶衍，前際不可得，後際不可得，中際不可得，是衍名三世等；以#51.117是故，說名摩訶衍。』如是！如是！須菩提！是摩訶衍，前際不可得，後際不可得，中際不可得，是衍@t25p428b名三世等。以是故說名摩訶衍。
%37.1598 2、廣演三世等為摩訶衍
%37.1599 （1）約法空說三世不可得
何以故？須菩提！過去世、過去世空，未來世、未來世空，現在世、現在世空，三世等、三世等空；摩訶衍、摩訶衍空，菩薩、菩薩空。
何以故？須菩提！是空#51.118非一、非二、非三、非四、非五、非異。
以是故說名三世等是菩薩摩訶薩摩訶衍。#51.119
%37.1600 （2）約空無自性說相待法不可得
是衍中，等、不等相不可得故，染、不染不可得，瞋、不瞋不可得，癡、不癡不可得，慢、不慢不可得，乃至一切善法、不善法不可得。
是衍中，常不可得，無常不可得；樂不可得，苦不可得；實不可得，空不可得；我不可得，無我不可得；欲界不可得，色界不可得，無色界不可得；度欲界不可~1464得，度色界不可得，度無色界不可得。何以故？是摩訶衍自法不可得故。#51.120
%37.1601 （3）約空中空不可得，說三世五蘊不可得
須菩提！過去色、過#51.121去色空，未來現在色、未來現在色空；過去受想行識、過去受想行識空；未來現在受想行識、未來現在受想行識空。
空中過去色不可得。何以故？空中空亦不可得，何況空中過去色可#51.122得！#51.123
空中未來、現在色不可得。何以故？空中空亦不可得，何況空中未來、現在色可得！
空中過去受想行識不可得。何以故？空中空#51.124亦不可得，何況空中過去受想行識可得！
空中未來、現在受想行識不可得。何以故？空中空亦不可得，何況空中未來、現在受想行識可得！
%37.1602 （4）約等中諸法不可得，等亦不可得故，說諸道法不可得
須菩提！過去檀波羅蜜不可得，未來檀波羅蜜不可得，現在檀波羅蜜不可得，三世等中檀波羅蜜亦不可得。何以故？等中過去世不可得、未來世不可得、現在世不可得。等中等亦不可得，何況等中過去世、未來世、現在@t25p428c世可得！#51.125
尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜亦如是。
復次，須菩提！過去世中四念處不可得，乃至過去世中十八不共法不可得；未來世、現在世亦如是。
復次，須菩提！三世等中四念處不可得，三世等中乃至十八不共法亦不可得。
~1465何以故？等中過去世四念處不可得，等中未來世四念處不可得，等中現在世四念處不可得。等中等亦不可得，何況等中過去世四念處、未來現在世四念處可得！等中等亦不可得，何況等中過去乃至十八不共法可得！未來、現在世亦如是。
%37.1603 （5）約眾生空故凡聖不可得
復次，須菩提！過去世中凡夫人不可得，未來世現在世中凡夫人不可得，三世等中凡夫人亦不可得。何以故？眾生不可得，乃至知者、見者不可得故。
過去世中聲聞、辟支佛、菩薩、佛不可得，未來現在世中聲聞、辟支佛、菩薩、佛不可得，三世等中聲聞、辟支佛、菩薩、佛不可得。何以故？眾生不可得，乃至知者、見者不可得故。
%37.1604 3、結勸，顯勝
如是，須菩提！菩薩摩訶薩住般若波羅蜜中，學三世等相，當具足一切種智，是名菩薩摩訶薩摩訶衍，所謂三世等相。
菩薩摩訶薩住是衍#51.126中，勝出#51.127一切世間及諸天、人、阿修羅，成就薩婆若。」#51.128
%37.1605 （伍）舉出生三世諸佛歎摩訶衍
%37.1606 一、須菩提歎：三世菩薩學摩訶衍，得一切種智
爾時，須菩提白佛言：「世尊！善哉！善哉！是菩薩摩訶薩摩訶衍！何以故？過去諸菩薩是衍中學得一切種智，未來世#51.129諸菩薩摩訶薩亦是衍中學當得一切種智，世尊！今十方無量阿僧祇世界中諸菩薩摩訶薩亦是衍中學得一切種智。以是故，世尊！是衍實是菩薩摩訶薩摩訶衍。」
%37.1607 二、如來述歎
佛告須菩提：「如@t25p429a是！如是！過去、未來、現在諸佛，是摩訶衍中學，已得一切種智，當得、今得。」
^52.1
#52.2
%37.1625 （陸）摩訶衍與般若無二無別#52.3
%37.1626 一、富樓那為新學發問，須菩提請佛印證
爾時，慧命富樓那彌多羅尼子白佛言：「世尊！佛使須菩提為諸菩薩摩訶薩說般若波羅蜜，今乃說摩訶衍#52.4為？」
須菩提白佛言：「世尊！我說摩訶衍，將無#52.5離般若波羅蜜？」
%37.1627 二、佛明須菩提所說摩訶衍隨順般若、不離般若
%37.1628 （一）正顯
佛言：「不@t25p429c也！須菩提！汝說摩訶衍，隨般若波羅蜜，不離般若波羅蜜#52.6。
%37.1629 （二）辨隨順般若之因緣
%37.1630 1、三乘善法皆入般若故
何以故？一切所有善法、助道法──若聲聞法、若辟支佛法、若菩薩法、若佛法，是一切法，皆攝入般若波羅蜜中。」#52.7
須菩提白佛言：「世尊！何等諸善法、助道法──聲聞法、辟支佛法、菩薩法、佛法，皆攝入般若波羅蜜中？」
佛告須菩提：「所謂檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜，四念處、四正勤、四如意足#52.8、五根、五力、七覺分、八聖道分，空、無相、無作解脫門，佛十力、四無所畏、四無礙智、大慈大悲、十八不共法、無錯謬相、常捨行。須菩提！是諸餘善法、助道法──若聲聞法、若辟支佛法、若~1469菩薩法、若佛法，皆攝入般若波羅蜜中。
%37.1631 2、摩訶衍與般若等諸法皆同無相故
須菩提！若摩訶衍，若般若波羅蜜、禪波羅蜜、毘梨耶波羅蜜、羼提波羅蜜、尸羅波羅蜜、檀波羅蜜；若色、受、想、行、識，眼、色、眼識、眼觸、眼觸因緣生諸受，乃至意、法、意識、意觸、意觸因緣生諸受；地種乃至識種；四念處乃至八聖道分；空、無相、無作解脫門；及諸善法，若有漏、若無漏，若有為、若無為，若苦諦、集諦、滅諦、道諦，若欲界、若色界、若無色界，若內空乃至無法有法空；諸三昧門、諸陀羅尼門；佛十力乃至十八不共法；若佛、佛法#52.9、法性、如、實際、不可思議性、涅槃──是一切諸法皆不合不散、無色、無形、無對，一相，所謂無相。
須菩提！以是因緣故，汝所說摩訶衍，隨順般若波羅蜜。
%37.1632 3、摩訶衍與般若等諸法無二無別故，說摩訶衍即是說般若
何以故？
須菩提！摩訶衍不異般若波羅蜜，般若波羅蜜不異摩訶衍，般若波羅蜜、摩訶衍無二無別；#52.10檀波羅蜜不異摩訶衍，@t25p430a摩訶衍不異檀波羅蜜，檀波羅蜜、摩訶衍無二無別；乃至禪波羅蜜亦如是。
須菩提！四念處不異摩訶衍，摩訶衍不異四念處，四念處、摩訶衍#52.11無二無別；乃至十八不共法不異摩訶衍，摩訶衍不異十八不共法，十八不共法、摩訶衍#52.12無二無別。
以是因緣故，須菩提！汝說摩訶衍即是說般若波羅蜜。」
^52.2
%37.1643 肆、以無生門說般若#52.25
%37.1644 （壹）就柔順忍明無生觀#52.26
%37.1645 一、「十無觀」中求菩薩不可得
%37.1646 （一）標問
%37.1647 1、須菩提標十無觀
慧命須菩提白佛言：「世尊！
（1）菩薩摩訶薩前際不可得，後際不可得，中際不可得。#52.27
（2）色無邊故，當知菩薩摩訶薩亦無邊；受、想、行、識無邊故，當知菩薩摩訶薩亦無邊。#52.28
（3）色是菩薩摩訶薩，是亦不可得；受、想、行、識是菩薩摩訶薩，是亦不可得。#52.29
（4）如是，世尊！於一切種、一切處求菩薩不可得。世尊！我當教何等菩薩摩訶薩般~1472若波羅蜜？#52.30
（5）世尊！菩薩摩訶薩但有名字。#52.31
（6）如說我名字，我畢竟不生。如我，諸法亦如是無自性。#52.32何等色畢竟不生？何等受、想、行、識畢竟不生？#52.33
（7）世尊！是畢竟不生，不名為色；#52.34是畢竟不生，不名為受、想、行、識。#52.35
（8）世尊！若畢竟不生法，當教誰#52.36是般若波羅蜜耶？#52.37
（9）離畢竟不生，亦無菩薩行阿耨多羅三藐三菩提。#52.38
（10）若菩薩聞作是說，心不沒、不悔、不驚、不怖、不畏，當知是菩薩摩訶薩能行般若波羅蜜。」#52.39
%37.1648 2、舍利弗問十無因緣
舍利弗問：「
（1）須菩提！何因緣故言『菩薩摩訶薩前際不可得，後際不可得，中際不可得』？
（2）須菩提！何因緣故言『色無邊故，當知菩薩亦無邊；受、想、行、識無邊故，當知菩薩亦無邊』？
（3）須菩提！何因緣故言『色是菩薩，是亦不可得；受、想、行、識是菩薩，是亦不可得』？
（4）須菩提！何因緣故言『於一切種、一切處，菩薩不可得，當教何等菩薩般若波羅蜜』？
（5）須菩提！何因緣故言『菩薩摩訶薩但有名字』？
（6）須菩提！何因緣故言『如說我名字，我畢竟不生；如我，諸法亦如是無自性。何等色畢竟不生，何等受、想、行、識畢竟不@t25p430c生』？
（7）須菩提！何因緣故言『畢竟不生，不名為色？畢竟不生，不名為受、想、行、識~1473』？
（8）須菩提！何因緣故言『若畢竟不生法，當#52.40教誰#52.41是般若波羅蜜耶』？
（9）須菩提！何因緣故言『離畢竟不生，亦無菩薩行阿耨多羅三藐三菩提』？
（10）須菩提！何因緣故言『若菩薩聞作是說，心不沒、不悔、不驚、不怖、不畏，若能如是行，是名菩薩摩訶薩行般若波羅蜜』？」
%37.1649 （二）答釋
%37.1650 1、第一觀：三際中菩薩不可得
%37.1651 （1）約世間空
%37.1652 A、眾生無所有、空、離故
爾時，須菩提報舍利弗言：「眾生無所有故，菩薩前際不可得；眾生空故，菩薩前際不可得；眾生離故，菩薩前際不可得。#52.42
%37.1653 B、五蘊法無所有、空、離、自性無故
舍利弗！色無有故，菩薩前際不可得；受、想、行、識無有故，菩薩前際不可得。#52.43色空故#52.44，菩薩前際不可得；受、想、行、識空故，菩薩前際不可得。色離故，菩薩前際不可得；受、想、行、識離故，菩薩前際不可得。舍利弗！色性無故，菩薩前際不可得；受、想、行、識性無故，菩薩前際不可得。
%37.1654 （2）約出世間空
%37.1655 A、六度無所有、空、離、自性無故
舍利弗！檀波羅蜜無有故，菩薩前際不可得；尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜無有故，菩薩前際不可得。何以故？舍利弗！空中前際不可得、後際不可得、中際不可得；空不異菩薩，菩薩不異前際。舍利弗！空、菩薩、前際，是諸法無二無別。以是因緣故，舍利弗！菩薩前際不可得。
舍利弗！檀波羅蜜空故、檀波羅蜜離故、檀波羅蜜性無故，菩薩前際不可得；尸羅波羅蜜......羼提波羅蜜......毘梨耶波羅蜜......禪波羅蜜......；般若波羅蜜空故、般若波羅蜜離故、般若波羅蜜性無故，菩薩前際不可得。何以故？舍利弗！空中前際不可得、後際不可得、中際不可得；空不異@t25p431a菩薩，菩薩#52.45亦不異前際。~1474舍利弗！空、菩薩、前際，是諸法#52.46無二無別。以是因緣故，舍利弗！菩薩前際不可得。
%37.1656 B、十八空無所有、空、離、自性無故
復次，舍利弗！內空無所有故，菩薩前際不可得；乃至無法有法空無所有故，菩薩前際不可得。內空空故、內空離故、內空性無故，乃至無法有法空空故、離故、性無故，菩薩前際不可得。餘如上說。
%37.1657 C、三十七道品乃至十八不共法無所有、空、離、自性無故
復次，舍利弗！四念處無所有故，菩薩前際不可得；四念處空故、離故、性無故，菩薩前際不可得。乃至十八不共法無所有故，菩薩前際不可得；十八不共法空故、離故、性無故，菩薩前際不可得。餘如上說。以是因緣故，舍利弗！菩薩前際不可得。
%37.1658 D、一切三昧門、陀羅尼門無所有、空、離、自性無故
復次，舍利弗！一切三昧門、一切陀羅尼門無有故，菩薩前際不可得；三昧門、陀羅尼門空故、離故、性無故，菩薩前際不可得。餘如上說。
%37.1659 E、法性、如、實際、不可思議性無所有、空、離、自性無故
復次，舍利弗！法性無有故，菩薩前際不可得；法性空故、離故、性#52.47無故，菩薩前際不可得。餘如上說。
復次，舍利弗！如無有故、空故、離故、性無故，實際無有故、空故、離故、性無故，不可思議性無有故、空故、離故、性無故，菩薩前際不可得。餘如上說。
%37.1660 F、三乘、無上菩提、一切種智皆無所有、空、離、自性無故
復次，舍利弗！聲聞無有故，菩薩前際不可得；聲聞空故、離故、性無故，菩薩前際不可得。
辟支佛無有故、空故、離故、性無故，菩薩前際不可得。
佛無有故、空故、離故、性無故，菩薩前際不可得。#52.48
阿耨多羅三藐三菩提無有故乃至性無故，菩薩前際不可得。
復次，一切種智無有故乃至性無故，菩薩前際不可得。
%37.1661 （3）結
何以故？舍利弗！空，前際不可得、後際不可得、中際不可得，菩薩不可得。
舍@t25p431b利弗！空，不異菩薩，亦不異前際；空、菩薩、前際，是諸法無二無別。
~1475以是因緣故，舍利弗！菩薩前際不可得，後際、中際亦如是。#52.49
^52.3
~1479
%37.1700 2、第二觀：五蘊等無邊故，菩薩亦無邊
如舍利弗言#52.82：『色無邊故，當知菩薩亦無邊；受、想、行、識無邊故，當知菩薩亦無邊。』
舍利弗！色如虛空，受、想、行、識如虛空。
何以故？舍利弗！如虛空邊不可得、中不可得；無邊無中故，但說名虛空。
如是，舍利弗！色邊不可得、中不可得，是色空故，空中亦無邊亦無中；受......想......行......；@t25p432b識邊不可得、中不可得，識空故，空中亦無邊亦無中。
以是因緣故，舍利弗！色無邊故，當知菩薩亦無邊；受、想、行、識無邊故，當知菩薩亦無邊。乃至十八不共法亦如是。#52.83
%37.1701 3、第三觀：即五蘊，菩薩不可得
如舍利弗言：『色是菩薩，是亦不可得；受、想、行、識是菩薩，是亦不可得。』
舍利弗！色、色相#52.84空，受......想......行......，識、識相空；檀波羅蜜、檀波羅蜜相空，乃至般若波羅蜜亦如是；內空、內空相空，乃至無法有法空、無法有法空相空；四念處、四念處相空，乃至十八不共法、十八不共法相空；如、法性、實際，不可思議性、不可思議性相空；三昧門、三昧門相空，陀羅尼門、陀羅尼門相空；一切智、一切智相空，道種#52.85智、道種智相空，一切種智、一切種智相空；聲聞乘、聲聞乘相空，辟支佛乘、辟支佛乘相空，佛乘、佛乘相空；聲聞人、聲聞人相空，辟支佛#52.86、辟支佛相空，佛、佛相空。
空中色不可得，受、想、行、識不可得。
以是因緣故，舍利弗！色是菩薩，是亦不可得；受、想、行、識是菩薩，是亦不可得。#52.87
~1480
%37.1702 4、第四觀：於一切種、一切處遍求菩薩不可得，當教誰般若波羅蜜
如舍利弗言：『何因緣故，於#52.88一切種、一切處，菩薩不可得，當教何等菩薩般若波羅蜜？』
舍利弗！色，色中不可得；色，受中不可得。#52.89受，受中不可得；受，色中不可得；受，想中不可得。想，想中不可得；想，色、受中不可得；想，行中不可得。行，行中不可得；行，色、受、想中不可得；行，識中不可得。識，識中不可得，識，色、受、想、行中不可得。
舍利弗！眼，眼中不可得；眼，耳中不可得。耳，耳中不可得；耳，眼中不可得；耳，鼻中不可得。鼻，鼻中不可得；鼻，眼、耳中不可得；鼻，舌中不可得。舌，舌中不可得；@t25p432c舌，眼、耳、鼻中不可得；舌，身中不可得。身，身中不可得；身，眼、耳、鼻、舌中不可得；身，意中不可得。意，意中不可得；意，眼、耳、鼻、舌、身中不可得。
六入、六識、六觸、六觸因緣生受亦如是。
檀波羅蜜乃至般若波羅蜜，內空乃至無法有法空，四念處乃至十八不共法，一切三昧門、一切陀羅尼門，性法乃至辟支佛法，初地乃至十地，一切智、道種智、一切種智亦如是；須陀洹乃至阿羅漢、辟支佛、菩薩、佛亦如是。
菩薩，菩薩中不可得；菩薩，般若波羅蜜中不可得。般若波羅蜜，般若波羅蜜中不可得；般若波羅蜜，菩薩中不可得；般若波羅蜜中，教化無所有不可得。教化中，教化無所有不可得；教化中，菩薩及般若波羅蜜無所有不可得。#52.90
舍利弗！如是一切法無所有不可得。
~1481以是因緣故，一切#52.91種、一切處，菩薩不可得，當教何等菩薩般若波羅蜜？#52.92
%37.1703 5、第五觀：諸法但有名字故，菩薩亦但有假名，實不可得
如舍利弗言：『何因緣故說菩薩摩訶薩但有假名？』
舍利弗！色是假名，受、想、行、識是假名；色名非色，受......想......行......，識名非識。何以故？名、名相空；若空，則非菩薩。以是因緣故，舍利弗！菩薩但有假名。#52.93
復次，舍利弗！檀波羅蜜但有名字；名字中非有檀波羅蜜，檀波羅蜜中非有名字。以是因緣故，菩薩但有假名。尸羅波羅蜜......羼提波羅蜜......毘梨耶波羅蜜......禪波羅蜜......。般若波羅蜜但有名字；名字中無有般若波羅蜜，般若波羅蜜中無有名字。以是因緣故，菩薩但有假名。
舍利弗！內空但有名字，乃至無法有法空但有名字，名字中無內空，內空中無名字。何以故？名字、內空俱不@t25p433a可得，乃至無法有法空亦如是。以是因緣故，舍利弗！菩薩但有假名。
舍利弗！四念處但有名字，乃至十八不共法但有名字；一切三昧門、一切陀羅尼門，乃至一切種智亦如是。以是因緣故，舍利弗！我說菩薩但有假名。
%37.1704 6、第六觀
%37.1705 （1）第六觀之一：眾生空、法空，畢竟不可得，畢竟不生
如舍利弗言：『何因緣故，說我#52.94名字畢竟不生？』
舍利弗！我畢竟不可得，云何當有生？乃至知者、見者畢竟不可得，云何當有生？
舍利弗！色畢竟不可得，云何當有生？受、想、行、識畢竟不可得，云何當有生？#52.95
眼畢竟不可得，乃至意觸因緣生受畢竟不可得，云何當有生？
檀波羅蜜畢竟不可得，乃至般若波羅蜜畢竟不可得，云何當有生？
~1482內空畢竟不可得，乃至無法有法空畢竟不可得，云何當有生？
四念處畢竟不可得，乃至十八不共法畢竟不可得，云何當有生？
諸三昧門、諸陀羅尼門畢竟不可得，云何當有生？
聲聞乃至佛畢竟不可得，云何當有生？
以是因緣故，舍利弗！我說：『如我名字，我亦畢竟不生。』」#52.96
^52.4
%37.1723 （2）第六觀之二：諸法和合生無自性，無常亦不失，非常亦非滅
%37.1724 A、諸法和合生故無自性
如舍利弗所言：『如我，諸法亦如是無自性。』
舍利弗！諸法和合生故無自性。#52.112
舍利弗！何等和合生無自性？舍利弗！色和合生無自性，受、想、行、識和合生無自性；眼和合生無自性，乃至意和合生無自性；色乃至法、眼界乃至法界、地種乃至識種、眼觸乃至意觸、眼觸因緣生受乃至意觸因緣生受和合生#52.113無自性；檀波羅蜜乃至般若波羅蜜和合生無自性；四念處乃至十八不共法和合生無自性。
%37.1725 B、諸法無常亦不失，非常亦非滅
復次，舍利弗！一切法無常亦不失。」#52.114
舍利弗問須菩提：「何等#52.115法無常亦不失？」
須菩提言：「色無常亦不失，受、想、行、識無常亦不失。何以故？若#52.116法無常，即是動相、即是空相。以是因緣故，舍利弗！一切有為法無常亦不失。
若有漏法、若無漏法，若有記法、若無記法，無常亦不失#52.117。何以故？若法無常，即是動相、即是空相。以是因緣故，舍利弗！一切作法#52.118無常亦不失。
復次，舍利弗！一切法非常非滅。」#52.119
~1485舍利弗言：「何等法非常非滅？」
須菩提言：「色非常非滅。何以故？性自爾。受、想、行、識非常非滅。何以故？性自爾。乃至@t25p434a意識#52.120因緣生受非常非滅。何以故？性自#52.121爾。
以是因緣故，舍利弗！諸法和合生無自性。#52.122
%37.1726 （3）第六觀之三：五蘊等畢竟不生，作者不可得故
如舍利弗所言：『何因緣故，色畢竟不生，受、想、行、識畢竟不生？』」
須菩提言：「色非作法，受、想、行、識非作法。何以故？作者不可得故。
舍利弗！眼非作法。何以故？作者不可得故；乃至意亦如是。
眼界乃至意觸因緣生受亦如是。
復次，舍利弗！一切諸法皆非起非作。何以故？作者不可得故。
以是因緣故，舍利弗！色畢竟不生，受、想、行、識畢竟不生。#52.123
%37.1727 7、第七觀：諸法畢竟不生，性空故，無生住異滅
如舍利弗所言：『何因緣故，畢竟不生，是不名為色？畢竟不生，是不名為受、想、行、識？』」
須菩提言：「色性空，是空無生、無滅、無住異#52.124；受想行識性空，是空無生、無滅、無住異#52.125。眼乃至一切有為法性空，是空無生、無滅、無住異。
以是因緣故，舍利弗！畢竟不生#52.126，是#52.127不名色；#52.128畢竟不生，是不名受、想、行、~1486識。#52.129
%37.1728 8、第八觀：畢竟不生與般若無二無別，當教誰般若波羅蜜
如舍利弗所言：『何因緣故，畢竟不生法，當教是般若波羅蜜耶？』」
須菩提言：「畢竟不生即是般若波羅蜜，般若波羅蜜即是畢竟不生，般若波羅蜜、畢竟不生無二無別。以是因緣故，舍利弗！我說畢竟不生，當教是般若波羅蜜耶？」#52.130
%37.1729 9、第九觀：若離畢竟不生則無菩薩行道──畢竟不生與般若、菩薩無二無別
如舍利弗所言：『何因緣故，離畢竟不生，無菩薩行阿耨多羅三藐三菩提？』」
須菩提言：「菩薩摩訶薩行般若波羅蜜時，不見畢竟不生異般若波羅蜜，亦不見畢竟不生異菩薩，畢竟不生及菩薩無二無別。
不見畢竟不生異色。何以故？是畢竟不生及色無二無別；不見畢竟不生異受想行識。何以故？畢竟不生、受想行識無二無別。#52.131
乃至一切種智亦如是。
以是@t25p434b因緣故，舍利弗！離畢竟不生，無菩薩行阿耨多羅三藐三菩提。」
%37.1730 10、第十觀：菩薩見一切法如夢等故，心不怖畏
如舍利弗所言：『何因緣故，菩薩聞作是說，心不沒、不悔，不驚、不怖、不畏，是名菩薩行般若波羅蜜？』」
須菩提言：「菩薩摩訶薩不見諸法有覺知相#52.132，見一切諸法如夢、如幻、如炎、如~1487影、如化。舍利弗！以是因緣故，菩薩聞作是說，心不沒、不悔，不驚、不怖、不畏。」#52.133
^52.5
~1489
%37.1739 二、菩薩行般若觀諸法，有五正觀行
%37.1740 （一）正說五正觀行──不受、不示、不住、不著、不言
須菩提白佛言：「世尊！菩薩摩訶薩行般若波羅蜜，如是觀諸法，是時菩薩摩訶薩不受色，不視#52.153色，不住色，不著色，不言是色；受、想、行、識亦不受、不視、不住、不著，亦不言是受、想、行、識。#52.154
眼不受、不視、不住、不著，亦不言是眼；耳......鼻......舌......身......；意亦不受、不視、不住、不著，亦不言是意。
檀波羅蜜不受、不視、不住、不著，亦不言@t25p435a是檀波羅蜜；尸羅波羅蜜......羼提波羅蜜......毘梨耶波羅蜜......禪波羅蜜......；般若波羅蜜不受、不示、不住、不著，亦不言是般若波羅蜜。
內空不受、不示、不住、不著，亦不言是內空；乃至無法有法空亦如是。
復次，世尊！菩薩摩訶薩行般若波羅蜜時，四念處不受、不示、不住、不著，亦不言是四念處；乃至十八不共法不受、不示、不住、不著，亦不言是十八不共法。
一切三昧門......一切陀羅尼門......；乃至一切種智，不受、不示、不住、不著，亦不言是一切種智。
%37.1741 （二）明行般若時，知諸法不生不滅故不見諸法
%37.1742 1、明諸法與不生不二不別故不見諸法
復次，世尊！菩薩摩訶薩行般若波羅蜜時，不見色乃至不見一切種智。#52.155
何以故？色不生，是非色；受......想......行......；識不生，是非識。
眼不生，是非眼；耳......鼻......舌......身......；意不生，是非意。
檀波羅蜜不生，是非檀波羅蜜；乃至般若波羅蜜不生，是非般若波羅蜜。
何#52.156以故？色、不生，不二不別；乃至般若波羅蜜、不生，不二不別。
內空不生，是非內空；乃至無法有法空不生，是非無法有法空，
何以故？內空乃至無法有法空、不生，不二不別。
世尊！四念處不生，非四念處。
何以故？四念處、不生，不二不別。
何以故？世尊！是不生法非一、非二、非三、非異。
以是故，四念處、不生，不二不別。
~1490乃至十八不共法#52.157不生，非十八不共法。
何以故？十八不共法、不生，不二不別。
何以故？世尊！是不生法非一、非二、非三、非異。
以是故，十八不共法不生，非十八不共法。
世尊！如不生，是非如；乃至不可思議性不生，是非不可思議性。
世尊！是阿耨多羅三藐三菩提不生......；一切智......；一切種智不生，是非一切種智。
何以@t25p435b故？是阿耨多羅三藐三菩提，乃至一切種智、不生，不二不別。
何以故？世尊！是不生法#52.158非一、非二、非三#52.159、非異。
以是故，乃至一切種智不生，非一切種智。
%37.1743 2、明諸法與不滅不二不別故不見諸法
世尊！色不滅相，是非色。
何以故？色及不滅相，不二不別。
何以故？世尊！是不滅法非一、非二、非三、非異。以是故，色不滅相是非色；受......想......行......；識不滅相是非識。
何以故？識及#52.160不滅不二不別。
何以故？世尊！是不滅法非一、非二、非三、非異，以是故，識不滅相#52.161是非識。
檀波羅蜜乃至般若波羅蜜，內空乃至無法有法空，四念處乃至十八不共法，亦如是。#52.162
%37.1744 （三）明諸法入無二法數
世尊！以是故，色入無二法數，受、想、行、識入無二法數，乃至一切種智入無二法數。」#52.163
^53.1
%37.1756 三、明「菩薩、般若波羅蜜及觀」義
%37.1757 （一）舍利弗問「何等是菩薩、般若波羅蜜及觀」
爾時，慧命舍利弗語須菩提：「菩薩摩訶薩行般若波羅蜜觀諸法──何等是菩薩？何等是般若波羅蜜？何等是觀？」#53.2
%37.1758 （二）須菩提答
%37.1759 1、明「菩薩」義：發大心求佛道，遍知一切法相亦不著
須菩提語舍利弗：「如汝所問：『何等是菩薩？』
為阿耨多羅三藐三菩提，是人發大心，以是故名為菩薩。@t25p436a
亦知一切法、一切種相，是中亦不著──知色相不著，乃至知十八不共法亦不著。」#53.3
舍利弗問須菩提：「何等為一切法相？」
須菩提言：「若以名字因緣和合等，知諸法是色，是聲、香、味、觸、法，是內、是外，是有為法、是無為法──以是名字相語言知諸法，是名知#53.4諸法相。#53.5
~1494
%37.1760 2、明「般若波羅蜜」義
%37.1761 （1）遠離諸法故名般若波羅蜜
如舍利弗所問：『何等是般若波羅蜜？』
遠離故名般若波羅蜜。#53.6
%37.1762 （2）明所遠離法
何等法遠離？遠離眾、界、入，遠離檀波羅蜜乃至禪波羅蜜，遠離內空乃至無法有法空；以是故，遠離名般若波羅蜜。
復次，遠離四念處，乃至遠離十八不共法，遠離一切智。
%37.1763 （3）結成
以是因緣故，遠離名般若波羅蜜。
%37.1764 3、明「觀」義
如舍利弗所問：『何等是觀？』
舍利弗！菩薩摩訶薩行般若波羅蜜時，觀色非常非無常、非樂非苦、非我非無我、非空非不空、非相非無相、非作非無作、非#53.7寂滅非不寂滅、非離非不離；受、想、行、識亦如是。
檀波羅蜜乃至般若波羅蜜，內空乃至無法有法空，四念處乃至十八不共法，一切三昧門、一切陀羅尼門，乃至一切種智，觀非常非無常、非樂非苦、非我非無我、非空非不空、非相非無相、非作非無作、非寂滅非不寂滅、非離非不離。
舍利弗！是名菩薩摩訶薩行般若波羅蜜時觀諸法。」
^53.2
%37.1782 四、以無生觀諸法皆入無二法數
%37.1783 （一）自相空故觀法無生
舍利弗問須菩提：「何因緣故，色不生是非色？受......想......行......，識不生是非識，乃至一切種智不生，是非一切種智？」
須菩提言：「色、色相空，色空中無色、無#53.20生，以是因緣故，色不生是非色；受......想......行......，識、識相空，識空中無識、無生，以是因緣故，受、想、行、識不~1497生是非受、想、行、識。#53.21舍利弗！檀波羅蜜、檀波羅蜜相空，檀波羅蜜空中無檀波羅蜜、無#53.22生；尸羅波羅蜜......羼提波羅蜜......毘梨耶波羅蜜......禪波羅蜜......；般若波羅蜜、般若波羅蜜相空，般若波羅蜜空中無般若波羅蜜、無生，以是因緣故，舍利弗！般若波羅蜜不生，是非般若波羅蜜。內空乃至無法有法空、四念處乃至十八不共法、一切種智亦如是，以是因緣故，內空不生是非內空，乃至一切種智不生是非一切種智。」
%37.1784 （二）散空故觀法不二
舍利弗問須菩提：「汝何因緣故言『色不二是非色，受......想......行......，識不二是非識，乃至一切種智不二是非一切種智』？」
須菩提答言：「所有色，所有不二；所有受、想、行、識，所有不二──是一切法皆不合、不散，無色、無形、無對，一相所謂無相。#53.23眼乃至一切種智亦如是。以是因緣故，舍利弗！色不二是非色，受......想......行......，識不二是非識，乃至一切種智不二是非一切種智。」
%37.1785 （三）觀法無生故入無二法數
舍利弗問須菩提：「何因緣故言『是色入無二法數，受、想、行、識入無二法數，乃至一切種智入無二法數』？」
須菩提答言：「色不異無生、無生不異色，色即是無生、無生即是色；受......想......行......；識不異無生、無生不異識，識即是無生、無生即是識。以是因緣故，舍利弗！色入無二法數，受、想、行、識入無二法數，#53.24乃至@t25p437a一切種智亦如是。」
^53.3
%37.1800 （貳）就無生忍明無生觀#53.35
%37.1801 一、人與法無生，畢竟淨，一切皆不可得
%37.1802 （一）行般若觀諸法，人與法無生，畢竟淨故
爾時，須菩提白佛言：「世尊！若菩薩摩訶薩行般若波羅蜜，如是觀諸法，是時見色無#53.36生，畢竟淨故；見受、想、行、識無生，畢竟淨故；見我無生，乃至知者、見者無生，畢竟淨故；#53.37見檀波羅蜜無生乃至般若波羅蜜無生，畢竟淨故；見內空無生乃至無法有法空無生，畢竟淨故；見四念處無生乃至十八不共法無生，畢竟淨故；見一切三昧、一切陀羅尼無生，畢竟淨故；乃至見一切種智無生，畢竟淨故。
見『凡夫、凡夫法』無生，畢竟淨故；見『須陀洹、須陀洹法』、『斯陀含、斯陀含法』、『阿那含、阿那含法』、『阿羅漢、阿羅漢法』、『辟支佛、辟支佛法』、『菩薩、菩薩法』、『佛、佛法』無生，畢竟淨故。#53.38」
~1500
%37.1803 （二）論無生
%37.1804 1、舍利弗問難
%37.1805 （1）若人與法無生，則聖人無大小、聖法無優劣、六道無別異
舍利弗語須菩提：「如我聞須菩提所說義──色是不生，受、想、行、識是不生，乃至佛、佛法是不生。若爾者，不應得須陀洹、須陀洹果、斯陀含、斯陀含果、阿那含、阿那含果、阿羅漢、阿羅漢果、辟支佛、辟支佛道；不應得菩薩摩訶薩、一切種智；亦無六道別異；亦不得菩薩摩訶薩五種菩提#53.39。
%37.1806 （2）若一切法不生，何故二乘斷結修道、菩薩為眾生修難行苦行、佛得菩提轉法輪
須菩提！若一切法不生相，何以故須陀洹為斷三結故修道，斯陀含為薄婬恚癡故修道，阿那含為斷五下分結故修道，阿羅漢為斷五上分結故修道，辟支佛為辟支佛法故修道？
何以故菩薩摩訶薩作難行，為眾生受種種苦？
何以故佛得阿耨多羅三藐三菩提？何以故佛轉法輪？」
%37.1807 2、須菩提答：於無生法中，不見一切法有所得
%37.1808 （1）總答
須菩提語舍利弗：「我不欲令無生法有所得。
%37.1809 （2）別答
%37.1810 A、於無生法中，不見有二乘斷結得果
我亦不欲令無生法中得須@t25p437c陀洹、須陀洹果，乃至不欲令無生法中得阿羅漢、阿羅漢果、辟支佛、辟支佛道。#53.40
%37.1811 B、於無生法中，不見有菩薩難行苦行
我亦不欲令無#53.41生法中菩薩作難行、為眾生受種種苦。菩薩亦不以難行心行道。何以故？舍利弗！生難心、苦心，不能利益無量阿僧祇眾生。
舍利弗！今菩薩憐愍眾生，於眾生如父母兄弟想、如兒子及己身想，如是能利益無量阿僧祇眾生，是用無所得故。#53.42
~1501所以者何？菩薩摩訶薩應生如是心：『如我一切處、一切種不可得，內外法亦如是。』若生如是想，則無難心、苦心。何以故？
是菩薩於一切種、一切處、一切法不受#53.43故。#53.44
%37.1812 C、於無生法中，不見有佛得菩提轉法輪
舍利弗！我亦不欲令無生法中佛得阿耨多羅三藐三菩提，亦不欲令無生法中轉法輪，亦不欲令以無生法得道。」#53.45
^53.4
~1505
%37.1843 （三）論得道
%37.1844 1、明得道因緣──不以二法而得道果
舍利弗語須菩提：「今欲令以生法得道？以無生法得道？」
須菩提語舍利弗：「我不欲令以生法得道。」
舍利弗言：「今須菩提欲令以無生法得道？」
須菩提言：「我亦不欲令以無生法得道。」#53.76
%37.1845 2、依二諦說：世俗假名有，勝義畢竟空
舍利弗言：「如須菩提所說，無知無得。#53.77」
須菩提言：「有知有得，不以二法。今以世間名字故有知有得，世間名字故有須陀洹乃至阿羅漢、辟支佛、諸佛；第一實義中，無知無得──@t25p438c無須陀洹乃至無諸佛。」#53.78
「須菩提！若世間名字故有知有得，六道別異亦世間名字故有，非以第一實義耶？」
須菩提言：「如是！如是！舍利弗！如世間名字故有知有得，六道別異亦世間名字故有，非以第一實義。何以故？舍利弗！第一實義中無業無報、無生無滅、無淨無垢。#53.79」#53.80
%37.1846 （四）明諸法無生
%37.1847 1、不生法、生法皆無生──自性空故
%37.1848 （1）舍利弗問：不生法生或生法生
舍利弗語須菩提：「不生法生？生法生？」#53.81
~1506
%37.1849 （2）須菩提答：不生法、生法皆無生
須菩提言：「我不欲令不生法生，亦不欲令生法生。」#53.82
%37.1850 （3）舍利弗問：何等不生法不欲令生
舍利弗言：「何等不生法不欲令生？」
%37.1851 （4）須菩提答：色等諸法自性空故無生
須菩提言：「色是不生法，自性空，不欲令生；受、想、行、識不生法，自性空，不欲令生；乃至阿耨多羅三藐三菩提不生法，自性空，不欲令生。」#53.83
%37.1852 2、非生生，亦非不生生──諸法無相故無生
舍利弗語須菩提：「生生？不生生？」#53.84
須菩提言：「非生生，亦非不生生。何以故？舍利弗！生、不生，是二法不合、不散，無色、無形、無對，一相，所謂無相。舍利弗！以是因緣故，非生生，亦非不生生。」#53.85
%37.1853 （五）稱歎樂說無生
爾時，舍利弗語須菩提：「須菩提樂說無生法及無生相？」
須菩提語舍利弗：「我樂說無生法，亦樂說無生相。何以故？諸無生法及無生相，樂說及語言──是一切法皆不合、不散，無色、無形、無對，一相，所謂無相。」#53.86
~1507舍利弗語須菩提：「汝樂說不#53.87生法，亦樂說不#53.88生相；是樂說、語言亦不生？」
須菩提言：「如是！如是！舍利弗！何以故？舍利弗！色不生，受、想、行、識不生；#53.89眼不生乃至意不生；地種不生，乃至識種不生；身行不生，口行不生，意行不生；檀波羅蜜不生，乃至一切種智不生。
以是因緣故，舍利弗！我樂說不#53.90生法，亦樂說不#53.91生相，是樂說、語言亦不生。#53.92」
^53.5
%37.1867 （六）知諸法空而無所依，能淨菩薩道
%37.1868 1、舍利弗讚須菩提說法第一
爾時，舍利弗語須菩提：「須菩提於說法人中，應最在上！何以故？須菩提隨所問皆能答。」
%37.1869 2、法性常空故諸法無所依
須菩提言：「諸法無所依故。」
舍利弗語須菩提：「云何諸法無所依？」
須菩提言：「色性常空，不依內，不依外，不依兩中間；受、想、行、識性常空，不依內，不依外，不依兩中間。#53.108眼、耳、鼻、舌、身、@t25p439c意性常空，不依內，不依外，不依兩中間。色性常空，乃至法性常空，不依內，不依外，不依兩中間。~1510檀波羅蜜性常空，乃至般若波羅蜜性常空，不依內，不依外，不依兩中間。內空性常空，乃至無法有法空性常空，不依內，不依外，不依兩中間。舍利弗！四念處性常空，乃至一切種智性#53.109常空，不依內，不依外，不依兩中間。以是因緣故，舍利弗！一切諸法無所依，性常空故。
%37.1870 3、勸淨菩薩道
如是，舍利弗！菩薩摩訶薩行六波羅蜜時，應淨色、受、想、行、識，乃至應淨一切種智。」
%37.1871 二、明趣無生之方便
%37.1872 （一）行六度淨菩薩道
%37.1873 1、總標世間六度、出世間六度
舍利弗問須菩提：「菩薩摩訶薩云何行六波羅蜜時淨菩薩道？」
須菩提言：「有世間檀波羅蜜，有出世間檀波羅蜜；尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜，有世間、有出世間。」
%37.1874 2、別釋
%37.1875 （1）施度#53.110
舍利弗問須菩提：「云何世間檀波羅蜜？云何出世間檀波羅蜜？」
%37.1876 A、世間檀──有三礙──有所依@yB017p142
須菩提言：「若菩薩摩訶薩作施主，能施沙門、婆羅門、貧窮、乞人，須食與食，須飲與飲，須衣與衣，臥具、床榻、房舍、香華、瓔#53.111珞、醫藥，種種所須資生之物；若妻子、國土、頭目、手足、支節──內外之物，盡以給施。施時作是念：『我與、彼取，我不慳貪，我為施主，我能捨一切，我隨佛教施，我行檀波羅蜜。』作是施已，用得法與一切眾生共之，迴向阿耨多羅三藐三菩提，念言：『是布施因緣，令眾生得今世樂，後當令得入涅槃。』
是人布施有三礙。何等三？我相、他相、施相。著是三相布施，是名世間檀波羅蜜。
何因緣故名世間？於世間中不動不出，是名世間檀波羅蜜。#53.112
%37.1877 B、出世間檀──三分清淨──無所依@yB017p142
云何名出世間檀波羅蜜？所謂三分清淨。@t25p440a何等三？菩薩摩訶薩布施時，我不可得，不見受者，施物不可得亦不望報──是名菩薩摩訶薩三分清淨檀波羅蜜。
~1511復次，舍利弗！菩薩摩訶薩布施時，施與一切眾生，眾生亦不可得；以此布施迴向阿耨多羅三藐三菩提，乃至不見微細法相。舍利弗！是名出世間檀波羅蜜。
何以故名為出世間？於世間中能動、能出，是故名出世間檀波羅蜜。#53.113
%37.1878 （2）例餘五度
尸羅波羅蜜──有所依，是為世間尸羅波羅蜜；無所依，是為出世間尸羅波羅蜜。餘如檀波羅蜜說。
羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜，有所依是名世間，無所依是名出世間；餘亦如檀中說。
%37.1879 3、結
如是，舍利弗！菩薩摩訶薩行六波羅蜜時，淨菩薩道。」
%37.1880 （二）行三十七道品等開菩提道
舍利弗問須菩提：「云何菩薩摩訶薩為阿耨多羅三藐三菩提道？」
須菩提言：「四念處是菩薩摩訶薩為阿耨多羅三藐三菩提道，乃至八聖道分，空解脫門、無相解脫門、無作解脫門，內空乃至無法有法空，一切三昧門、一切陀羅尼門，佛十力、四無所畏、四無礙智、十八不共法、大慈大悲。舍利弗！是名菩薩摩訶薩為阿耨多羅三藐三菩提道。」
^53.6
%37.1903 （三）稱讚般若力
%37.1904 1、舍利弗讚須菩提善哉
爾時，舍利弗讚須菩提言：「善哉！善哉！何等波羅蜜力？」#53.135
%37.1905 2、須菩提顯般若力之殊勝
須菩提言：「是般若波羅蜜力。所以者何？
%37.1906 （1）般若能生一切善法
般若波羅蜜能生一切諸善法──若聲聞法、辟支佛法、菩薩法、佛法。
%37.1907 （2）般若能含受一切善法
舍利弗！般若波羅蜜能受一切諸善法──聲聞法、辟支佛法、菩薩法、佛法。
%37.1908 （3）十方三世諸佛皆行般若而得無上菩提
舍利弗！過去諸佛行般若波羅蜜，@t25p441a得阿耨多羅三藐三菩提；未來諸佛亦行般若波羅蜜，當得阿耨多羅三藐三菩提；舍利弗！今現在十方諸#53.136國界中諸佛亦行是般若波羅蜜，得阿耨多羅三藐三菩提。
%37.1909 三、明順應般若之行者
%37.1910 （一）明能隨順般若行之人
~1515舍利弗！若菩薩摩訶薩聞說般若波羅蜜時，不疑不難，當知是菩薩摩訶薩行菩提道#53.137。菩薩#53.138道者，救#53.139一切眾生故，心不捨一切眾生，以無所得故。是菩薩常應不離是念，所謂大悲念。」
%37.1911 （二）眾生及諸法空而不離大悲念
舍利弗復問#53.140：「欲使菩薩摩訶薩常不離是念，所謂大悲念；若菩薩摩訶薩常不離大悲念，令一切眾生皆當作菩薩。何以故？須菩提！一切眾生亦不離諸念故。」
須菩提言：「善哉！善哉！舍利弗！汝欲難我而成我義。
何以故？眾生無故念亦無，眾生性無故念亦性無，眾生法無故念亦法無，眾生離故念亦離，眾生空故念亦空，眾生不可知故念#53.141亦不可知。#53.142
舍利弗！色無故念亦無，色性無故念亦性無#53.143，色法無故念亦法無，色離故念亦離，色空故念亦空，色不可知故念亦不可知；受、想、行、識亦如是；眼乃至意，色乃至法，地種乃至識種，檀波羅蜜乃至般若波羅蜜，內空乃至無法有法空，四念處乃至十八不共法，一切三昧門、一切陀羅尼門，一切智、一切種智，乃至阿耨多羅三藐三菩提無故，念亦無；乃至阿耨多羅三藐三菩提不可知故，念亦不可知。
舍利弗！菩薩摩訶薩行是道，我欲使不離是念，所謂大悲念。」
%37.1912 伍、佛讚說勸學，現瑞證說，時眾得益
%37.1913 （壹）佛讚說般若、勸學般若
爾時，佛讚須菩提言：「善哉！善哉！是菩薩摩訶薩般若波羅蜜，其有說者，亦當如是說。如汝所說般若波羅蜜，皆是承#53.144佛意@t25p441b故。菩薩摩訶薩學般若波羅蜜，應當如汝所說學！」
%37.1914 （貳）現瑞證說，時眾得益
%37.1915 一、地動顯瑞相
須菩提說是般若波羅蜜品時，三千大千世界六種振#53.145動：東湧西沒、西湧東沒，南湧北沒、北#53.146湧南沒，中湧邊沒、邊湧中沒。
%37.1916 二、十方諸佛同說般若，時眾得益
~1516爾時，佛微笑。須菩提白佛言：「何因何緣故微笑？」
佛告須菩提：「如我於此世界說般若波羅蜜，東方無量阿僧祇世界諸佛，亦為諸菩薩摩訶薩說般若波羅蜜；南西北方、四維、上下，亦說是般若波羅蜜。
說是般若波羅蜜品時，十二那由他諸天人得無生法忍。十方諸佛說是般若波羅蜜時，無量阿僧祇眾生亦發阿耨多羅三藐三菩提心。」
^54.1
%38.0 壹、諸天來集，佛常光勝諸天光明
%38.1 （壹）諸天來集
爾時，三千大千世界諸四天王天等#54.3，各與無數百#54.4千億諸天，俱來在會中；三千大千世界諸釋提桓因等諸忉利天、須夜魔#54.5天王等諸夜魔天、刪兜率陀天王等諸兜率陀天，須涅#54.6蜜陀#54.7天王等諸妙化天、婆舍跋提天王等諸自在行天，各與無數百千億諸天，俱來在會中；三千大千世界諸梵天#54.8王，乃至首陀婆#54.9諸天#54.10等#54.11，各與無數百千億諸天，俱來在會中。
%38.2 （貳）佛常光勝諸天光明
是諸四天王天乃至首陀婆諸天業報生身光明，於佛常光#54.12，百分、千分、萬#54.13億分不能及一，乃至不可以算數譬喻為比。世尊光明最勝、最妙、最上第一；諸天業報光明在佛常#54.14光邊不照不現，譬如焦炷#54.15比閻浮檀金#54.16。
%38.3 貳、以「深入究竟住、初入般若行、般若體」等三義說般若
%38.4 （壹）帝釋以三義問般若
~1521爾時，釋提桓因白大德須菩提：「是三千大千世界諸四天王天乃至首陀婆諸天，一切和合，欲聽須菩提說般若波羅蜜義。
須菩提！（1）菩薩摩訶薩云何應住般若波羅蜜中？
（2）何等是菩薩摩訶薩般若波羅蜜？
（3）云何菩薩摩@t25p442c訶薩應行般若波羅蜜？」
%38.5 （貳）須菩提受請為說
%38.6 一、說法緣起
%38.7 （一）仗佛力而說
須菩提語釋提桓因言：「憍尸迦！我今當承順佛意、承佛神力，為諸菩薩摩訶薩說般若波羅蜜，如菩薩摩訶薩所應住般若波羅蜜中。
%38.8 （二）勸發菩提心
諸天子！今未發阿耨多羅三藐三菩提心者，應#54.17當發。#54.18
諸天子！若入聲聞正位，是人#54.19不能發阿耨多羅三藐三菩提心。何以故？與生死作障隔故。是人若發阿耨多羅三藐三菩提心者，我亦隨喜。所以者何？上人應更求上法，我終不斷其功德。#54.20
%38.9 二、正答三問
%38.10 （一）釋「何等是般若波羅蜜」［並答「云何應行般若波羅蜜」］
%38.11 ※ 須菩提重述所問而答
憍尸迦！何等是般若波羅蜜？
%38.12 （1）應薩婆若心，以無所得空慧觀
菩薩摩訶薩應薩婆若心，
%38.13 A、觀五蘊等諸法無常、寂滅等
%38.14 （A）觀無常等十五事
（1）念色無常，（2）念色苦，（3）念色空，（4）念色無我，念色（5）如病、（6）如疽#54.21癰#54.22、（7）瘡#54.23，（8）如箭入身，（9）痛#54.24、（10）惱、（11）衰、（12）壞，（13）憂、（14）畏、（15）不安，~1522以無所得故；受、想、行、識亦如是。#54.25眼、耳、鼻、舌、身、意，地種、水火風空識種，觀無常乃至憂、畏、不安，是亦無所得故。
%38.15 （B）觀寂滅等
觀色寂滅、離、不生不滅、不垢不淨，受、想、行、識亦如是；觀地種乃至識種寂滅、離、不生不滅、不垢不淨，亦無所得故。
%38.16 B、觀十二因緣
復次，憍尸迦！菩薩摩訶薩應薩婆若心，觀無明緣諸行乃至老死因緣大苦聚集，亦無所得故；觀無明滅故諸行滅乃至生滅@t25p443a故老死滅，老死滅故憂悲愁惱大苦聚滅，以無所得故。
%38.17 C、修行三乘法
%38.18 （A）修三乘共法乃至諸佛功德
復次，憍尸迦！菩薩摩訶薩應薩婆若心，修四念處，以無所得故；乃至修佛十力、十八不共法，以無所得故。
%38.19 （B）行六度
%38.20 a、行前五度
復次，憍尸迦！菩薩摩訶薩應薩婆若心，行檀波羅蜜，以無所得故；行尸羅#54.26波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜，以無所得故。
%38.21 b、行般若──觀諸法緣起無我
復次，憍尸迦！菩薩摩訶薩行般若波羅蜜時，作是觀：『但諸法諸法共相因緣潤益增長，分別校計，是中無我、無我所。』#54.27
~1523
%38.22 （2）觀初迴向心與佛心互不相在、不可得
%38.23 A、不以世諦說@yB018p144
菩薩迴向心不在阿耨多羅三藐三菩提心中，阿耨多羅三藐三菩提心不在迴向心中；迴向心於阿耨多羅三藐三菩提心中不可得，阿耨多羅三藐三菩提心於迴向心中亦#54.28不可得。
菩#54.29薩雖觀一切法，亦無法可得，是名『菩薩摩訶薩般若波羅蜜』。」
%38.24 B、以第一義諦說──皆空非心相@yB018p144
釋提桓因問大德須菩提：「云何菩薩迴向心不在阿耨多羅三藐三菩提心中？云何阿耨多羅三藐三菩提心不在迴向心中？云何迴向心於阿耨多羅三藐三菩提心中不可得？云何阿耨多羅三藐三菩提心於迴向心中不可得？」
須菩提語釋提桓因言：「憍尸迦！迴向心、阿耨多羅三藐三菩提心，非心；是非心相，非心相中不可迴向。是非心相常非心相，不可思議相常不可思議相，是名菩薩摩訶薩般若波羅蜜。」#54.30
%38.25 2、佛讚所說
爾時，佛讚須菩提言：「善哉！善哉！須菩提！汝為諸菩薩摩訶薩說般若波羅蜜，安慰諸菩薩摩訶薩心。」
%38.26 3、須菩提自陳說意
須菩提白佛言：「世尊！我應報恩，不應不報恩。過去諸佛及諸弟子為諸菩薩說六波羅蜜，示、教、利、喜；世尊爾時亦在中@t25p443b學，得阿耨多羅三藐三菩提。我今亦當為諸菩薩說六波羅蜜，示、教、利、喜，令得阿耨多羅三藐三菩提。」
^54.2
%38.110 （二）釋「云何應住般若波羅蜜中」
爾時，須菩提語釋提桓因言：「憍尸迦！汝@t25p445b今當聽菩薩摩訶薩般若波羅蜜中如所應住、所不應住。#54.85
%38.111 1、明「應如是住」
%38.112 （1）五蘊空與菩薩空無二無別
憍尸迦！色、色空，受......，想......，行......，識、識空，菩薩、菩薩空。是色空、菩薩空，不二不別；受......，想......，行......，識空、菩薩空，不二不別。
憍尸迦！菩薩摩訶薩般若波羅蜜中應如是住。
%38.113 （2）六根空乃至十二因緣空與菩薩空無二無別
%38.114 A、六根
復次，眼、眼空，乃至意、意空，菩薩、菩薩空；眼空乃至菩薩空，不二不別。
%38.115 B、六塵
六塵亦如是。
%38.116 C、六大種
地種、地種空，乃至識種、識種空，菩薩、菩薩空。
憍尸迦！地種空乃至識種空、菩薩空，不二不別。
~1533憍尸迦！菩薩摩訶薩般若波羅蜜中應如是住。
%38.117 D、十二因緣
無明、無明空，乃至老死、老死空；無明滅、無明滅空，乃至老死滅、老死滅空；菩薩、菩薩空。
憍尸迦！無明空乃至老死空，無明滅空乃至老死滅空，菩薩空，不二不別。
憍尸迦！菩薩摩訶薩般若波羅蜜中應如是住。
%38.118 （3）六度乃至一切種智之空與菩薩空無二無別
檀波羅蜜乃至般若波羅蜜，內空乃至無法有法空，四念處乃至十八不共法，一切三昧門、一切陀羅尼門，聲聞乘、辟支佛乘、佛乘，聲聞、辟支佛、菩薩、佛，亦如是。
一切種智、一切種智空，菩薩、菩薩空；一切種智空、菩薩空，不二不別。
%38.119 （4）結
憍尸迦！菩薩摩訶薩般若波羅蜜中應如是住。」
%38.120 2、明「所不應住」
爾時，釋提桓因問須菩提：「云何菩#54.86薩般若波羅蜜中所不應住？」
%38.121 （1）廣說不應住
%38.122 A、以有所得故，於五蘊乃至一切種智皆不應住
須菩提言：「憍尸迦！菩薩摩訶薩不應色中住，以有所得故；不應受、想、行、識中住，以有所得故。不應眼中住乃至不應意中住，不應色中住乃至不應法中住，眼識乃至意識、眼觸乃至意觸、眼觸因緣生受乃至意觸因緣生受中不應住，以有所得故。地種乃至識種中不應住，以有所得故。檀波羅蜜乃至般若波羅蜜、@t25p445c四念處乃至十八不共法中不應住，以有所得故。須陀洹果中不應住，以有所得故；乃至阿羅漢果、辟支佛道、菩薩道、佛道、一切種智不應住，以有所得故。
%38.123 B、於五蘊常、無常等門不應住
復次，憍尸迦！菩薩摩訶薩，色是常不應住，色是無常不應住；受、想、行、識亦如是。
色若樂若苦、若淨若不淨、若我若無我、若空若不空、若寂滅若不寂滅、若離若不離不應住，以有所得故；受、想、行、識亦如是。
%38.124 C、於三乘之無為果相及其福田不應住
復次，憍尸迦！菩薩摩訶薩，須陀洹果無為相、斯陀含果無為相、阿那含果無為相、阿羅漢果無為相不應住，辟支佛道無為相、佛道無為相不應住。須陀洹福田不應住，斯陀含、阿那含、阿羅漢、辟支佛、佛福田不應住。
%38.125 D、於菩薩初地乃至十地不應住
復次，憍尸迦！菩薩摩訶薩初地中不應住，以有所得故；乃至第十地中不應住，以有所得故。
~1534
%38.126 E、於菩薩初發心、具足六度乃至得諸佛功德相好等皆不應住
復次，菩薩摩訶薩住初發心中，我當具足檀波羅蜜不應住，乃至我當具足般若波羅蜜不應住。#54.87具足六波羅蜜當入菩薩位，不應住；入菩薩位已，當住阿鞞跋#54.88致地，不應住；菩薩當具足五神通，不應住，以有所得故。菩薩住五神通已，我當遊無量阿僧祇佛界#54.89，禮敬、供養諸佛，聽法；聽法已，為他人說──菩薩摩訶薩如是不應住，以有所得故。#54.90
如諸佛世界嚴淨，我亦當莊嚴世界，不應住，以有所得故。
成就眾生，令入佛道，不應住；到無量阿僧祇世界諸佛所，尊重、愛敬、供養，以香華、瓔珞、澤#54.91香、搗#54.92香、幢幡、華蓋、百千億種寶衣供養諸佛，不應住，以有所得故。
我當令無量阿僧祇眾生發阿耨多羅三藐三菩提心，如是菩薩不應住；我當生五眼：@t25p446a肉眼、天眼、慧眼、法眼、佛眼，不應住；我當生一切三昧門，不應住；隨所欲遊戲諸三昧，不應住；我當生一切陀羅尼門，不應住。我當得佛十力，不應住；我當得四無所畏、四無礙智、十八不共法，不應住；我當具足大慈大悲，不應住；我當具足三十二相，不應住；我當具足八十隨形好，不應住，以有所得故。
%38.127 F、於八人乃至作諸佛事等皆不應住
是八人──是信行人、是法行人，如是不應住；須陀洹極七世生不應住；家家不應住；須陀洹命終垢盡不應住；須陀洹中間入涅槃不應住；是人向斯陀含果證不應住；是人斯陀含，一往#54.93來入涅槃不應住；是人向阿那含果證不應住；斯陀含一種不應住；是人阿#54.94那含，彼間入涅槃，不應住；是人向阿羅漢果證不應住；是人阿羅漢今世入無餘涅槃不應住；是辟支佛不應住；過聲聞、辟支佛地，我當住菩薩地，不應住；道種智中不應住，以有所得故。一切種、一切法知已，斷諸煩惱及習，不應住；佛得阿耨多羅三藐三菩提，當轉法輪，不應住；作佛事，度無量阿僧祇眾生入涅槃，不應住。#54.95
~1535
%38.128 G、修四神足住壽無量不應住
四如意足中不應住；入是三昧，住如恒河沙等劫壽，不應住；我當得壽命無殃#54.96數劫，不應住。
%38.129 H、於相好莊嚴乃至諸希有勝事中不應住
三十二相，一一相百福莊嚴#54.97，不應住；我一世界如十方恒河沙等世界，不應住；我三千大千世界純是金鋼#54.98，不應住；使#54.99我菩提樹當出如是香，眾生聞者#54.100，無有婬欲、瞋恚、愚癡，亦無聲聞、辟支佛心，是一切人必當得阿耨多羅三藐三菩提；若眾生聞是香者，身病、意病皆悉除盡，不應住。
%38.130 I、無有五蘊乃至無有諸佛功德名字，皆不應住
當使我世界中無有色受想行識名@t25p446b字，不應住；當使我世界中無有檀波羅蜜名字乃至無有般若波羅蜜名字，當使我世界中無有四念處名字乃至無有十八不共法名字，亦無須陀洹名字乃至#54.101無有佛名字，不應住，以有所得故。
%38.131 （2）釋不住因緣
何以故？諸佛得阿耨多羅三藐三菩提時，一切諸法無所得故。#54.102
%38.132 （3）結
~1536如是，憍尸迦！菩薩於般若波羅蜜中不應住，以無所得故。」#54.103
%38.133 3、結成：菩薩應如佛住不住法中
爾時，舍利弗心念：「菩薩今云何應住般若波羅蜜中？」
須菩提知舍利弗心所念，語舍利弗言：「於汝意云何？諸佛何所住？」#54.104
舍利弗語須菩提：「諸佛無有住處──諸佛不色中住，不受、想、行、識中住；不有為性中住，不無為性中住；不四念處中住，乃至不十八不共法中住；不一切種智中住。」
「舍利弗！菩薩摩訶薩般若波羅蜜中應如是住──如諸佛住於#54.105諸法中，非住非不住。
舍利弗！菩薩摩訶薩般若波羅蜜中應如是學：我當住不住法故。」#54.106
^54.3
%38.171 參、顯般若義甚深
%38.172 （壹）般若畢竟空，無名言、無聽、無說
%38.173 一、諸天述般若義深甚於夜叉語
爾時，會中有諸天子作是念：「諸夜叉言語#54.139字句所說，尚可了知；須菩提所說言語#54.140@t25p447c、論義解釋般若波羅蜜，了#54.141不可知！」
%38.174 二、須菩提明一切法如幻如化，無說者、無聽者、無知者
%38.175 （一）標宗
須菩提知諸天子心所念，語諸天子：「不解不知耶？」
諸天子言：「大德！不解不知。」
須菩提語諸天子：「汝等法應不知！我無所論說，乃至不說一字，亦無聽者。何以故？諸字非般若波羅蜜，般若波羅蜜中無聽者，諸佛阿耨多羅三藐三菩提無字無說。#54.142
%38.176 （二）舉喻
%38.177 1、如化喻
諸天子！如佛化作化人，是化人復化作四部眾──比丘、比丘尼、優婆塞、優婆夷，化人於四部眾中說法。於汝意云何？是中有說者、有聽者、有知者不？」
諸天子言：「不也！大德！」
須菩提言：「一切法皆如化，此中無說者、無聽者、無知者。
%38.178 2、如夢喻
諸天子！譬如人夢中見佛說法。於汝意云何？是中有說者、有聽者、有知者不？」
諸天子言：「不也！大德！」
須菩提語諸天子：「一切法皆如夢，無說、無聽、無知者。
%38.179 3、如響喻
諸天子！譬如二人在大深澗#54.143，各住一面，讚佛法眾，有二嚮#54.144出。於諸天子意云~1543何？是二人#54.145嚮展轉相解不？」
諸天子言：「不也！大德！」
須菩提語諸天子：「一切法亦如是，無說、無聽、無知者。#54.146
%38.180 4、如幻喻
諸天子！譬如工幻師，於四衢道中，化作佛及四部眾，於中說法。於諸天子意云何？是中有說者、有聽者、有知者不？」
諸天子言：「不也！大德！」
須菩提語諸天子：「一切諸法如幻，無說者、無聽者、無知者。」
%38.181 （貳）顯諸法、諸法性非深非妙
爾時，諸天子心念：「須菩提所說，欲令易解，轉深轉妙！」
須菩提知諸天子心所念，語諸天子言：「色非深非妙，受想行識非深非妙；色性非深非妙，受想行識性非深非妙。#54.147眼性乃至意性，色性乃至法性，眼界性乃至意界性，眼識乃至意識，眼觸乃至意觸，眼觸因緣@t25p448a生受乃至意觸因緣生受，檀波羅蜜乃至般若波羅蜜，內空乃至無法有法空，四念處乃至十八不共法，一切諸三昧門、一切陀羅尼門，乃至一切種智、一切種智性，非深非妙。」
%38.182 （參）雖說諸法而實無說者，亦無聽者、知者，依此得證三乘聖果
諸天子復作是念：「是所說法中，不說色，不說受想行識；#54.148不說眼乃至意觸因緣生受；不說檀波羅蜜乃至般若波羅蜜；不說內空乃至無法有法空；不說四念處乃至十八不共法；不說陀羅尼門、三昧門乃至一切種智；不說須陀洹果乃至阿羅漢果，不說辟支佛道，不說阿耨多羅三藐三菩提道──是法中不說名字語言。#54.149」
須菩提知諸天子心所念，語諸天子言：「如是！如是！諸天子！是法中，諸佛得#54.150阿耨多羅三藐三菩提不可說相，是中亦無說者、無聽者、無知者。
以是故，諸天子！善男子、善女人欲住須陀洹果、欲證須陀洹果者，是人不離是忍；斯陀含、阿那含、阿羅漢果、辟支佛道、佛道，欲住、欲證，不離是忍。#54.151
~1544如是，諸天子！菩薩摩訶薩從初發心，般若波羅蜜中應如是住，以無說、無聽故。」
^55.1
%39.0 壹、依幻等喻顯般若
%39.1 （壹）明「應如幻化人聽法」
爾時，諸天子心念：「應用何等人聽須菩提所說？」
須菩提知諸天子#55.2心所念，語諸天子言：「如幻化人聽法，我應用如是人。何以故？如是人無聞、無聽、無知、無證故。」#55.3
%39.2 （貳）明「諸法皆如幻如夢」
%39.3 一、眾生乃至佛道皆如幻如夢
諸天子語須菩提：「是#55.4眾生如幻#55.5、如化，聽法者亦如幻、如化耶？」
「如是！如是！諸天子！眾生如幻，聽法者亦如幻；眾生如化，聽法者亦如化。諸天子！我如幻、如夢，眾生乃至知者、見者亦如幻、如夢。諸天子！色如幻、如夢，受、想、行、識如幻、如夢，眼乃至意觸因緣生受如幻、如夢，內空乃至無法有法空、檀波羅蜜乃至般若波羅蜜如幻、如夢。諸@t25p449a天子！四念處乃至十八不共法如幻、如夢，須陀洹果如幻、如夢，斯陀含果、阿那含果、阿羅漢果#55.6、辟支佛道如幻、如夢。諸天子！佛道如幻、如夢。」
%39.4 二、涅槃乃至有法勝涅槃者亦如幻如夢
爾時，諸天子問須菩提：「汝說佛道如幻、如夢，汝說涅槃亦復如幻、如夢耶？」
~1548須菩提語諸天#55.7子#55.8：「我說佛道如幻、如夢，我說涅槃亦如幻、如夢；若當有法勝於涅槃者，我說亦復如幻、如夢。何以故？諸天子！是幻、夢、涅槃，不二不別。」#55.9
^55.2
%39.23 貳、誰能信受般若
%39.24 （壹）諸聖弟子問：般若深妙，誰能信受
爾時，慧命舍利弗、摩訶目揵#55.39連、摩訶拘絺羅、摩訶迦旃延、富樓那彌多羅尼子、摩訶迦葉及無數千菩薩問須菩提：「般若波羅蜜如是甚深、難見、難解、難知、寂滅、微妙，誰當受者？」
%39.25 （貳）阿難約世俗諦答：四種人能信受
爾時，阿難語諸大弟子及諸菩薩：「（1）阿鞞跋致諸#55.40菩薩摩訶薩，能受是甚深、難見、難解、難知、寂滅、微妙般若波羅蜜；（2）正見成就人#55.41，（3）漏盡阿羅漢，所願已滿，亦能受之；（4）復次，善男子、善女人──多見佛，於諸佛所多供養，種善根，親近善知識，有利根──是人能受。不言是法非法。」#55.42
~1551
%39.26 （參）須菩提約勝義諦答：如實觀空故能受，而信受者實不可得
%39.27 一、觀諸法空
須菩提言：「不以空分別色，不以色分別空；受、想、行、識亦如是。#55.43不以無相、無作分別色，不以色分別無相、無作；受、想、行、識亦如是。
不以無生、無滅、寂滅、離分別色，不以色分別無生、無滅、寂滅、離；受、想、行、識亦如是。
眼乃至意觸因緣生受亦如是。
檀波羅蜜乃至般若波羅蜜，內空乃至無法有法空，四念處乃至十八不共法，一切三昧門、一切陀#55.44羅尼門，須陀洹乃至阿羅漢、辟支佛、佛；一切智#55.45，不以空分別一切智、不以一切智分別空，不以空分別一切種智、不以一切種智分別空；無相、無作、無生、無滅、寂滅、離亦如是。」
%39.28 二、觀眾生空
~1552須菩提語諸天子言：「是般若波羅蜜甚深，誰能受者？是般若波羅蜜中無法#55.46可示，無法可說；若無法可示、無法可說，受人亦不可得。」
%39.29 參、般若中以無所得為方便廣演三乘法
爾時，舍利弗語須菩提言：「般若波羅蜜中廣說三乘之教及攝取#55.47菩薩之法，#55.48從初發意地乃至十地，檀波羅蜜乃至般若波羅蜜，四念處乃至八聖道分，佛十力乃至十八不共法，護持菩薩之教。菩薩摩訶薩@t25p450a如是行般若波羅蜜，常化生，不失神通，遊諸佛國#55.49，具足善根，隨其所欲，供養諸佛，即得如願，從諸佛所聽受法教，至薩婆若初不斷絕，未曾離三昧時，當得捷#55.50疾#55.51辯、利辯、不盡辯、不可斷辯、隨應辯、義辯、一切世間最上辯。」#55.52
須菩提言：「如是！如是！如舍利弗言，般若波羅蜜廣說三乘之教及護持菩薩之教，乃至菩薩摩訶薩得一切世間最上辯，不可得故。我乃至知者、見者不可得，色、受、想、行、識，檀波羅蜜乃至般若波羅蜜不可得，內空乃至無法有法空不可得，四念處乃至八聖道分、佛十力乃至一切種智亦不可得故。」#55.53
舍利弗語須菩提：「何因緣故，般若波羅蜜中廣說三乘而不可得？何因緣故，般若波羅蜜中護持菩薩？何因緣故#55.54，菩薩摩訶薩得捷疾辯乃至一切世間最上辯不可得故？」
須菩提語舍利弗言：「以內空故，般若波羅蜜廣說三乘不可得故#55.55；外空乃至無法有法空~1553故，廣說三乘不可得故#55.56。內空故，護持菩薩乃至一切世間最上辯不可得故；外空乃至無法有法空故，護持菩薩乃至一切世間最上辯不可得故。」
^55.3
%40.0 壹、諸天以化華供養，須菩提因而以化華論無生
%40.1 （壹）諸天聞須菩提說般若，以化華供養，神瑞變現成妙臺
爾時，釋提桓因及三千大千世界中四天王天乃至阿迦尼吒諸天作是念：「慧命須菩提為雨法雨，我等寧#55.97可#55.98化作華，散佛、菩薩摩訶薩、比丘僧、須菩提及般若波羅蜜上！」
釋提桓因及三千大千世界中諸天化作華，散佛、菩薩摩訶薩、比丘僧及須菩提上，亦供養般若波羅蜜。
是時，三千大千世界，華悉周遍於虛空中，化成華臺，端嚴殊#55.99妙。
%40.2 （貳）須菩提見天化華，論無生顯諸法空
須菩提心念：「是諸#55.100天子所散華，天上未曾見如是華比#55.101。是華是化華，非樹生華，是諸天子所散華，從心樹生，非樹生華。」#55.102
釋提桓因知須菩提心所念，語#55.103須菩提言：「大德！是華非生華，亦非意樹生。」#55.104
須菩提語釋提桓因言：「憍尸迦！汝言『是華非生華，亦非意樹生』。憍尸迦！是#55.105若非生法，不名為華。」#55.106
釋提桓因語須菩提言：「大德！但是華不生？色亦不生？受、想、行、識亦不生？」
須菩提言：「憍尸迦！非但是華不生，色亦不生；若不生，是不名為色。#55.107受......想#55.108......行......。識亦不生；若不生，是@t25p451b不名為識。
六入、六識、六觸、六觸因緣生諸受亦如是。
檀波羅蜜不生；若不生，是不名檀波羅蜜。乃至般若波羅蜜不生；若不生，是不名般若波羅蜜。
~1559內空不生；若不生，是不名內空。乃至無法有法空不生；若不生，是不名無法有法空。
四念處不生；若不生，是不名四念處。乃至十八不共法不生；若不生，是不名十八不共法。乃至一切種智不生；若不生，是不名一切種智。」
^55.4
~1562
%40.27 貳、不壞假名說實相，空有無二達佛智
%40.28 （壹）不壞假名說實相
%40.29 一、帝釋稱歎須菩提，如來印可並為說理
%40.30 （一）帝釋稱歎須菩提，佛印可
爾時，釋提桓因作是念：「是#55.131慧命須菩提，其智甚深，不壞假名而說諸法實#55.132相。」#55.133
佛知#55.134釋提桓因心所念，語釋提桓因言：「如是！如是！憍尸迦！須菩提其智甚深，不壞假名而說諸法實#55.135相。」
%40.31 （二）帝釋問理，佛演深義
釋提桓因白佛言：「大德須菩提，云何不壞假名而說諸法實相？」
佛告釋提桓因：「色但假名，須菩提不壞假名而說諸法實相；受、想、行、識但假名，須菩提亦不壞假名而說諸法實相。所以者何？是諸法實相，無壞不壞故，須菩提所說亦無壞不壞。#55.136眼乃至意觸因緣生諸受亦如是；檀波羅蜜乃至般若波羅蜜，內空乃至無法有法空，四念處乃至十八不共法亦如是。須陀洹果乃至阿羅漢果、辟支佛道、菩薩道、佛道，一切智、一切種智亦如是。
須陀洹乃至阿羅漢、辟支佛、佛，是但假名，須菩提不壞假名而說諸法實相。何以故？是諸法實相，無壞不壞故；須菩提所說亦無壞不壞。如是，憍尸迦！須菩提不壞假名而說諸法實相。」
%40.32 二、須菩提勸學般若──當知諸法但假名
須菩提語釋提桓因：「如是！如是！憍尸迦！如佛所說諸法但假名，菩薩摩訶薩當作是知──諸法但假名#55.137，應如是學般@t25p452b若波羅蜜。#55.138
~1563
%40.33 （貳）空有無二達佛智
%40.34 一、明學之方法
%40.35 （一）法空故不見有法可學
憍尸迦！菩薩摩訶薩作如#55.139是學，為不學色，不學受、想、行、識。何以故？不見色當可學者，不見受、想、行、識當可學者。#55.140
菩薩摩訶薩如是學，為不學檀波羅蜜。何以故？不見檀波羅蜜當可學者。
乃至不學般若波羅蜜。何以故？不見般若波羅蜜當可學者。
如是學，為不學內空乃至無法有法空。何以故？不見內空乃至無法有法空當可學者。
如是學，為不學四念處乃至十八不共法。何以#55.141故？不見四念處乃至十八不共法當可學者。
如是學，為不學須陀洹果乃至一切種智。何以故？不見須陀洹果乃至一切種智當可學者。」
爾時，釋提桓因語須菩提言：「菩薩摩訶薩何因緣故不見色乃至不見一切種智？」
   須菩提言：「色，色空；乃至一切種智，一切種智空。
   憍尸迦！色空不學色空，乃至一切種智空不學一切種智空。#55.142
%40.36 （二）以不二為方便學一切法
憍尸迦！若如是不學空，是名學空，以不二故。
是菩薩摩訶薩學色空，以不二故；乃至學一切種智空，以#55.143不二故。
若學色空不二故，乃至學一切種智空不二故，是菩薩摩訶薩能學檀波羅蜜不二故，乃至能學般若波羅蜜不二故；能學四念處不二故，乃至能學十八不共法不二故；能學須陀洹果不二故，乃至能學一切種智不二故。是菩薩能學無量無邊阿僧祇佛法。#55.144
%40.37 二、以無所學為方便學般若而成辦一切種智
%40.38 （一）明所學
~1564
%40.39 1、不為增減故學
若能學無量無邊阿僧祇佛法，是菩薩不為色增學、不為色減#55.145學，乃至不為一切種智增學、不為一切種智減學。#55.146
%40.40 2、不為受滅故學
%40.41 （1）正明
若不為色增、減學，乃至不為一切種智增、減學，是菩薩不為色受#55.147學、@t25p452c不為色滅#55.148學，亦不為受想行識受學、亦不為滅學；乃至一切種#55.149智亦不為受學、亦不為滅學。」
%40.42 （2）辨因──內外空故，無能受者、滅者，亦無一切法可受、可滅
舍利弗語須菩提：「菩薩摩訶薩如是學，不為受色學、不為滅色學，乃至一切種智亦不為受學、亦不為滅學？」
須菩提言：「菩薩#55.150摩訶薩若如是學，不為受色學、不為滅色學，乃至一切種智亦不為受學、亦不為滅學。」
「須菩提！何因緣故，菩薩摩訶薩不為受色學、不為滅色學，乃至一切種智亦不為受學、亦不為滅學？」
須菩提言：「是色不可受、亦無受色者，乃至一切種智不可受、亦無受者，內外空故。#55.151
%40.43 （3）顯益：一切法不受，能到一切種智
如是，舍利弗！菩薩摩訶薩一切法不受故，能到一切種智。」#55.152
%40.44 （二）雖學般若而無所學，雖到一切種智而無所到
%40.45 1、須菩提印可：學般若一切法不受故，能到一切種智
是時，舍利弗語須菩提：「菩薩摩訶薩如是學般若波羅蜜，能#55.153到一切種智耶？」
須菩提言：「菩薩摩訶薩如是學般若波羅蜜，能到一切種智，一切法不受故。」
~1565
%40.46 2、釋因由：一切法性空故，不見生滅、受不受等
舍利弗語須菩提：「若菩薩摩訶薩於一切法不受、不滅學者，菩薩摩訶薩云何能到一切種智？」
須菩提言：「菩薩摩訶薩行般若波羅蜜，不見色生、不見色滅；不見色受、不見色不受，不見色垢、不見色淨，不見色增、不見色減。何以故？舍利弗！色，色性空故。受......想......行......。識亦不見生、亦不見滅，亦不見受、亦不見不受，亦不見垢、亦不見淨，亦不見增、亦不見減#55.154。何以故？識，識性空故。
乃至一切種智亦不見生、亦不見滅，亦不見受、亦不見不受，亦不見垢、亦不見淨，亦不見增、亦不見減。何以故？一切種智，一切種智性空故。
%40.47 3、結成
如是，舍利弗！菩薩摩訶薩為一切法不生不滅、不受不捨、不垢不淨、不合不散、不增不減#55.155故，學般@t25p453a若波羅蜜，能到一切種智，無所學、無所到故。」#55.156
^55.5
%40.75 參、明般若於何處求
%40.76 （壹）論「文字般若」──當於「須菩提品」中求
爾時，釋提桓因語舍利弗：「菩薩摩訶薩般若波羅蜜，當於何處求？」#55.184
舍利弗言：「菩薩摩訶薩般若波羅蜜，當於須菩提品中求。」
%40.77 （貳）論「實相般若」──因佛神力說般若相
%40.78 一、明須菩提依佛神力說般若
釋提桓因語須菩提：「是汝神力使舍利弗言#55.185『菩薩摩訶薩般若波羅蜜，當於須菩提~1569品中求』？」
須菩提語釋提桓因：「非我神力。」
釋提桓因語須菩提：「是誰神力？」
須菩提言：「是佛神力。」#55.186
%40.79 二、帝釋難：一切法皆無受處，云何言是佛神力
釋提桓因言：「一切法皆無受處，#55.187何以故#55.188言『是佛神力』？#55.189離無受處相，如來不可得；離如，如來亦不可得。」
%40.80 三、須菩提答
%40.81 （一）略說
須菩提語釋提桓因言：「如是！如是！憍尸迦！離無受處相，如來不可得；離如，如來亦不可得。無受處相中如來不可得，如中如來不可得。#55.190
%40.82 （二）廣釋
%40.83 1、諸法如中不可得
色如中，如來如不可得；如來如中，色如不可得。
%40.84 2、諸法法相中不可得
色法相中，如來法相不可得；如來法相中，色法相不可得。
受、想、行、識法相中，乃至一切種智亦如是。#55.191
~1570
%40.85 3、無合散故無如來
%40.86 （1）如中無合散，離如亦無合散
憍尸迦！如來色如中不合不散，受、想、行、識如中不合不散；
如來離色如不合不散，離受、想、行、識如不合不散。#55.192
乃至一切種智亦如是。
%40.87 （2）法相中無合散，離法相亦無合散
如來色法相中不合不散，受、想、行、識法相中不合不散；
如來離色法相中不合不散，離受、想、行、識法相中不合不散。
乃至一切種智亦如是。
%40.88 （3）結成
憍尸迦！如是等一切法中不合不散，是佛神力，用無所受法故。#55.193
~1571
%40.89 （參）論「觀照般若」#55.194──直明「不即不離諸法求般若」
%40.90 一、不應即諸法、離諸法求般若，一切法無相故
如憍尸迦言：『菩薩摩訶薩般若波羅蜜，當於何處求？』
憍尸迦！不應色中求般若波羅蜜，亦不應離色求般若波羅蜜；不應受、想、行、識中求，亦不應#55.195離受、想、行、識求。#55.196何以故？是般若波羅蜜，色、受、想、行、識──是一切法皆不合、不散，無色、@t25p454a無形、無對，一相，所謂無相。#55.197
乃至一切種智中不應求般若波羅蜜，亦不應離一切種智求般若波羅蜜。何以故？是般若波羅蜜、一切種智──是一切法皆不合、不散，無色、無形、無對，一相，所謂無相。
%40.91 二、般若非即非離「諸法、如、法相」
%40.92 （一）正說
何以故？
般若波羅蜜非色、亦非#55.198離色，非受想行識、亦非離受想行識；乃至非一切種智、亦非離一切種智。#55.199
般若波羅蜜非色如、亦非離色如，非受想行識如、亦非離受想行識如。#55.200
般若波羅蜜非色法#55.201、亦非離色法，非受想行識法、亦非離受想行識法。#55.202
~1572乃至非一切種智如#55.203、亦非離一切種智如；般若波羅蜜非一切種智法、亦非離一切種智法。
%40.93 （二）明理──諸法無所有不可得
何以故？憍尸迦！是一切法皆無所有、不可得。
以無所有、不可得故，般若波羅蜜非色、亦非離色，非色如、亦非離色如，非色法、亦非離色法；乃至非一切種智、亦非離一切種智，非一切種智如、亦非離一切種智如，非一切種智法、亦非離一切種智法。」
^55.6
~1581
%40.180 肆、稱歎般若
%40.181 （壹）天主歎般若
%40.182 一、正歎
釋提桓因語須菩提：「是摩訶波羅蜜，是菩薩摩訶薩般若波羅蜜！無量波羅蜜、無邊波羅蜜，是#55.273菩薩摩訶薩般若波羅蜜！
%40.183 二、釋歎
諸須陀洹、須陀洹果#55.274，從是般若波羅蜜中學成；乃至諸阿羅漢、阿羅漢果，諸辟支佛、辟支佛道，諸菩薩摩訶薩，皆從是般若波羅蜜中學成；成就眾生、淨佛世界#55.275、得阿耨多羅三藐三菩提，皆從是學成。」#55.276
%40.184 （貳）須菩提述成
%40.185 一、印可
須菩提語釋提桓因言：「如是！如是！憍尸迦！是摩訶波羅蜜，是菩薩摩訶薩般若波羅蜜。
無量波羅蜜、無邊波羅蜜，是菩薩摩訶薩般若波羅蜜。
從是中學成須陀洹果乃至阿羅漢果、辟支佛道、諸菩薩摩訶薩；從是般若波羅蜜中學成成就眾生、淨佛世界、得阿耨多羅三藐三菩提──已得、今得、當得。
%40.186 二、廣演
%40.187 （一）述「摩訶」歎
憍尸迦！色大故，般若波羅蜜亦大。何以故？是色前際不可得，後際不可得，中際不可得。
受、想、行、識大故，般若波羅蜜亦大。何以故？受、想、行、識前際#55.277不可得，後際不可得，中際不可得。
乃至一切種智亦如是。
以是因緣故，憍尸迦！是摩訶波羅蜜，是菩薩摩訶薩般若波羅蜜。
%40.188 （二）述「無量」歎
憍尸迦！色無量故，般若波羅蜜無量。何以故？色量不可得故。
憍尸迦！譬如虛空量不可得，色亦如是量不可得。
~1582虛空無量故，色無量；色無量故，般若波羅蜜無量。
受、想、行、識，乃至一切種智無量故，般若波羅蜜無量。何以故？一切種智量不可得。
譬如虛空量不可得，一切@t25p456a種智亦如是量不可得。
虛空無量故，一切種智無量；一切種智無量故，般若波羅蜜無量。
以是因緣故，是菩薩摩訶薩般若波羅蜜無量。
%40.189 （三）述「無邊」歎
%40.190 1、於三世中不可得故
憍尸迦！色無邊故，諸菩薩摩訶薩般若波羅蜜無邊。何以故？憍尸迦！色前際不可得，後際不可得，中際不可得。受、想、行、識無邊故，般若波羅蜜無邊。何以故？受想行識前際、後際、中際皆不可得故。乃至一切種智無邊故，般若波羅蜜無邊。何以故？一切種智前、後、中際不可得故。#55.278
以是因緣故，憍尸迦！是般若波羅蜜無邊。色無邊#55.279，乃至一切種智無邊。
%40.191 2、緣無邊故
復次，憍尸迦！緣無邊故，般若波羅蜜無邊。」
「須菩提！云何緣無邊故般若波羅蜜無邊？」
須菩提言：「緣一切無邊法故，般若波羅蜜無邊。」
「云何緣一切無邊法故般若波羅蜜無邊？」
須菩提言：「緣無邊法性故，般若波羅蜜無邊。
復次，憍尸迦！緣無邊如故，般若波羅蜜無邊。」
釋提桓因言：「云何緣無邊如故般若波羅蜜無邊？」
須菩提言：「如無邊故，緣亦無邊；緣無邊故，如亦無邊。
以是因緣故，諸菩薩摩訶薩般若波羅蜜無邊。#55.280
~1583
%40.192 3、眾生無邊故
復次，憍尸迦！眾生無邊故，般若波羅蜜無邊。」
釋提桓因問須菩提：「云何眾生無邊故般若波羅蜜無邊？」
須菩提言：「於汝意云何？何等法名『眾生』？」
釋提桓因言：「無有法名『眾生』，假名故為『眾生』；是名字本無有法，亦無所趣，強為作名。」
「憍尸迦！於汝意云何？是般若波羅蜜中說眾生有實不？」
釋提桓因言：「無也！」
「憍尸迦！若般若波羅蜜中#55.281實不說#55.282，眾生無邊亦不可得。#55.283
憍尸迦！於汝意云何？@t25p456b佛#55.284恒河沙劫壽#55.285說眾生、眾生#55.286名字，頗有眾生法有生有滅不？」#55.287
釋提桓因言：「不也！何以故？眾生從本已來常清淨故。」
「以是因緣故，憍尸迦！眾生無邊故，當知般若波羅蜜亦無邊。」
^56.1
%41.0 壹、般若畢竟空而有三乘，有三乘而不著心@yE010p304
%41.1 （壹）諸天稱歎
%41.2 一、諸天歎須菩提承佛恩說般若
爾時，諸天王及諸天、諸梵王及諸梵天、伊賒那#56.3天及神仙并諸天女同時三反#56.4稱歎：「快#56.5哉！快哉！慧命須菩提所說法，皆是佛出世間因緣恩力，演布#56.6是教。
%41.3 二、歎行般若人#56.7
%41.4 （一）行般若而不遠離者，諸天視之如佛
若有菩薩摩訶薩行是般若波羅蜜不遠離者，我輩視是人如佛。
%41.5 （二）般若雖畢竟空而有三乘之教
何以故？是般若波羅蜜中，雖無法可得，所謂色、受、想、行、識乃至一切種智，而有三乘之教──聲#56.8聞#56.9、辟支佛#56.10、佛乘。#56.11」
%41.6 （貳）佛述成諸天所歎，更說因緣，並舉本生事為證
%41.7 一、佛述成諸天所歎
爾時，佛告諸天子：「如是！如是！諸天子！如汝所言：是般若波羅蜜中，雖無法可得，而有三乘之教，所謂聲聞、辟支佛、佛乘。
~1588諸天子！若有#56.12菩薩摩訶薩行是般若波羅蜜不遠離者，視是人當如佛，以無所得故。何以故？是般若波羅蜜中，廣說三乘之教，所謂聲聞#56.13、辟支佛#56.14、佛乘。
%41.8 二、諸法中佛不可得，離諸法佛亦不可得；能如是學之菩薩，當視之如佛
檀波羅蜜中佛不可得，離檀波羅蜜佛亦不可得；乃至般若波羅蜜中佛不可得，離般若波羅蜜佛亦不可得。內空乃至無法有法空、四念處乃至十八不共法、一切種智亦如是。」#56.15
佛語諸天子：「菩薩摩訶薩若能學#56.16是一切法#56.17，所謂#56.18檀波羅蜜乃至一切種智，以是事故，當視是菩薩摩訶薩如佛。
%41.9 三、舉本生事為證#56.19
諸天子！我昔於然燈佛時，華嚴城內，四衢#56.20道頭#56.21，見佛聞法，即得不離檀波羅蜜行，不離尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜行；不離內@t25p457b空乃至無法有法空，四念處乃至八聖道分；不離四禪、四無量心、四無色定、一切三#56.22昧門、一切陀#56.23憐#56.24尼門；不離四無所畏、佛十力、四無礙智、十八不共法、大慈大悲及餘無量諸佛法行，亦無所得故#56.25。
是時，然燈佛記我當來世過一阿僧祇劫當作佛，號釋迦牟尼多陀阿伽度#56.26、阿羅訶#56.27、~1589三藐三佛陀#56.28、鞞侈遮羅那#56.29、脩伽度#56.30、路迦憊#56.31、無上士#56.32、調御丈夫#56.33、天人師、佛#56.34、世尊#56.35。」#56.36
~1590
%41.10 （參）諸天領解重讚：般若令菩薩得薩婆若，於諸法不取不捨
爾時諸天子白佛言：「世尊！希有！是般若波羅蜜，能令諸菩薩摩訶薩得薩婆若，於色不取不捨#56.37故，於受、想、行、識不取不捨故，乃至一切種智不取不捨故。」#56.38
^56.2
%41.24 貳、讚般若功德
%41.25 （壹）明應機之眾──帝釋天主
爾時，佛觀四眾和合──比丘、比丘尼、優婆塞、優婆夷，及諸菩薩摩訶薩，并四天王天#56.49乃至阿迦尼吒諸天，皆會#56.50坐。
普觀已，佛告釋提桓因：「憍尸迦！
%41.26 （貳）聞持般若得種種功德
%41.27 一、魔不能得便──自行、教他般若，不離薩婆若心，知諸法不可得故
若#56.51菩薩摩訶薩、若比丘、若#56.52比丘尼、若優婆塞、若優婆夷、若諸天子、若諸天女，~1592是#56.53般若波羅蜜，若聽、受持、親近、讀、誦、為他說、正憶念，不離薩婆若心，諸天子！是人，魔、若魔天不能得其便#56.54。#56.55
何以故？是善男子、善女人諦了知色空，空不能得空便，無相不能得無相便，無作不能得無作便；諦了知受、想、行、識空，空不能得空便，乃至無作不能得無作便；乃至諦了知一切種智空，空不能得空便，乃至無作不能得無作便。
何以故？是諸法#56.56自性不可得，無事可得便，誰受惱者？#56.57
%41.28 二、人非人等不得其便──以無所得修四無量心故
復次，憍尸迦！是善男子、善女人，若人、非#56.58人不能得其便。
何以故？是善男子、善女人，一切眾生中善修慈心、悲喜捨心，以無所得故。
%41.29 三、終不橫死──等心施眾生故
憍尸迦！是善男子、善女人終不橫死#56.59。何以故？是善男子、善女人@t25p458a行檀波羅蜜，於一切眾生等心供給故。
%41.30 四、諸天有發無上道心者，應深心聽聞受持般若
復次，憍尸迦！三千大千世界，四天王天、三十三天、夜摩天、兜率陀天、化樂#56.60天、他化自在天，梵天、光音天、遍淨天、廣果天──是諸天中有發阿耨多羅三藐三菩提心者，未聞是般#56.61若波羅蜜，未受持、親近，是諸天子今應聞、受持、親近、讀、誦、正憶念，不離薩婆若心。
%41.31 五、行般若者住於三處無畏──以無所得明十八空故
復次，憍尸迦！諸善男子、善女人聞是般若波羅蜜，受持、親近、讀、誦、正憶念，不離薩婆若心，是諸善男子、善女人，若在空舍、若在曠#56.62野#56.63、若人住處，終不怖畏。
何以故？是諸#56.64善男子、善女人明於內空，以無所得故；明於外空乃至無法有法空，以無所得故。」
^56.3
%41.81 參、諸天發願，常守護受持般若之菩薩
%41.82 （壹）以菩薩因緣故有人天善業善果及三乘聖行聖果，諸天誓願守護#56.123
%41.83 一、諸天發願守護受持般若之菩薩
爾時，三千大千世界中諸四天王天、三十三天、夜摩天、兜率陀天、化樂天、他化自在天乃至首陀婆#56.124諸天白佛言：「世尊！是善男子、善女人能受持般若波羅蜜，親近、讀、誦、正憶@t25p459c念，亦#56.125不離薩婆若心者，我等常當守護！
%41.84 二、釋應守護菩薩之原因
何以故？世尊！
%41.85 （一）因菩薩因緣故斷三惡道及斷善道中諸不如意事
以菩薩摩訶薩因緣故，斷三惡道，斷天人#56.126貧，斷諸災患、疾病、飢餓。#56.127
~1600
%41.86 （二）因菩薩故有世間及出世間諸善法
以菩薩因緣故，便有十善道出世間，四禪、四無量心、四無色定，檀波羅蜜、尸羅#56.128波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜，內空乃至無法有法空，四念處乃至一切種智。
%41.87 （三）因菩薩故有人天善果
以菩薩因緣故，世間便有生剎利大姓、婆羅門大姓、居士大家，諸王及轉輪聖王，四天王天乃至阿迦尼吒天。
%41.88 （四）因菩薩故有二乘聖者、二乘果
以菩薩因緣故，有須陀洹、須陀洹果，乃至阿羅漢、阿羅漢果，辟支佛、辟支佛道。
%41.89 （五）因菩薩故有三寶出現於世
以菩薩因緣故，有成就眾生、淨佛世界#56.129，便有諸佛出現於世，便有轉法輪，知#56.130有#56.131佛寶、法寶、比丘僧寶。
%41.90 三、結：應守護
世尊！以是因緣故，一切世間諸天及人、阿脩羅應守護是菩薩摩訶薩。」
%41.91 （貳）佛述成，更說菩薩之勝德
%41.92 一、佛述成
佛語釋提桓因#56.132：「如是！如是！憍尸迦！以菩薩摩訶薩因緣故，斷三惡道乃至三寶出現於世。以是故，諸天及人、阿修羅常應守護、供養、恭敬、尊重、讚歎是菩薩摩訶薩。
%41.93 二、佛更說菩薩之勝德
%41.94 （一）供養行般若之菩薩，即是供養佛
憍尸迦！供養、恭敬、尊重、讚歎是菩薩摩訶薩，即是供養我。以是故，是諸菩薩摩訶薩，諸天及人、阿修羅常應守護、供養、恭敬、尊重、讚歎。
%41.95 （二）供養二乘不如供養初發心菩薩
憍尸迦！若三千大千世界滿中聲聞、辟支佛，譬如竹𥯤#56.133、稻、麻、叢林，若有善男子、善女人供養、恭敬、尊重、讚歎，不如供養、恭敬、尊重、讚歎初發心菩薩~1601摩訶薩不離六波羅蜜所#56.134得福德。
何以故？不以聲聞、辟支佛因緣故有菩薩摩訶薩及諸佛出現於世，以有菩薩摩訶薩因緣故有聲聞、辟支佛、諸佛出現於世。
以是故，憍尸迦！是諸@t25p460a菩薩摩訶薩，一切世間諸天及人、阿修羅常應守護、供養、恭敬、尊重、讚歎。」
^56.4
%42.0 壹、明受持般若得今世及後世功德
%42.1 （壹）帝釋稱歎受持般若功德
%42.2 一、明受持般若得今世功德
爾時釋提桓因白佛言：「世尊！甚奇希有！諸菩薩摩訶薩，是#56.151般若波羅蜜，若聞、受持、親@t25p460b近、讀、誦、為他人#56.152說、正憶念時，得如是今世功德；亦成就眾生、淨佛世界；從一佛界#56.153至一佛界，供養諸佛；所欲供養之具，隨意即得；從諸佛聞法，至得阿耨多羅三藐三菩提，終不中忘；亦得家成就、母成就、生成就、眷屬成就、相成就、光明成就、眼#56.154成就、耳成就、三昧成就、陀羅尼成就。#56.155
是菩薩以方便力變身如佛，從一界#56.156至一界，到無佛處，讚檀波羅蜜乃至般若波羅蜜，讚四禪、四無量心、四無色定，讚四念處乃至十八不共法；以方便力說法，以三乘法度脫眾生，所謂聲聞、辟支佛、佛乘。
%42.3 二、受持般若總攝五度乃至一切種智等功德
世尊！快哉！希有！受是般若波羅蜜，為已#56.157總攝五波羅蜜乃至十八不共法，亦攝須陀洹果乃至阿羅漢果、辟支佛道、佛道、一切智、一切種智。」
%42.4 （貳）如來述成，更廣說今世及後世功德
%42.5 一、如來述成
佛告釋提桓因：「如是！如是！憍尸迦！受是般若波羅蜜，為已總攝五波羅蜜乃至一切種智。
%42.6 二、更廣說今世及後世功德
%42.7 （一）初說二世功德
%42.8 1、明今世功德
~1604
%42.9 （1）佛勸諦聽，天主領受
復次，憍尸迦！是般若波羅蜜，受持、親近、讀、誦、為他#56.158說、正憶念，是善男子、善女人所得今世功德，汝一心諦聽！」
釋提桓因言：「唯！世尊！受教！」
%42.10 （2）正明：外道梵志、魔、增上慢人欲壞菩薩般若，終不從願
佛告釋提桓因：「憍尸迦！若有外道諸梵志、若魔、若魔民、若增#56.159上慢人欲乖#56.160錯#56.161破壞菩薩般若波羅蜜心，是諸人適生此心，即時滅去，終不從願。#56.162
%42.11 （3）釋因由：菩薩無量世自行化他故
%42.12 A、自行六度，亦安立眾生於六度
何以故？憍尸迦！菩薩摩訶薩長夜行檀波羅蜜，行尸羅#56.163、羼提#56.164、毘梨耶#56.165、禪#56.166、般若波羅蜜。
以眾生長夜貪諍故，菩薩悉捨內外物#56.167，安立眾生於檀波羅蜜中；
以眾生長夜破戒故，菩薩悉捨內外法，安立眾生於戒；
以眾生長夜鬪諍故，菩薩悉捨內外法，安立眾生於忍辱；
以眾生長夜懈怠故，菩薩悉捨內@t25p460c外法，安立眾生於精進；
以眾生長夜亂心故，菩薩悉捨內外法，安立眾生於禪；
以眾生長夜愚癡故，菩薩悉捨內外法，安立眾生於般若波羅蜜。
%42.13 B、以方便力，安立眾生於諸禪定、三十七道品、三三昧、三乘
以眾生長夜為愛結故流轉生死，是菩薩摩訶薩以方便力故#56.168，斷眾生愛結，安立#56.169於四禪、四無量心、四無色定、四念處乃至八聖道分、空無相無作三昧，安立眾生於須陀洹果乃至阿羅漢果、辟支佛道、佛道。
憍尸迦！是為菩薩摩訶薩行般若波羅蜜，得現世功德。
%42.14 2、明後世功德
後世功德──得阿耨多羅三藐三菩提；菩薩轉法輪，所願滿足，入無餘涅槃。
憍尸迦！是為菩薩摩訶薩後世功德。#56.170
~1605
%42.15 （二）重明今世功德
%42.16 1、魔、外道、增上慢人等不得便
%42.17 （1）舉喻明理
%42.18 A、正說
復次，憍尸迦！善男子、善女人，是般若波羅蜜，若聞、受持、親近、讀、誦、為他說、正憶念，其所住處，魔、若魔民、若外道梵志、增上慢人欲輕毀、難問、破壞般若波羅蜜，終不能成；其人惡心轉滅、功德轉增，聞是般若波羅蜜故，漸以三乘道，得盡眾苦。
%42.19 B、舉喻
譬如，憍尸迦！有藥名摩祇，有蛇飢行索食，見虫欲噉#56.171；虫趣藥所，藥氣力故，蛇不能前，即便還去。何以故？是藥力能勝毒故。
%42.20 C、合法
憍尸迦！摩祇藥有如是力。是#56.172善男子、善女人，是般若波羅蜜，若受持、親近、讀、誦、為他#56.173說、正憶念；若有種種鬪諍起，欲來破壞者，以般若波羅蜜威力故，隨所起處，即疾#56.174消滅；其人即生善心，增益功德。
%42.21 （2）釋因由：般若能滅諸法諍亂故
何以故？是般若波羅蜜能滅諸法諍亂。何等諸法？所謂──
（1）婬、怒、癡；無明乃至大苦聚；
（2）諸蓋、結、使、纏；
（3）我見、人見、眾生見，斷見、常見，垢見、淨見，有見、無見──如是一切諸見；
（4）慳貪、犯戒、瞋恚、懈怠、亂意、無智；
（5）常想、樂想、淨想、我想──如是等@t25p461a愛行。
（6）著色，著受、想、行、識；
（7）著檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜；
（8）著內空、外空、內外空，乃至無法有法空；
（9）著四念處乃至十八不共法；著一切智、一切種智；著涅槃。
是一切法諍亂，盡能#56.175滅，不令增長。
^56.5
%42.47 2、諸天及諸佛守護，諸惡滅、眾善增
%42.48 （1）諸天及諸佛守護
復次，憍尸迦！三千大千世界中，諸四天王天#56.213、諸釋提桓因、諸梵天王乃至阿~1609迦尼吒天常守護是善男子、善女人──能受持、供養、讀、誦、為他#56.214說、正憶念般若波羅蜜者，十方現在諸佛亦共#56.215擁護是善男子、善女人──能聞、受持、供養、讀、誦、為他說、正憶念般若波羅蜜者。
%42.49 （2）諸惡滅、眾善增#56.216
%42.50 A、所言人皆信受
是善男子、善女人，@t25p461c不善法滅，善法轉增──所謂檀波羅蜜轉增，以無所得故；乃至般若波羅蜜轉增，以無所得故；內空轉增乃至無法有法空轉增，以無所得故；四念處乃至十八不共法轉增，以無所得故；諸三昧門、諸陀羅尼門、一切智、一切種#56.217智轉增，以無所得故。
是善男子、善女人所說，人皆信受。
%42.51 B、親友堅固@yE010p304
親友堅固；
%42.52 C、不說無益語
不說無益之語；
%42.53 D、不為惑覆@yE010p304
不為瞋恚所覆，不為憍慢、慳#56.218貪、嫉妬所覆#56.219。#56.220
%42.54 3、以四種正行（自行、教他、讚歎、隨喜）修一切善法
%42.55 （1）十善
是人自不殺生，教人不殺生#56.221，讚不殺生法，亦歡喜讚歎不殺生者；自遠離不與取，亦教人遠離不與取，讚遠離不與取法，亦歡喜讚歎遠離不與取者；自不邪婬，教人不邪婬，讚#56.222不邪婬法，亦歡喜讚歎不邪婬者；自不妄語，教人不妄語，讚不妄語法#56.223，亦歡喜讚歎不妄語#56.224者；兩舌、惡口、無利益語亦如是。自不貪，教人不貪，讚不貪法，亦歡喜讚歎不貪者；不瞋惱、不邪見亦如是。#56.225
~1610
%42.56 （2）六度
自行檀波羅蜜，教人行檀波羅蜜，讚行檀波羅蜜法，亦歡喜讚歎行檀波羅蜜者；自行尸羅波羅蜜，教人行尸羅波羅蜜，讚尸羅波羅蜜，亦歡喜讚歎行尸羅波羅蜜者；自行羼提波羅蜜，教人行羼提波羅蜜，讚#56.226羼提波羅蜜#56.227，亦歡喜讚歎行羼提波羅蜜者；自行毘梨耶波羅蜜，教人行毘梨耶波羅蜜，讚毘梨耶波羅蜜，亦歡喜讚歎行毘梨耶波羅蜜者；自行禪波羅蜜，教人行禪波羅蜜，讚禪波羅蜜，亦歡喜讚歎行禪波羅蜜者；自行般若波羅蜜，教人行般若波羅蜜，讚般若波羅蜜，亦歡喜讚歎行般若波羅蜜者。
%42.57 （3）十八空
自修內空，教人修內空，讚#56.228@t25p462a內空#56.229，亦歡喜讚歎修內空者；乃至自修無法有法空，教人修無法有法空，讚無法有法空，亦歡喜讚歎修無法有法空者。
%42.58 （4）一切三昧、陀羅尼、四禪、四無量心、四無色定
自入一切三昧中，教人入一切三昧中，讚#56.230一切三昧#56.231，亦歡喜讚歎入#56.232一切三昧者。
自得陀羅尼，教人得陀羅尼，讚#56.233陀羅尼#56.234，亦歡喜讚歎得陀羅尼者。
自入初禪，教人入初禪，讚初禪#56.235，亦歡喜讚歎入初禪者；二禪、三禪、四禪亦如是。
自入慈心中，教人入慈心中#56.236，讚慈心#56.237，亦歡喜讚歎入慈心者；悲、喜、捨心亦如是。
自入無邊空處，教人入無邊空處，讚#56.238無邊空處#56.239，亦歡喜讚歎入無邊空處者；無邊識處、無所有處、非有想非無想處亦如是。
%42.59 （5）三十七菩提分
自修四念處，教人修四念處，讚四念處#56.240，亦歡喜讚歎修四念處者；四正勤、四如意足、五根、五力、七覺#56.241分、八聖道分亦如是。
~1611
%42.60 （6）三三昧、八解脫、九次第定
自修空、無相、無作三昧，教人修空、無相#56.242、無作#56.243三昧，讚#56.244空、無相、無作三昧#56.245，亦歡喜讚歎修空、無相、無作三昧者；
自入八解脫#56.246中，教人入八解脫，讚八解脫，亦#56.247歡喜讚歎入八解脫者；
自入九次第定中，教人入九次第定，讚九次第定，亦#56.248歡喜讚歎入九次第定者。
%42.61 （7）佛果德
自修佛十力、四無所畏、四無礙智、大慈大悲、十八不共法亦如是；
自行不謬錯法、自行#56.249常捨法，教人行不謬錯法、常捨法，讚#56.250不謬錯法、常捨法，亦歡喜讚歎行不謬錯法、常捨法者。#56.251
自得一切種智，教人得一切種智，讚#56.252一切種智，亦歡喜讚歎得一切種智者。
%42.62 4、攝一切善法入六度中，所得果報與眾生共，並迴向無上菩提
%42.63 （1）以無所得行六度，所得果報與眾生共，迴向無上菩提
是菩薩摩訶薩行六波羅蜜時，所有布施與眾生共已，迴向阿耨多羅三藐三菩@t25p462b提，以無所得故；所有持戒、忍辱、精進、禪定、智慧，與眾生共已，迴向阿耨多羅三藐三菩提，是亦#56.253無所得故。#56.254
%42.64 （2）思惟不行六度之過患
%42.65 A、不行六度則不能成就眾生、淨佛世界，亦不能得一切種智
是善男子、善女人如是行六波羅蜜時，作是念：
『我若不布施，當生貧窮家，不能成就眾生、淨佛世界，亦不能得一切種智。
我若不持戒，當生三惡道中，尚不得人身，何況能成就眾生、淨佛世界、得一切種智！
~1612我若不修忍辱，則當諸根毀壞，色不具足，不能得菩薩具足色身──眾生見者必至阿耨多羅三藐三菩提，亦不能得以具足色身成就眾生、淨佛世界、得一切種智。
我若懈怠，不能得菩薩道，亦不能得成就眾生、淨佛世界、得一切種智。
我若亂心，不能得生諸禪定，不能以此禪定成就眾生、淨佛世界、得一切種智。
我若無智，不能得方便智#56.255、以方便智過聲聞辟支佛地、成就眾生、淨佛#56.256世界、得一切種智。』
%42.66 B、若隨六蔽則不能具足六度，終不得成佛道
是菩薩復作是思惟：『我不應隨慳貪故不具足檀波羅蜜，不應隨犯戒故不具足尸羅波羅蜜，不應隨瞋恚故不具足羼提波羅蜜，不#56.257應隨懈#56.258怠故不具足毘梨耶波羅蜜，不應隨#56.259亂意故不具足禪波羅蜜，不應隨癡心故不具足般若波羅蜜。
若不具足檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜，我終不能出到一切種智。』
%42.67 （三）結：得今世、後世功德
如是善男子、善女人，是般若波羅蜜受持、親近、讀、誦、為他說、正憶念，亦不離薩婆若心，得是今世、後世功德。」
%42.68 貳、明無方便行及有方便行
%42.69 （壹）略說
釋提桓因白佛言：「世尊！希有！是菩薩摩訶薩般若波羅蜜，為迴向薩#56.260婆#56.261若心#56.262故，亦為不高心故。」
%42.70 （貳）詳辨
%42.71 一、佛問
佛告釋提桓因：「憍尸@t25p462c迦！云何『菩#56.263薩摩訶薩般若波羅蜜，為迴向薩婆若心故，亦為不高心故』？」
%42.72 二、天主答
%42.73 （一）明無方便行
釋提桓因白佛言：「世尊！菩薩摩訶薩若行世間檀波羅蜜，布施諸佛#56.264、辟支佛、聲~1613聞及諸貧窮#56.265、乞匂#56.266、行路人，是菩薩無方便故生高心；若行世間尸羅波羅蜜，言#56.267：『我行尸羅波羅蜜，我能具足尸羅波羅蜜。』無方便故生高心；言：『我行羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜；我行般若波羅蜜，我修般若波羅蜜。』以是世間般若波羅蜜，無方便故生高心。
世尊！菩薩修世間四念處時，自念言：『我修四念處，我具足四念處。』無方便力故生高心。
『我修四正懃、四如意足、五根、五力、七覺分、八聖道分。』自念言：『我修空、無相、無作三昧；我修一切三昧門，當得一切陀羅尼門。』
『我修佛十力、四無所畏、十八不共法；我當成就眾#56.268生，我當淨佛世界，我當得一切種智。』著吾我無方便力故生高心。
世尊！如是菩薩摩訶薩行世間善法#56.269，著吾我故生高心。
%42.74 （二）明有方便行
世尊！若菩薩摩訶薩行出世間檀波羅蜜，不得施者，不得受者，不得施物，如是菩薩摩訶薩行出世間檀波羅蜜，為迴向薩婆若故，亦不生高心；行尸羅波羅蜜，尸羅不可得；行羼提波羅蜜，羼提不可得；行毘梨耶波羅蜜，毘梨耶不可得；行禪波羅蜜，禪不可得；行般若波羅蜜，般若不可得；修四念處，四念處不可得；乃至修十八不共法，十八不共法不可得；修大慈大悲，大慈大悲不可得；乃至修一切種智，一切種智不可得。
世尊！如是菩薩摩訶薩般若波羅蜜，為迴向薩婆若故，@t25p463a亦為不生高心故。」
^57.1
%43.0 壹、再明受持般若的利益
%43.1 （壹）不為刀箭所傷#57.4
%43.2 一、正明
爾時佛告釋提桓因#57.5：「若有善男子、善女人聞是深般若波羅蜜，受持、親近、讀、誦、正憶念，不離薩婆若心，兩陣戰時，是善男子、善女人誦般若波羅蜜故，入軍陣中，終不失命，刀箭不傷。
%43.3 二、釋因由：能離自他煩惱刀箭故
何以故？是善男子、善女人長夜修行六波羅蜜，自除婬欲刀箭，亦除他人婬欲刀箭；自除瞋恚刀箭，亦除他人瞋恚刀箭；自除愚癡刀箭，亦除他人愚癡刀箭；自除邪見刀箭，亦除他人邪見刀箭；自除纏垢刀箭，亦@t25p463b除他人纏垢刀箭；自除諸結使刀箭，亦除他人結使刀箭。
%43.4 三、結成
憍尸迦！以是因緣，是善男子、善女人不為刀箭所傷。
%43.5 （貳）不為水火眾惡所傷
%43.6 一、正明
復次，憍尸迦！是善男子、善女人聞是深般若波羅蜜，受持、親近、讀、誦、正憶念，不離#57.6薩婆若心，若以毒藥薰、若以蠱道#57.7、若以火坑、若以深水、若欲刀殺、若與#57.8毒，~1617如是眾惡皆不能傷。
%43.7 二、釋因由
%43.8 （一）般若是大明呪，於般若中學，能離諸惱
 何以故？是般若波羅蜜是大明呪、是無上呪。
 若善男子、善女人於是明呪中學，自不惱身，亦不惱他，亦不兩惱。
%43.9 （二）人與法皆不可得故，能離諸惱
何以故？是善男子、善女人不得我、不得眾生、不得壽命，乃至知者、見者皆不可得；#57.9不得#57.10色、受、想、行、識，乃至一切種智亦不可得。以不可得故，不自惱身，亦不惱他，亦不兩惱。
%43.10 三、得益：三世諸佛學大明咒皆得無上菩提
學是大明呪故，得阿耨多羅三藐三菩提；觀一切眾生心，隨意說法。
何以故？過去諸佛學是大明呪，得阿耨多羅三藐三菩提；當來諸佛學是大明呪，當得阿耨多羅三藐三菩提；今現在諸佛學是大明呪，得阿耨多羅三藐三菩提。
%43.11 （參）但書寫供養般若，人、非人不得其便
%43.12 一、正明
復次，憍尸迦！般若波羅蜜，若有但書寫經卷，於舍供養，不受、不讀#57.11，不誦、不說、不正憶念，是處若人、若非人不能得其便。#57.12
%43.13 二、釋因由：諸天守護般若故
何以故？是般若波羅蜜，為三千大千世界中四天王諸天乃至阿迦尼吒#57.13諸天子，及十方無量阿僧祇世界中諸四天王天乃至阿迦尼吒諸天所守護故。是般若波羅蜜所止處，諸天皆來供養、@t25p464a恭敬、尊重、讚歎，禮拜已去。是善男子、善女人，是般若波羅蜜，但書寫經卷，於舍供養，不受、不讀、不誦、不說、不正憶念，今世得如是功德。#57.14
~1618
%43.14 三、舉菩提樹為證
譬如若人、若畜生來入菩提樹下，諸邊內外；設人、非人來，不能得其便。#57.15
何以故？是處，過去諸佛於中得阿耨多羅三藐三菩提，未來諸佛、現在諸佛亦於中得阿耨多羅三藐三菩提；得佛已，施一切眾生無恐無畏，令無量阿僧祇眾生受天上、人中福樂，亦令無量阿僧祇眾生得須陀洹果，乃至得阿耨多羅三藐三菩提。以般若波羅蜜力故，是處得恭敬、禮拜，華香、瓔珞#57.16、擣#57.17香#57.18、澤香#57.19、幢蓋、伎#57.20樂供養。
^57.2
~1620
%43.30 貳、校量功德
%43.31 （壹）以「供養般若」與「供養舍利」校量
%43.32 一、明「供養般若」勝「供養舍利」
%43.33 （一）天主問：「供養般若」與「供養舍利」，何者得福多
釋提桓因白佛言：「世尊！若善男子、善女人書寫般若波羅蜜，華香、瓔珞乃至伎樂供養；若有人，佛般涅槃後，若供養舍利，若起塔供養、恭敬、尊重、讚歎，華香、瓔珞乃至伎樂供養──是二何者得福多？」
%43.34 （二）佛反問令天主答
%43.35 1、佛反問：佛之一切種智及相好身依何法修學而得
佛告釋提桓因：「我還問汝，隨汝意答我。於汝意云何？如佛得一切種智及得是身，從何道學，得是一切種智、得是身？」#57.36
%43.36 2、天主答：依般若修學而得
釋提桓因白佛言：「佛從般若波羅蜜中學，得一切種智及相好身。」#57.37
%43.37 （三）佛述成，並顯「供養般若」勝「供養舍利」
%43.38 1、般若為本，舍利為末
%43.39 （1）不以相好身名為佛，得一切種智方名為佛
佛告釋提桓因：「如是！如是！憍尸迦！佛從般若波羅蜜中學，得@t25p464c一切種智。
憍尸迦！不以是身名為佛，得一切種智故名為佛。
憍尸迦！是佛一切種智從般若波羅蜜中生。#57.38
%43.40 （2）佛身是一切種智所依處，故佛涅槃後應供養舍利
以是故，憍尸迦！是佛身，一切種智所依處，佛因是身得一切種智。
善男子當作是思惟：『是身，一切種智所依處。』是故我涅#57.39槃後舍利，當得供養。#57.40
~1621
%43.41 2、「供養般若」勝「供養舍利」
%43.42 （1）供養般若即供養一切種智
復次，憍尸迦！善男子、善女人若聞是般若波羅蜜，書寫、受持、親近、讀、誦、正憶念，華香、瓔珞、擣香、澤香、幢蓋、伎樂，恭敬、供養、尊重、讚歎，是善男子、善女人則為供養一切種智。
%43.43 （2）供養般若得福勝供養舍利
以是故，憍尸迦！若有善男子、善女人書是般若波羅蜜，若受持、親近、讀、誦、說、正憶念、供養、恭敬、尊重、讚歎，華香、瓔珞乃至伎樂；若復有善男子、善女人，佛般涅槃後，供養舍利，起塔，恭敬、尊重、讚歎，華香乃至伎樂。若有善男子、善女人，是般若波羅蜜，書、持、供養、恭敬、尊重、讚歎，華香、瓔珞乃至伎樂，是人得福多！
%43.44 （3）釋因由#57.41
何以故？
是般若波羅蜜中生五波羅蜜，生內空乃至無法有法空；四念處乃至十八不共法，一切三昧、一切禪定、一切陀羅尼，皆從般若波羅蜜中生；
成就眾生、淨佛世界，皆從般若波羅蜜中生；
菩薩家成就、色成就、資生之物成就、眷屬成就、大慈大悲成就，皆從般若波羅蜜中生；#57.42
剎利大姓、婆羅門大姓、居士大家，皆從是般若波羅蜜中生；
四天王天乃至阿迦尼吒天，須陀洹乃至阿羅漢、辟支佛、諸菩薩摩訶薩、諸佛，諸佛一切種智，皆從是般若波羅蜜中生。」
%43.45 二、釋疑：供養般若得福甚多，云何閻浮提人不供養
%43.46 （一）天主問
爾時，釋提桓因白佛言：「世尊！閻浮提人不供養般若波羅蜜，不恭敬、不尊重、不讚歎，為不知供養多@t25p465a所利益耶？」
%43.47 （二）佛答#57.43
%43.48 1、佛反問答
%43.49 （1）第一反問答──閻浮提中幾人於三寶得不壞信、無疑，決了
%43.50 A、佛問
佛告釋提桓因：「憍尸迦！於汝意云何？閻浮提中幾所人信佛不壞？信法#57.44、信僧不壞？幾所人於佛無疑？於法、於僧無疑？幾所人於佛決了？於法、於僧決了？」#57.45
~1622
%43.51 B、天主答
釋提桓因白佛言：「世尊！閻浮提人於佛、法、僧不壞信少，於佛、法、僧無疑、決了亦少。」#57.46
%43.52 （2）第二反問答──閻浮提中幾人得三十七品乃至發菩提心行菩薩道
%43.53 A、佛問
憍尸迦！於汝意云何？
閻浮提幾所人得三十七品、三解脫門、八解脫、九次第定、四無礙智、六神通？
閻浮提幾所人斷三結故，得須陀洹道？
幾所人斷三結，亦婬瞋癡薄故，得斯陀含道？
幾所人斷五下分結，得阿那含道？
幾所人斷五上分結，得阿羅漢？
閻浮提幾所人求辟支佛？
幾所人發阿耨多羅三藐三菩提心？」
%43.54 B、天主答
釋提桓因白佛言：「世尊！閻浮提中少所人得三十七品，乃至少所人發阿耨多羅三藐三菩提心。」
%43.55 2、佛正答──閻浮提中少人得三不壞信乃至行菩薩道轉少#57.47
佛告釋提桓因：「如是！如是！憍尸迦！少所人信佛不壞、信法不壞、信僧不壞，少所人於佛無疑、於法無疑、於僧無疑，少所人於佛決了、於法決了、於僧決了；憍尸迦！亦少所人得三十七品、三解脫門、八解脫、九次第定、四無礙智、六神通；憍尸迦！亦少所人斷三結得須陀洹、斷三結亦婬瞋癡薄得斯陀含、斷五下分結得阿那含、斷五上分結得阿羅漢，少所人求辟支佛；於是中亦少所人發阿耨多羅三藐三菩提心、於發心中亦少所人行菩薩道。#57.48
~1623
%43.56 3、佛釋答──眾生前世不聞諸法不修諸善，乃至少有行菩薩道證無上菩提#57.49
何以故？是眾生前世不見佛、不聞法、不供養比丘僧，不布施、不持戒、不忍辱、不精進、不禪定、無智慧，不聞內空、外空乃至無法有法空，亦不聞不修四念處乃至十八不共法，亦不聞不修諸三昧門、諸@t25p465b陀羅尼門，亦不聞不修一切智、一切種智。
憍尸迦！以是因緣故，當知少所眾生信佛不壞、信法不壞、信僧不壞；乃至少所眾生求辟支佛道；於是中少所眾生發阿耨多羅三藐三菩提心，於發心中少所眾生行菩薩道，於是中亦少所眾生得阿耨多羅三藐三菩提。
%43.57 4、佛證答──佛觀眾生遠離般若力故住阿鞞跋致地者少，多墮二乘地#57.50
憍尸迦！我以佛眼見東方無量阿僧祇眾生發心，行阿耨多羅三藐三菩提心，行菩薩道；是眾生遠離般若波羅蜜方便力故，若一、若二住阿鞞跋致地，多墮聲聞、辟支佛地。南西北方、四維、上下，亦如是。
%43.58 三、結勸
%43.59 （一）勸修般若及諸餘善法
%43.60 1、勸修般若
以是故，憍尸迦！善男子、善女人發心求阿耨多羅三藐三菩提者，應聞般若波羅蜜，應受持、親近、讀、誦、說、正憶念；受持、親近、讀、誦、說、正憶念已，應書經卷，恭敬、供養、尊重、讚歎，香華、瓔珞乃至伎樂。
%43.61 2、勸修諸餘善法
諸餘善法入般若波羅蜜中者，亦應聞、受持乃至正憶念。
何等是諸餘善法？所謂檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜，內空、外空乃至無法有法空，諸三昧門、諸陀羅尼門，四念處乃至十八不共法，大慈大悲──如是等無量諸善法皆入般若波羅蜜中，#57.51是亦應聞、受持乃至正憶念。
%43.62 （二）釋因由#57.52
~1624
%43.63 1、般若等是佛所學，我等亦應隨學
何以故？是善男子、善女人當如是念：『佛本為菩薩時，如是行、如是學，所謂般若波羅蜜、禪波羅蜜、毘梨耶波羅蜜、羼提波羅蜜、尸羅波羅蜜、檀波羅蜜，內空、乃至無法有法空，諸三昧門、諸陀羅尼門，四念處乃至十八不共法，大慈大悲。如是等無量佛法，我等亦應隨學。
%43.64 2、般若及無量餘善法是三乘所應學，亦是三乘法印
何以故？般若波羅蜜是我等所尊，禪波羅蜜乃至@t25p465c無量諸餘善法亦是我等所尊。此是諸佛法印，諸辟支佛、阿羅漢、阿那含、斯陀含、須陀洹法印。諸佛學是般若波羅蜜乃至一切種智得度彼岸，諸辟支佛、阿羅漢、阿那含、斯陀含、須陀洹亦學是般若波羅蜜乃至一切智#57.53得度彼岸。』#57.54
%43.65 3、般若等是五乘人所依止故
以是故，憍尸迦！若善男子、善女人，若佛在世、若般涅槃後，應依止般若波羅蜜、禪波羅蜜、毘梨耶波羅蜜、羼提波羅蜜、尸羅波羅蜜、檀波羅蜜，乃至一切種智亦應依止。
何以故？是般若波羅蜜乃至一切種智是諸聲聞、辟支佛、菩薩摩訶薩及一切世間天、人、阿修羅所可依止。
^57.3
%43.103 （貳）以「供養般若」與「造寶塔供養」校量
%43.104 一、佛舉寶塔校量
~1628
%43.105 （一）以一寶塔校量
憍尸迦！若有善男子、善女人，佛般涅槃後，為供養佛故，作七寶塔，高一由旬，天香、天華、天瓔珞、天擣香、天澤香、天衣、天幢蓋、天伎樂供養、恭敬、尊重、讚歎。憍尸迦！於汝意云何？是善男子、善女人從是因緣得福多不？
釋提桓因言：「世尊！甚多！甚多！」
佛言：「不如是善男子、善女人聞是般若波羅蜜，書寫、受持、親近、正憶念，不離薩婆若心，亦供養、恭敬、尊重、讚歎，若花香、瓔珞、擣香、澤香、幢蓋、伎樂供養。是善男子、善女人，福德多。」#57.73
%43.106 （二）以滿閻浮提寶塔校量
佛告釋提桓因憍尸迦：「置#57.74一七寶塔。若善男子、善女人供養佛故，佛般涅槃後，起七寶塔，滿閻浮提，皆高一由旬，恭敬、尊重、讚歎，華香、瓔珞、幢蓋、伎樂供養。憍尸迦！於汝意云何？是善男子、善女人得福多不？」
釋提桓因言：「世尊！其福甚多！」
佛言：「不如是善男子、善女人如前供養般若波羅蜜，其福甚多。
%43.107 （三）以滿四天下寶塔校量
憍尸迦！復置一閻浮提滿中七@t25p466c寶塔。有善男子、善女人供養佛故，佛般涅槃後，起七寶塔，滿四天下#57.75，皆高一由旬，供養如前。憍尸迦！於汝意云何？是善男子、善女人，其福多不？」
釋提桓因言：「甚多！甚多！」
佛言：「不如是善男子、善女人書持般若波羅蜜，恭敬、尊重、讚歎，華香乃至伎樂供養，其福甚多。
%43.108 （四）以滿小千世界寶塔校量
憍尸迦！復置四天下滿中七寶塔。若有善男子、善女人供養佛故，佛般涅槃後，起七寶塔，滿小千世界，皆高一由旬，供養如前。憍尸迦！於汝意云何？是善男子、善女人，其福多不？」
釋提桓因言：「甚多！甚多！」
~1629佛言：「不如是善男子、善女人書是般若波羅蜜，受持、恭敬、尊重、讚歎，華香乃至伎樂供養，其福甚多。
%43.109 （五）以滿二千中世界寶塔校量
憍尸迦！復置小千世界滿中七#57.76寶塔。若有善男子、善女人供養佛故，佛般涅槃後，起七寶塔，滿二千中世界，皆高一由旬，供養如前；不如供養般若波羅蜜其福甚多。
%43.110 （六）以滿三千大千世界寶塔校量
復置二千中世界七寶塔。若有善男子、善女人供養佛故，佛般涅槃後，起七寶塔，滿三千大千世界，皆高一由旬，盡形壽供養，天華、天香、天瓔珞乃至天伎樂。於汝意云何？是善男子、善女人得福多不？」
釋提桓因言：「世尊！甚多！甚多！」
佛言：「不如是善男子、善女人書持是般若波羅蜜，恭敬、尊重、讚歎，華香乃至伎樂供養，其福甚多。
%43.111 （七）以滿三千大千世界中一一眾生起七寶塔校量
復置三千大千世界中七寶塔。若三千大千世界中眾生，一一眾生供養佛故，佛般涅槃後，各起七寶塔，恭敬、尊重、讚歎，花香乃至伎樂供養。若有善男子、善女人書持般若波羅蜜，乃至正憶念，不離薩婆若心，亦恭敬、尊重、讚歎，華香、瓔珞乃@t25p467a至伎樂供養，是人得福甚多。」
%43.112 二、天主領解
%43.113 （一）天主自明所悟，顯供養般若福德為勝
釋提桓因白佛言：「如是！如是！世尊！是人供養、恭敬、尊重、讚歎是般若波羅蜜，則為供養過去、未來、現在佛！
世尊！若十方如恒河沙等世界眾生，一一眾生供養佛故，佛般涅槃後，各起七寶塔，高一由旬，是人若一劫、若減一劫，恭敬、尊重、讚歎，華香乃至伎樂供養。世尊！是善男子、善女人得福多不？」
佛言：「甚多！」
釋提桓因言：「若有善男子、善女人書持是般若波羅蜜，乃至正憶念，亦恭敬、尊重、讚歎，華香乃至伎樂供養，其福大多！
%43.114 （二）釋因由：一切善法皆入般若中，般若是諸佛法印故
何以故？世尊！一切善法皆入般若波羅蜜中，所謂十善道，四禪、四無量心、四無色定，三十七品，三解脫門──空、無相、無作，四諦──苦諦、集諦、滅諦、道諦，六神通、八解脫、九次第定，檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜，內空乃至無法有法空，諸三昧門、諸陀羅尼門，佛十力、四無所畏、四無礙智、大慈大悲、十八不共法，一切智、道種智、一切種智。
世尊！是名一切諸佛法印。#57.77是法中，一切聲聞及辟支佛、過去未來現在諸佛學是法印得度彼岸。」
^57.4
%44.0 壹、佛述成，歎供養般若功德無邊
%44.1 （壹）佛印可帝釋，並讚歎供養般若功德無量無邊
爾時，佛告釋提桓因：「如是！如是！憍尸迦！是諸善男子、善女人書是般若波羅蜜，持經卷受學，親近、讀、誦、說、正憶念，加復供養華香、瓔珞、擣香、澤香、幢蓋、伎樂，當得無量無數、不可思議、不可稱量、無邊福德！
%44.2 （貳）釋因由：諸善法乃至一切種智皆從般若生故
何以故？
%44.3 一、諸佛一切智、一切種智
諸佛一切智、一切種智，皆從般若波羅蜜中生。
%44.4 二、諸菩薩波羅蜜
諸菩薩摩訶薩禪波羅蜜、毘梨耶波羅蜜、羼提波羅蜜、尸羅波羅蜜、檀波羅蜜，皆從~1632般若波羅@t25p467c蜜中生。
%44.5 三、十八空乃至十八不共法
內空乃至無法有法空，四念處乃至十八不共法，皆從般若波羅蜜中生。
%44.6 四、諸佛五眼
諸佛五眼#57.89，皆從般若波羅蜜中生。
%44.7 五、成就眾生乃至諸佛法
成就眾生、淨佛世界、道種智、一切種智、諸佛法，皆從般若波羅蜜中生。
%44.8 六、三乘
聲聞乘、辟支佛乘、佛乘，皆從般若波羅蜜中生。
%44.9 貳、校量功德
%44.10 （壹）明「供養般若」勝「供養寶塔」
以是故，憍尸迦！善男子、善女人書是般若波羅蜜，受持經卷，親近、讀、誦、說、正憶念，加復供養華香乃至伎樂，過出前供養七寶塔，百分、千分、千億萬分，乃至算數譬喻所不能及！
%44.11 （貳）釋因由：若般若在世，則三寶不滅，眾善皆現於世
何以故？
憍尸迦！若般若波羅蜜在於世者，佛寶、法寶、比丘僧寶終不滅。#57.90
若般若波羅蜜在於世者，十善道、四禪、四無量心、四無色定、檀波羅蜜乃至般若波羅蜜、四念處乃至十八不共法、一切智、一切種智，皆現於世。
若般若波羅蜜在於世者，世間便有剎利大姓、婆羅門大姓、居士大家，四天王天乃至阿迦尼吒諸天，須陀洹果乃至阿羅漢果、辟支佛道、菩薩摩訶薩、無上佛道、轉法輪、成就眾生、淨佛世界。」
^58.1
#58.4
%45.0 壹、諸天勸受持般若
%45.1 （壹）正說
爾時，三千大千世界所有四天王天乃至阿迦尼吒天語釋提桓因，諸天言：「應受是般若波羅蜜，應持，應親近，應讀、誦、說、正憶念！
%45.2 （貳）勸持般若之理由
何以故？若#58.5受持般若波羅蜜乃至正憶念故，一切所修集善法當具足滿，增益諸天眾、減#58.6損阿修羅。
諸天子#58.7受持般若波羅蜜乃至正憶念故，佛種不斷，法種#58.8、僧種不斷；佛種、法種、僧種不斷故，世間#58.9便有檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜皆現於世；四念處乃至十八不共法、菩薩道，皆現於世；須陀洹果、斯陀含果、阿那含果、阿羅漢果、辟支佛道、佛道，須陀洹乃至佛皆現於世。」
%45.3 貳、佛勸受持般若
%45.4 （壹）正說
爾時，佛告釋提桓因：「憍尸迦！汝當受@t25p468b是般若波羅蜜，持、讀、誦、說、正憶念！
%45.5 （貳）釋因由
%45.6 一、令阿修羅惡心滅
何以故？若諸阿修羅生心#58.10欲與三十三天共鬪，憍尸迦！汝爾時當誦念般若波羅蜜，諸阿修羅惡心即滅，更不復生。
%45.7 二、令諸天除五死相，還生本處
憍尸迦！若諸天子、天女五死相現時，當墮不如意處，汝當於其前誦讀般若波羅蜜，~1635是諸天子、天女聞般若波羅蜜功德力#58.11故，還生本處。
何以故？聞般若波羅蜜有大利益故。
%45.8 三、漸得無上菩提
復次，憍尸迦！若有善男子、善女人，若諸天子、天女聞是般若波羅蜜經#58.12耳#58.13，以#58.14是功德故，漸當得阿耨多羅三藐三菩提。
何以故？憍尸迦！過去諸佛及弟子皆學是般若波羅蜜，得阿耨多羅三藐三菩提，入無餘涅槃。憍尸迦！未來世諸佛、今現在十方諸佛及弟子皆學是般若波羅蜜，得阿耨多羅三藐三菩提，入無餘涅槃。
何以故？憍尸迦！是般若波羅蜜攝一切善法──若聲聞法、若辟支佛法、若菩薩法、若佛法。」
%45.9 參、天主勸持般若
%45.10 （壹）天主以三明呪讚般若
釋提桓因白佛言：「世尊！般若波羅蜜是大明呪、無上明呪、無等等明呪。#58.15
%45.11 （貳）釋因由：般若能除一切不善法，能與一切善法故
何以故？世尊！是般若波羅蜜能除一切不善法#58.16，能與一切善法。」
%45.12 肆、佛印可、廣讚，更明受持般若得二世功德
%45.13 （壹）佛印可、廣讚
%45.14 一、佛印可
佛語釋提桓因：「如是！如是！憍尸迦！般若波羅蜜是大明呪、無上明呪、無等等明呪。
%45.15 二、廣讚
%45.16 （一）三世諸佛依般若明呪得無上菩提，依此明呪而有諸善生
何以故？憍尸迦！過去諸佛因是明呪故得阿耨多羅三藐三菩提，未來世諸佛、今現在十方諸佛亦因是明呪得阿耨多羅三藐三菩提。
因是明呪故，世間便有十善道，便有四禪、四無量心、四無色定，便有檀波羅蜜乃至般若波羅蜜、四念處乃至十八不共法，便有法性、如、法相、法住、法位、實際，便有五眼、須陀洹果乃至阿羅漢果、辟支佛道、佛道#58.17、@t25p468c一切智、一切種智。
%45.17 （二）諸善法道果皆從菩薩生，菩薩方便力皆從般若生
憍尸迦！菩薩摩訶薩因緣故，十善出於世間，四禪、四無量心乃至一切種智，須陀洹乃至諸佛出於世間。
~1636譬如滿月照明，星宿亦能照明。
如是，憍尸迦！一切世間善法、正法，十善乃至一切種智，若諸佛不出時，皆從菩薩生，是菩薩摩訶薩方便力皆從般若波羅蜜生。#58.18
菩薩摩訶薩以是方便力，行檀波羅蜜乃至禪波羅蜜、內空乃至無法有法空、四念處乃至十八不共法，不證聲聞、辟支佛地，成就眾生、淨佛世界#58.19，壽命成就、世界成就、菩薩眷屬成就，得一切種智──皆從般若波羅蜜生#58.20。」#58.21
%45.18 （貳）明受持般若當得二世功德
%45.19 一、述要
復次，憍尸迦！若善男子、善女人聞般若波羅蜜，受持、親近乃至正憶念，是人當得今世、後世功德。」
%45.20 二、釋「二世功德」
%45.21 （一）今世功德
%45.22 1、不得橫死
釋提桓因白佛言：「世尊！何等是善男子、善女人受持般若波羅蜜乃至正憶念，得今世#58.22、後世#58.23功德？」
佛告#58.24釋提桓因：「若有善男子、善女人受持般若波羅蜜乃至正憶念，終不中毒死#58.25，兵刃#58.26不傷，水#58.27火不害，乃至四百四病#58.28所不能#58.29中──除其#58.30宿命業報。
~1637
%45.23 2、人不得便
復次，憍尸迦！若有官#58.31事起，是善男子、善女人讀誦般若波羅蜜故，往到#58.32官所，官不譴責#58.33。何以故？是般若波羅蜜威力故！
若善男子、善女人讀誦是般若波羅蜜，到王所，若太子、大臣所，王及太子、大臣皆歡喜問訊，和意與語。何以故？是諸善男子、善女人常@t25p469a有慈、悲、喜、捨心向眾生故。
%45.24 3、結
憍尸迦！若善男子、善女人受持般若波羅蜜乃至正憶念，得如是等種種今世功德。
%45.25 （二）後世功德
憍尸迦！何等是善男子、善女人後世功德？
是善男子、善女人終不離十善道、四禪、四無量心、四無色定、六波羅蜜、四念處乃至十八不共法，是人終不墮三惡道；受身完#58.34具，終不生貧窮下賤、工師、除廁人、擔死人家。
常得三十二相。
常得化生諸現在佛界#58.35，終不離菩薩神通；若欲從一佛界至一佛界供養諸佛、聽諸佛法，即得隨意；所遊佛界，成就眾生、淨佛世界，漸得阿耨多羅三藐三菩提。
憍尸迦！是名後世功德。
%45.26 三、結成
以是故，憍尸迦！善男子、善女人應當受持般若波羅蜜，親近、讀、誦、說、正憶念，華香乃至伎#58.36樂供養，常不離薩婆若心。
是善男子、善女人，乃至阿耨多羅三藐三菩提，得今世、後世功德成就。」
^58.2
%46.0 壹、降伏外道惡魔，令不得便
%46.1 （壹）降伏外道
%46.2 一、外道前來欲求佛短
爾時，諸外道梵志來向佛所，欲求佛短#58.85。
%46.3 二、天主誦念般若令外道遠去
是時釋提桓因心念：「是諸外道梵志來向佛所，欲求佛短；我今當誦念從佛所受般若波羅蜜，是諸外道梵志等終不能中道作礙、斷說#58.86般若波羅蜜。」
釋提桓因作是念已，即誦般若波羅蜜。
是時諸外道梵志遙遶佛，復#58.87道還去。#58.88
%46.4 三、佛釋疑
%46.5 （一）舍利弗疑
時，舍利弗心念：「是中何因緣，諸外道梵志遙遶佛，復道還去？」
%46.6 （二）佛釋外道遠去之因由
%46.7 1、由般若力故令遠去
佛知舍利弗心念，告舍利弗：「是釋提桓因誦念般若波羅蜜；以是因緣故，諸外道梵志遙繞佛，復道還去。
%46.8 2、諸聖眾及諸天等守護般若故，持惡意者不能得短
舍利弗！我不見是諸外道梵志一念善心；是諸外道梵志但#58.89持惡心來，欲求#58.90索佛#58.91短。
舍利弗！我不見說般若波羅蜜時，一切世間若天、若魔、若梵、若沙門眾、婆羅門眾中有持惡意來能得@t25p470b短者！
何以故？舍利弗！是三千大千世界中，諸四天王天乃至阿迦尼吒天、諸聲聞、辟支~1644佛、諸菩薩摩訶薩等#58.92守護是般若波羅蜜。所以者何？是諸天、人皆從般若波羅蜜中生故。
復次，舍利弗！十方如恒河沙等世界中，諸佛及聲聞、辟支佛、菩薩摩訶薩、諸天、龍、鬼神等皆守護是般若波羅蜜。所以者何？是諸佛等皆從般若波羅蜜中生故。」
%46.9 （貳）降伏惡魔
%46.10 一、魔化作四種兵來擾
爾時，惡魔心念：「今佛四眾現前集會，亦有欲界、色界諸天子，是中必有菩薩摩訶薩受#58.93記當得阿耨多羅三藐三菩提。我寧可至佛所，破壞其意。」是時，惡魔化作四種兵#58.94，來至佛所。
%46.11 二、天主誦念般若降魔
爾時，釋提桓因心念：「是四種兵，或是惡魔化作，欲來向佛。何以故？是四種兵嚴飾，頻婆娑羅王四種#58.95兵所不類#58.96，波斯匿王四種兵亦不類，諸釋子四種兵#58.97、諸梨唱#58.98四種兵皆亦不類。#58.99是惡魔長夜索佛便，欲惱眾生，我寧可誦念般若波羅蜜。」
釋提桓因即時誦念般若波羅蜜；惡魔如#58.100所誦聞#58.101，漸漸#58.102復道還去。
%46.12 貳、諸天稱歎，佛述成
%46.13 （壹）諸天稱歎
%46.14 一、此世界諸天歎
爾時，會中四天王諸天子乃至阿迦尼吒諸天子化作天華，於虛空中而散佛上，作是言：「世尊！願令般若波羅蜜久住閻浮提！所以者何？閻浮提人受持般若波羅蜜，隨所住時，佛寶住#58.103不滅，法寶、僧寶亦住不滅。」#58.104
~1645
%46.15 二、十方世界諸天歎
爾時，十方如恒河沙等世界中諸天亦皆#58.105散華，作是言：「世尊！願令般若波羅蜜久住閻浮提！若般若波羅蜜久住，佛、法、僧亦當久住，亦分別知菩薩摩訶薩道。復次，所在住處，有善男子、善女人書持般若波羅蜜經卷，是處則為照明，已離眾冥#58.106。」
%46.16 （貳）佛述成
佛告釋提桓因等諸@t25p470c天子：「如是！如是！憍尸迦及諸天子！閻浮提人受持般若波羅蜜，隨所住時，佛寶如是住，法寶、僧寶亦如是住；乃至所#58.107住在#58.108處，善男子、善女人有書持般若波羅蜜經卷，是處則為照明，已離眾冥#58.109。」
%46.17 參、諸天發願守護，佛重述成
%46.18 （壹）諸天發願守護行般若人
爾時，諸天子化作天華散佛上，作是言：「世尊！若有善男子、善女人受持般若波羅蜜，乃至正憶念，魔、若魔天不能得其便。
世尊！我等亦當擁護是善男子、善女人！何以故？若善男子、善女人受持般若波羅蜜，乃至正憶念，我等視是人即是佛、若次佛。」
%46.19 （貳）帝釋更說讚歎因緣
是時，釋提桓因白佛言：「世尊！善男子、善女人受持般若波羅蜜，乃至正憶念者，當知是人先世於佛所作功德，多親近、供養諸佛，為善知識所護。
世尊！諸佛一切智應當從般若波羅蜜中求，般若波羅蜜亦當從一切智中求！所以者何？般若波羅蜜不異一切智，一切智不異般若波羅蜜；般若波羅蜜、一切智，不二不別。是故我等視是人即是佛、若次佛。」
%46.20 （參）佛重述成
佛告釋提桓因：「如是！如是！憍尸迦！諸佛一切智即是般若波羅蜜，般若波羅蜜即是一切智。何以故？憍尸迦！諸佛一切智從般若波羅蜜中生。
般若波羅蜜不異一切智，一切智不異般若波羅蜜；般若波羅蜜、一切智，不二不別。」
^58.3
%47.0 壹、明般若為尊導故稱歎
%47.1 （壹）阿難問：何以獨稱歎般若
爾時，慧命阿難白佛言：「世尊！何以故#58.132不稱譽#58.133檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜乃至十八不共法，但稱譽般若波羅蜜？」
%47.2 （貳）佛廣明般若為眾善之尊導
%47.3 一、諸善法以般若為尊導迴向薩婆若
佛告阿難：「般若波羅蜜於五#58.134波羅蜜乃至十八不共法為尊導！#58.135
阿難！於汝意云何？不迴向薩婆若，布施得稱檀波羅蜜不？」
「不也！世尊！」
「不迴向薩婆若，尸羅......羼提......毘梨耶......禪......智慧是般若波羅蜜不？」
~1649「不也！世尊！」
「以是故知般若波羅蜜於五波羅蜜乃至十八不共法為尊導，是故稱譽。」#58.136
%47.4 二、釋「以不二為方便迴向薩婆若」
%47.5 （一）以無二法、不生、不可得為方便迴向薩婆若得名波羅蜜
阿難白佛言：「世尊！云何布施@t25p471c迴向薩婆若作檀波羅蜜，乃至作般若波羅蜜？」
佛告阿難：「以無二法布施迴向薩婆若，是名檀波羅蜜；以不生、不可得#58.137迴向薩婆若布施，是名檀波羅蜜。乃至以無二法智慧迴向薩婆若，是名般若波羅蜜；以不生、不可得迴向薩婆若智慧，是名般若波羅蜜。」#58.138
%47.6 （二）以五蘊等諸法不二為方便迴向薩婆若
阿難白佛言：「世尊！云何以不二法迴向薩婆若布施是名檀波羅蜜，乃至以不二法迴向薩婆若智慧是名般若波羅蜜？」
佛告阿難：「以色不二法故，受、想、行、識不二法故，乃至阿耨多羅三藐三菩提不二法故。」#58.139
%47.7 （三）諸法性空故無二無別
「世尊！云何色不二法，乃至阿耨多羅三藐三菩提不二法？」
佛言：「色、色相空。何以故？檀波羅蜜、色，不二不別#58.140；乃至阿耨多羅三藐三菩提、檀波羅蜜，不二不別。五波羅蜜亦如是。#58.141
~1650
%47.8 （四）結
以是故，阿難！但稱譽般若波羅蜜，於五波羅蜜乃至一切種智為尊導！#58.142
%47.9 三、舉喻明
阿難！譬#58.143如地，以種散中，得因緣和合故#58.144便生，是諸種子依地而生。如是，阿難！五波羅蜜依般若波羅蜜得生，四念處乃至一切種智亦依般若波羅蜜得生。
以是故，阿難！般若波羅蜜為五波羅蜜乃至十八不共法尊導！」
%47.10 貳、重明受持般若得二世功德
%47.11 （壹）天主說受持功德
%47.12 一、天主言：佛說功德未盡，更有餘德
爾時，釋提桓因白佛言：「世尊！佛說善男子、善女人受持般若波羅蜜乃至正憶念者#58.145，功德未盡。#58.146
%47.13 二、天主自說因緣
%47.14 （一）受持般若即受三世諸佛無上道
何以故？受持般若波羅蜜乃至正憶念，則受三世諸佛無上道。
所以者何？欲得薩婆若，當從般若波羅蜜中求；欲得般若波羅蜜，當從薩婆若中求。
%47.15 （二）受持般若故，世間善法、出世間善法現於世
世尊！受持般若波羅蜜乃至正憶念故，十善道現於世間，四禪、四無量心、四無色定乃至十八不共法現於世間。
%47.16 （三）受持般若故，人天及三乘賢聖皆現於世
受持般若波羅蜜乃至正憶念故，世間便有剎利大姓、婆羅門大姓、居士大@t25p472a家、四天王天乃至阿迦尼吒諸天。
受持般若波羅蜜乃至正憶念故，便有須陀洹乃至阿羅漢、辟支佛、菩薩摩訶薩。
受持般若波羅蜜乃至正#58.147憶念故，諸佛出於世間。」
%47.17 （貳）佛廣明受持般若之功德
%47.18 一、明更有餘功德
爾時，佛告釋提桓因：「憍尸迦！善男子、善女人受持般若波羅蜜乃至正#58.148憶念，我不說但有爾所功德。
~1651
%47.19 二、出餘功德
%47.20 （一）明不離薩婆若心而受持般若乃至正憶念者之功德
%47.21 1、得無量五分法身
何以故？憍尸迦！是善男子、善女人受持般若波羅蜜乃至正憶念，不離薩婆若心，無量戒眾成就，定眾、慧眾、解脫眾、解脫知見眾成就。#58.149
%47.22 2、如佛
復次，憍尸迦！是善男子、善女人能受持般若波羅蜜乃至正憶念，不離薩婆若心，當知是人為如佛。
%47.23 3、五分法身勝於二乘
復次，憍尸迦！一切聲聞、辟支佛所有戒眾、定眾、慧眾、解脫眾、解脫知見眾不及是善男子、善女人戒眾乃至解脫知見眾，百分、千分、千億萬分乃至算數譬喻所不能及！何以故？是#58.150善男子、善女人於聲聞、辟支佛地中心得解脫，更不求大乘法故。#58.151
%47.24 （二）明書持供養般若者亦得二世功德
復次，憍尸迦！若有善男子、善女人書持般若波羅蜜經卷，供養、恭敬、尊重，華香、瓔珞乃至伎#58.152樂#58.153，亦得今世、後世功德。」
%47.25 （參）天主發願守護行般若人
爾時，釋提桓因白佛言：「世尊！是善男子、善女人受持般若波羅蜜乃至正憶念，不離薩婆若心，供養般若波羅蜜，恭敬、尊重，華香乃至伎樂，我常當守護是人！」
^58.4
%47.57 （肆）佛重明功德
%47.58 一、諸天來，增益說法力#58.197@yE010p304
佛告釋提桓因：「憍尸迦！是善男子、善女人欲讀、誦、說般若波羅蜜時，無量百千諸天皆來聽法。是善男子、善女人說#58.198般若波羅蜜法，諸天子益#58.199其膽#58.200力。是諸法師若疲#58.201極，不欲說法，諸天#58.202益其膽力故，便更能#58.203說。
善男子、善女人受持#58.204是般若波羅蜜乃至正憶念，供養華香乃至伎樂故，亦得是今世功德。
%47.59 二、說般若乃至正憶念時不怯論難及不怖畏
%47.60 （一）說般若時不怯論難#58.205
~1656
%47.61 1、正明
復次，憍尸迦！是善男子、善女人於四部眾中說般若波羅蜜時，心無怯弱；若有論難，亦無畏想。
%47.62 2、釋因由
%47.63 （1）般若所護持故@yB019p147
何以故？是善男子、善女人為般若波羅蜜所護持故。
%47.64 （2）般若中分別一切法故#58.206@yB019p147
般若波羅蜜中亦分別一切法──若世間、若出世間，若有漏、若無漏，若善、若不善，若有為、若無為，若聲聞法、若辟支佛法、若菩薩法、若佛法。
%47.65 （3）住十八空不見難者、受難者及般若故
善男子、善女人住內空乃至住無法有法空故，不見有#58.207能難般若波羅蜜者，亦不見受難者，亦不見般若波羅蜜。#58.208
%47.66 3、結成
如是，善男子、善女人為般若波羅蜜所護持故，無有能難壞者。
%47.67 （二）明受持般若波羅蜜乃至正憶念時不怖畏
復次，善男子、善女人受持般若波羅蜜乃至正憶念時，不沒、不畏、不怖。何以故？是善男子、善女人不見是法沒者、恐怖者。
憍尸迦！善男子、善女人受持般若波羅蜜乃至正憶念，華香供養乃至幡蓋，亦得是今#58.209世功@t25p473b德。
%47.68 三、得凡聖愛敬，修六度等無有斷絕，能降伏難論毀謗
%47.69 （一）凡聖愛敬#58.210@yE010p304
復次，憍尸迦！善男子、善女人受持般若波羅蜜乃至正憶念，書持經卷，華香供養乃至幡蓋，是人為父母所愛，宗#58.211親知識所念，諸沙門、婆羅門所敬，十方諸佛及菩薩摩訶薩、辟支佛、阿羅漢乃至須陀洹所愛敬，一切世間若天、若魔、若梵及阿修羅等皆亦愛敬。
~1657
%47.70 （二）修六度等無有斷絕
是人行檀波羅蜜，檀波羅蜜無有斷絕時；尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜亦無有斷絕時。
修內空不斷，乃至修無法有法空不斷；修四念處不斷，乃至修十八不共法不斷；修諸三昧門不斷，修諸陀羅尼門不斷；諸菩薩神通不斷，成就眾生、淨佛世界不斷，乃至修一切種智不斷。#58.212
%47.71 （三）能降伏難論毀謗#58.213
是人亦能降伏難論毀謗。#58.214
%47.72 （四）略結得二世功德
善男子、善女人受持般若波羅蜜乃至正憶念，不離薩婆若心，書持經卷，華香供養乃至幡蓋，亦得是今世、後世功德。
%47.73 四、諸天善神來
%47.74 （一）諸天善神來禮敬般若，守護行者，諸惡不能得便
%47.75 1、諸天善神來禮敬般若，則書寫般若者已行法施
%47.76 （1）諸天善神來禮敬般若
%47.77 A、三千大千世界諸天來
復次，憍尸迦！善男子、善女人書持經卷，在所住#58.215處，三千大千世界中所有諸四天王天發阿耨多羅三藐三菩提心者，皆來到是處，見般若波羅蜜，受#58.216、讀、誦、說、供養、禮拜，還去。
三十三天、夜摩天、兜率陀天、化樂天、他化自在天，梵眾天、梵輔天、梵會天、大梵天，光天、少光天、無量光天、光音天，淨天、少淨天、無量淨天、遍#58.217淨天，無蔭#58.218行天、福德天、廣果天#58.219發阿耨多羅三藐三菩提心者，皆來到是處，~1658見般若波羅蜜，受、讀、誦、說、供養、禮拜，還去。
淨居諸天──所謂無誑天、無熱#58.220天、妙見天、憙見天、色究竟天，皆來到是處，見是#58.221般若波羅蜜，受、讀、誦、說、供養、禮拜，還去。
%47.78 B、十方世界諸天及天龍八部來
復次，憍尸迦！十方世@t25p473c界中諸四天王天乃至廣果天──發阿耨多羅三藐三菩提心，及淨居天，并餘諸天、龍、鬼神、揵闥婆#58.222、阿修羅、迦樓羅#58.223、緊那羅#58.224、摩睺羅伽#58.225，亦來見般若波羅蜜，受、讀、誦、說、供養、禮拜，還去。
%47.79 （2）諸天來見般若波羅蜜，供養禮拜等，則書寫般若者已行法施
是善男子、善女人應作是念：『十方世界中諸四天王天乃至廣果天發阿耨多羅三藐三菩提心，及淨居天并餘諸天、龍、鬼神、揵闥婆、阿修羅、迦樓羅、緊那羅、摩睺羅伽，來見般若波羅蜜，受、讀、誦、說、供養、禮拜，我則法施已。』#58.226
%47.80 2、諸天守護行者，諸惡不能得便
憍尸迦！三千大千世界中所有諸四天王天乃至阿迦尼吒天，乃至#58.227十方世界中諸四天王天乃至阿迦尼吒天──發阿耨多羅三藐三菩提心者，護持#58.228是善男子、善女人，諸惡不能得便，除其宿命重罪。
%47.81 3、略結諸天善神來亦是今世功德
憍尸迦！是善男子、善女人亦得是今世功德，所謂諸#58.229天子發阿耨多羅三藐三菩提心，皆來到#58.230是處。
%47.82 （二）釋諸天何故來守護
何以故？憍尸迦！諸天子發阿耨多羅三藐三菩提心，欲救護一切眾生、不捨一切眾~1659生、安樂一切眾生故。」#58.231
%47.83 （三）明云何知諸天來
%47.84 1、天主問
爾時，釋提桓因白佛言：「世尊！善男子、善女人，云何當知諸四天王天乃至阿迦尼吒天來，及十方世界中諸四天王天乃至阿迦尼吒天來見般若波羅蜜，受、讀、誦、說、供養、禮拜時？」
%47.85 2、佛答
%47.86 （1）見大淨光明
佛告釋提桓因：「憍尸迦！若善男子、善女人見大淨光明，必知有大德諸天來，見般若波羅蜜，受、讀、誦、說、供養、禮拜時。
%47.87 （2）聞殊異妙香
復次，憍尸迦！若#58.232善男子、善女人若聞異妙香，必知有大德諸天來，見般若波羅蜜，受、讀、誦、說、供養、禮拜時。
%47.88 （3）修純淨行，住處莊嚴
復次，憍尸迦！善男子、善女人，行淨潔#58.233故，諸天來到其處，見般若波羅蜜，受、讀、誦、說、供養、歡喜、@t25p474a禮拜。#58.234
是中有小鬼輩即時出去，不能堪任是#58.235大德諸天威德故#58.236。
以是大德諸天來故，是善男子、善女人生大心。
以是故，般若波羅蜜所住處，四面不應有諸不淨，應然燈、燒香，散眾名華，眾香塗地，眾蓋、幢幡#58.237種種嚴飾。
~1660
%47.89 （四）更明諸天益行者之利
%47.90 1、臥覺安隱，有夢皆善
復次，憍尸迦！善男子、善女人說法時，終無#58.238疲極，自覺身輕、心樂，隨法偃#58.239息#58.240，臥#58.241覺#58.242安隱，#58.243無諸惡夢。夢中見諸佛三十二相、八十隨形好；比丘僧恭敬圍遶而為#58.244說法，在諸佛邊聽受法教#58.245──所謂六波羅蜜，四念處乃至十八不共法；分別六波羅蜜義，四念處乃至十八不共法，亦分別其義。#58.246
亦見菩提樹莊嚴殊妙#58.247；見諸菩薩#58.248趣菩提樹，得阿耨多羅三藐三菩提；見諸佛成已轉法輪；見百千萬菩薩共集法論義#58.249──應如是求薩婆若，應如是成就眾生，應如是淨佛世界；亦見十方無數#58.250百千萬億諸佛，亦聞其名號──某方某界某佛，若干百千萬#58.251菩薩、若干百千萬聲聞恭敬圍繞，說法；復見#58.252十方無數百千萬億諸佛般涅槃；復見無數百千萬億諸佛七寶塔；見供養諸佛#58.253塔，恭敬、尊重、讚歎，華香#58.254乃至幢#58.255蓋。
%47.91 2、身心輕便，不貪供養
憍尸迦！是善男子、善女人見如是善夢，臥安覺安；諸天益其氣力，自覺身#58.256體輕便，不大貪著飲食、衣服、臥具#58.257、湯藥#58.258──於此四供養，其心輕微；#58.259譬如比~1661丘坐禪，從#58.260禪定起，心與定合，不貪著飲食，其心輕微。何以故？憍尸迦！諸天法應以諸味之精，益其氣力故。
十方諸佛及天、龍、鬼、神、阿修羅、揵闥婆、迦樓羅、緊那#58.261羅、摩睺羅伽亦益其氣力。
%47.92 （五）結勸
如是，憍尸迦！善男@t25p474b子、善女人欲得今世如是功德，應當受持般若波羅蜜，親近、讀、誦、說、正憶念，亦不離薩婆若心。
憍尸迦！善男子、善女人雖不能受持乃至正#58.262憶念，應當書持經卷，恭敬、供養、尊重、讚歎，華香、瓔#58.263珞乃至幡蓋。
%47.93 五、較量功德，顯供養般若功德殊勝
憍尸迦！若善男子、善女人聞是般若波羅蜜，受持、讀、誦、說、正憶念、書#58.264經卷，恭敬、供養、尊重、讚歎，華香乃至幢蓋。是善男子、善女人功德甚多──勝於供養十方諸佛及弟子#58.265，恭敬、尊重、讚歎，衣服、飲食、臥具、湯藥；諸佛及弟子般涅槃後，起七寶塔，恭敬、供養、尊重、讚歎，華香#58.266乃至幢蓋。」
^59.1
%48.0 壹、舉舍利校量經卷
%48.1 （壹）舉滿閻浮提舍利校量經卷
%48.2 一、佛問釋提桓因
佛告釋提桓因言：「憍尸迦！若滿閻浮提佛舍利作一分，復有人書般若波羅蜜經卷作一分──二分之中，汝取何所#59.3？」#59.4
%48.3 二、約二諦論取捨#59.5
%48.4 （一）天主正答取本捨末
釋提桓因白佛言：「世尊！若滿閻浮提佛舍利作一分，般若波羅蜜經卷作一分──二分之中，我寧取般若波羅蜜經卷。何以故#59.6？世尊！我於佛舍利非不恭敬，非不尊重#59.7；以舍利從般若波羅蜜中生、般若波羅蜜薰修故，是舍利得供養、恭敬、尊重、讚歎。」
%48.5 （二）舍利弗問取捨
爾時，舍利弗問釋提桓因：「憍尸迦！是般若波羅蜜，不可取，無色、無形、無對，一相，所謂無相，汝云何欲取？何以故？是般若波羅蜜，不為取故出，不為捨故出，不為增減、聚散、損益、垢淨故出。是般若波羅蜜，不與諸佛法，不捨凡人法；不與辟支佛法、阿羅漢法、學法，不捨凡人法；不與無為性，不捨有為性；不與內空~1667乃至無法有法空，不與四念處乃至一切種智，不捨凡人法。」#59.8
%48.6 （三）天主答取捨義
釋提桓因語舍利弗：「如是！如是！舍利弗！若有人知是般若波羅蜜不與諸佛法、不捨凡人#59.9法，乃至不與一切種智、不捨凡人法──是菩薩摩訶薩能行般若波羅蜜，能修般若波羅蜜。何以故？般若波羅蜜不行二法故，不二法相是般若波羅蜜，不二法相是禪波羅蜜乃至檀波羅蜜。」#59.10
%48.7 （四）佛述成
%48.8 1、正述：六度皆是不二法相
爾時，佛讚釋提桓@t25p475c因言：「善哉！善哉！憍尸迦！如汝所說，般若波羅蜜不行二法#59.11故，不#59.12二法相是般若波羅蜜，不二法相是禪波羅蜜乃至檀波羅蜜。#59.13
%48.9 2、舉喻明理：法性、實際等與六度無二無別
憍尸迦！若人欲得法性二相者，是人為欲得般若波羅蜜二相。何以故？憍尸迦！法性、般若波羅蜜，無二無別。乃至檀波羅蜜亦如是。
若人欲得實際、不可思議性二相者，是人為欲得般若波羅蜜二相。何以故？般若波羅蜜、不可思議性，無二無別。」#59.14
%48.10 三、天主領解，更舉五義#59.15以明取般若義
%48.11 （一）學般若能得無上菩提故取般若
%48.12 1、法：菩薩學般若，證得無上菩提
~1668釋提桓因白佛言：「世尊！一切世間人及諸天、阿修羅應禮拜、供養般若波羅蜜！何以故？諸菩薩摩訶薩，般若波羅蜜中學，得阿耨多羅三藐三菩提。
%48.13 2、喻：天主於法堂上坐，為眾天子說法
世尊！我常在善法堂#59.16上坐；我若不在坐時，諸天子來供養我故，為我坐處作禮，遶竟還去。諸天子作是念：『釋提桓因在是處坐，為諸三十三天說法故。』
%48.14 3、合：取般若波羅蜜之因由
如是，世尊！在所處書是般若波羅蜜經卷，受持、讀、誦、為他演說；是處，十方世界中，諸天、龍、夜叉、揵闥婆、阿修羅、迦樓羅、緊那羅、摩睺羅伽皆來禮拜般若波羅蜜，供養已去。
何以故？是般若波羅蜜中生諸佛及一切眾生樂具故，諸佛舍利亦是一切種智住處因緣。#59.17以是故，世尊！二分中，我取般若波羅蜜。
%48.15 （二）明能離怖畏故取般若
復次，世尊！我若受持、讀、誦般若波羅蜜，心深#59.18入法中，我是時不見怖畏相。何以故？
世尊！是般若波羅蜜無相無貌、無言無說。
世尊！無相無貌、無言無說，是般若波羅蜜，乃至是一切種智。
世尊！般若波羅蜜若當有相、非無相者，諸佛不應知一切法無相無貌、無言無說，得阿耨多羅三藐三菩提，為弟子說諸法無相無貌、無言無@t25p476a說。
世尊！用#59.19般若波羅蜜實是無相無貌、無言無說故，諸佛知一切諸法無相無貌、無言無說，得阿耨多羅三藐三菩提；為弟子說諸法亦無相無貌、無言無說。#59.20
以是故，世尊！是般若波羅蜜，一切世間諸天、人、阿修羅應供養、恭敬、尊重、讚歎，華香、瓔珞#59.21乃至幡蓋。
%48.16 （三）能不墮三惡道故取般若
復次，世尊！若有人受持般若波羅蜜，親近、讀、誦、說、正憶念及書寫、供養華香乃至幡蓋，是人不墮地獄、畜生、餓鬼道中；
%48.17 （四）能不墮二乘故取般若
不墮聲聞、辟支佛地；#59.22
%48.18 （五）能常見諸佛，常供養十方諸佛，故取般若
乃至得阿耨多羅三藐三菩提，常見諸佛；從一佛界#59.23至一佛界，供養諸佛，恭敬、尊~1669重、讚歎，華香乃至幡蓋。#59.24
%48.19 （貳）舉滿三千大千世界舍利校量經卷
%48.20 一、見般若經卷與見現在佛無異
復次，世尊！滿三千大千世界佛舍利作一分，書般若波羅蜜經卷作一分──是二分#59.25中，我故#59.26取般若波羅蜜。
何以故#59.27？世尊！是般若波羅蜜中生諸佛舍利；以是故，舍利得供養、恭敬、尊重、讚歎。是善男子、善女人供養、恭敬舍利故，受天上、人中福樂，常不墮三惡道；如所願，漸以三乘法入涅槃。
是故，世尊！若有見現在佛、若見般若波羅蜜經卷，等無異。何以故？世尊！是般若波羅蜜與佛無二無別故。
^59.2
#59.43
%48.44 二、明「持誦說般若」與「佛住三事示現、說十二部經」功德齊
%48.45 （一）舉一佛
復次，世尊！如佛住三事示現#59.44，說十二部經──修多羅、祇夜乃至優婆#59.45提舍；#59.46復~1672有善男子、善女人受持、誦、說是般若波羅蜜，等無異。何以故？世尊！是般若波羅蜜中，生三事示現及十二部經──修多羅乃至優波提舍故。#59.47
%48.46 （二）舉十方諸佛
復次，世尊！十方諸佛住三事示現，說十二部經──脩多羅乃至優波提舍；復有人受#59.48般若波羅蜜，為他人說，等無異。
何以故？般若波羅蜜中生諸佛，亦生十二部經──修多羅乃至優波提舍。#59.49
%48.47 三、明供養經卷與供養佛平等無異
復次，世尊！若有供養十方如恒河沙等世界中諸佛，恭敬、尊重、讚歎，華香乃至幡蓋；復有人書般若波羅蜜經卷，恭敬、尊重、讚歎，華香乃至幡蓋，其福正等。何以故？十方諸佛皆從般若波羅蜜中生。
%48.48 四、明般若功德顯殊勝因緣
%48.49 （一）離內怖畏
%48.50 1、能離惡道、超二乘，遠離一切苦惱、衰病
復次，世尊！善男子、善女人聞是般若波羅蜜，受持、讀、誦、正憶念，亦為他人說，是人不墮地獄道、畜生、餓鬼道，亦不墮聲聞、辟支佛地#59.50。何以故？當知是善男子、善女人正住阿鞞跋致地中故。是般若波羅蜜遠離一切苦惱、衰#59.51病。#59.52
~1673
%48.51 2、書寫供養般若經卷離諸恐怖
%48.52 （1）法
復次，世尊！若有善男子、善女人書是般若波羅蜜經卷，受持、親近、供養、@t25p477a恭敬、尊重、讚歎，是人離諸恐怖。
%48.53 （2）喻：如負債人親近國王
世尊！譬如負債人親近國王，供給左右，債主反更供養、恭敬是人，是人不復畏怖。何以故？世尊！此人依近國#59.53王，憑恃有力故。如是，世尊！諸佛舍利，是般若波羅蜜薰修故，得供養、恭敬。
%48.54 （3）合：負債人依王故得供養，舍利亦依般若修薰故得供養
世尊！當知般若波羅蜜如王，舍利如負債#59.54人；負債人依王故得供養，舍利亦依般若波羅蜜修薰故得供養。
世尊！當知諸佛一切種智亦從般若波羅蜜修薰故得成就。
以是故，世尊！二分#59.55中，我取般若波羅蜜。何以故？世尊！般若波羅蜜中生諸佛舍利、三十二相；般若波羅蜜中亦生佛十力、四無所畏、四無礙智、十八不共法、大慈大悲。
世尊！般若波羅蜜中生五波羅蜜，使得波羅蜜名字；般若波羅蜜中生諸佛一切種智。
%48.55 （二）離外怖畏
%48.56 1、法說
復次，世尊！所在三千大千世界中，若有受持、供養、恭敬、尊重、讚歎般若波羅蜜，是處，若人、若非人不能得其便；是人漸漸得入涅槃。
世尊！般若波羅蜜為大利益如是，於三千大千世界中能作佛事！世尊！所在#59.56處，有般若波羅蜜，則為有佛。
%48.57 2、分譬
%48.58 （1）摩尼珠喻
%48.59 A、正明珠德
%48.60 （A）非人不得其便
世尊！譬如無價摩尼寶，在所住處，非人不得其便。
%48.61 （B）能治四病
若男子、若女人有熱#59.57病，以是珠著身上，熱病即時除差；若有風病、若有冷病、若有雜熱風冷病，以珠著身上，皆悉除愈。#59.58
~1674
%48.62 （C）能除黑暗
若闇中，是寶能令明。
%48.63 （D）能除熱寒
熱時能令涼，寒時能令溫；珠所住處，其地不寒、不熱，時節和適。
%48.64 （E）能治毒害
其處亦無諸餘毒螫#59.59；若男子、女人，為毒蛇所螫，以珠示之，毒即除滅。
%48.65 （F）能除眼疾盲瞽
復次，世尊！若男子、女人眼痛、膚曀#59.60、盲瞽#59.61，以珠示之，即時除愈。#59.62@t25p477b
%48.66 （G）能除癩瘡惡腫
若有癩#59.63瘡#59.64惡腫，以珠著其身上，病即除愈。
%48.67 （H）能隨物顯色
復次，世尊！是摩尼寶所在水中，水隨作一色──若以青物裹著#59.65水中，水色即為青；若黃、赤#59.66、白、紅、縹#59.67物裹著水中，水隨作黃、赤、白、紅、縹色。如是等種種色物裹著水中，水隨作種種色。
%48.68 （I）能令濁水清
世尊！若水濁，以珠著中，水即為清。
是珠其德如是！」
%48.69 B、明此等摩尼寶為天上寶
爾時，阿難問釋提桓因言：「憍尸迦！是摩尼寶，為是天上寶？為是閻浮提寶？」
~1675釋提桓因語阿難#59.68：「是天上寶。閻浮提人亦有是寶，但功德相少不具足；天上寶清淨輕妙，不可以譬喻為比。
%48.70 （2）珠篋喻
復次，世尊！是摩尼寶，若著篋#59.69中，舉珠出，其功德薰篋故，人皆愛敬。
%48.71 3、合說
%48.72 （1）般若具眾德如摩尼寶珠
如是，世尊！在所住處，有書般若波羅蜜經卷，是處則無眾惱之患，亦如摩尼寶所著處，則無眾難。
%48.73 （2）舍利為眾德住處如珠篋
%48.74 A、舍利得供養，皆由般若之力
世尊！佛般泥洹後，舍利得供養，皆般若波羅蜜力；禪波羅蜜乃至檀波羅蜜，內空乃至無法有法空，四念處乃至十八不共法，一切智，法相、法住、法位、法性、實際、不可思議性，一切種智──是諸功德力。#59.70
%48.75 B、舍利是佛功德住處
善男子、善女人作是念：『是佛舍利，一切智、一切種智、大慈大悲、斷一切結使及習、常捨行、不錯謬法等諸佛功德住處。』以是故，舍利得供養。
%48.76 C、舍利是諸法相波羅蜜住處
世尊！舍利是諸功德寶波羅蜜住#59.71處，不垢不淨波羅蜜住處，不生不滅波羅蜜、不入不出波羅蜜、不增不損波羅蜜、不來不去不住波羅蜜──是佛舍利是諸法相波羅蜜住處；以是諸法相波羅蜜薰修故，舍利得供養。#59.72
%48.77 （參）舉「滿十方恆河沙世界舍利」校量「般若經卷」
%48.78 一、歎般若法
%48.79 （一）天主校量功德，讚般若殊勝
%48.80 1、般若中生諸佛舍利，持誦般若能具足眾德；欲見佛生身、法身，應持誦般若
%48.81 （1）般若中生諸佛舍利，持誦般若能具足眾德
%48.82 A、標義：天主取般若
~1676復次，世尊！置三千大千世界滿中舍利。如恒河沙等諸世界滿其中舍利作一分，有人書般若波羅蜜經卷作一分──二分之@t25p477c中，我取般若波羅蜜。
%48.83 B、釋因由：般若修薰故，舍利得供養
何以故？是般若波羅蜜中生諸佛舍利；是般若波羅蜜修薰故，舍利得供養。
%48.84 C、校量舍利與般若之功德
%48.85 （A）供養舍利功德──人天中受福樂，亦以福德因緣故，當得盡苦
世尊！若有善男子、善女人供養舍利，恭敬、尊重、讚歎，其功德報不可得邊，受人中、天上福樂──所謂剎利大姓、婆羅門大姓、居士大家、四天王天處乃至他化自在天中受福樂；亦以是福德因緣故，當得盡苦。#59.73
%48.86 （B）持誦般若功德──具六度眾德住菩薩位，得勝神通遊諸佛國，隨類應現，成就眾生
若受是般若波羅蜜，讀、誦、說、正憶念，是人能具足禪波羅蜜，乃至能具足檀波羅蜜；能具足四念處，乃至能具足十八不共法；過聲聞、辟支佛地，住菩薩位；住菩薩位已，得菩薩神通，從一佛界#59.74至一佛界；是菩薩為眾生故受身，隨其所應，成就眾生──若作轉輪聖王、若作剎利大姓、若作婆羅門大姓，成就眾生。
%48.87 D、結成：供養般若，則為供養舍利
以是故，世尊！我不為輕慢、不恭敬故不取舍利，以善男子、善女人供養般若波羅蜜則為供養舍利故。
%48.88 （2）欲見十方現在諸佛生身、法身，應持誦般若，亦以法相修念佛三昧
復次，世尊！有人欲見十方無量阿僧祇諸世界中現在諸佛法身、色身，#59.75是人應聞、受持般若波羅蜜，讀、誦、正憶念、為他人廣說。如是善男子、善女人當見十方無量阿僧祇世界中諸佛法身、色身。
是善男子、善女人行般若波羅蜜，亦應以法相修念佛三昧。#59.76
復次，善男子、善女人欲見現在諸佛，應當受#59.77是般若波羅蜜，乃至正憶念。
^59.3
%48.190 2、明般若能攝有為與無為諸法相
%48.191 （1）總說
復次，世尊！有二種法相──有為諸法相，無為諸法相。
~1687
%48.192 （2）別辨
%48.193 A、明有為諸法相
云何名有為諸法相？所謂內空中智慧，乃至無法有法空中智慧，四念處中智慧，乃至八聖道分中智慧，佛十力、四無所畏、四無礙智、十八不共法中智慧，善法中不善法中、有漏法中無漏法中、世間法中出世間法中智慧是名有為諸法法相。
%48.194 B、明無為諸法相
云何名無為諸法法相？若法無生無滅、無住無異、無垢無淨、無增無減諸法自性。云何名諸法自性？諸法無所有性是諸法自性──是名無為諸法相。」
%48.195 （二）佛述成
爾時，佛告釋提桓因：「如是！如是！憍尸迦！
%48.196 1、三世諸佛及佛弟子皆因般若而成就道果
過去諸佛因是般若波羅蜜得阿耨多羅三藐三菩提，過去諸佛弟子亦因般若波羅蜜得須陀洹道乃至阿羅漢、辟支佛道；未來、現在世十方無量阿僧祇諸佛因是般若波羅蜜得阿耨多羅三藐三菩提，未來、現在諸佛弟子亦因般若波羅蜜得須陀洹道乃至辟支佛道。
%48.197 2、般若中廣說三乘之教
何以故？般若波羅蜜中廣說三乘義，#59.133以無相法故，無生無滅法故，無垢無淨法故，無作無起、不入不出、不增不損、不取不捨法故。以俗#59.134法故，非以第一義#59.135。
何以故？是@t25p479c般若波羅蜜，非此非彼、非高非下、非等非不等、非相非無相、非世間非出世間、非有漏非無漏、非有為非無為、非善非不善、非過去非未來非現在。#59.136
何以故？憍尸迦！般若波羅蜜，不取聲聞、辟支佛法，亦不捨凡夫法。」
%48.198 二、歎行般若之菩薩，知一切而不得一切#59.137
%48.199 （一）天主歎
釋提桓因白佛言：「世尊！菩薩摩訶薩行般若波羅蜜，知一切眾生心，亦不得眾生，#59.138乃至知者、見者亦不得。是菩薩不得色，不得受、想、行、識，不得眼乃至意，不得色乃至法，不得眼觸因緣生受乃至意觸因緣生受，不得四念處乃至十八不共法，不得阿耨多羅三藐三菩提，不得諸佛法，不得佛。
何以故？般若波羅蜜不為得法故出。何以故？般若波羅蜜，性無所有、不可得，所~1688用法不可得，處亦不可得！」#59.139
%48.200 （二）佛述成
佛告釋提桓因：「如是！如是！憍尸迦！如汝#59.140所說！菩薩摩訶薩長夜行般若波羅蜜，阿耨多羅三藐三菩提不可得，何況菩薩及菩薩法！」
%48.201 三、般若為明導，以無所得為方便盡行六度
%48.202 （一）天主疑
爾時，釋提桓因白佛言：「世尊！菩薩摩訶薩但行般若波羅蜜，不行餘波羅蜜耶？」
%48.203 （二）佛釋疑
%48.204 1、以無所得為方便盡行六度
佛告釋提桓因言：「憍尸迦！菩薩盡行六波羅蜜法，以無所得故──行檀波羅蜜，不得施者，不得受者，不得財物；行尸羅波羅蜜，不得戒，不得持戒人，不得破戒人；乃至行般若波羅蜜，不得智慧，不得智慧人，不得無智慧人。#59.141
%48.205 2、盡行六度，以般若為導，能具足六度
憍尸迦！菩薩摩訶薩行布施時，般若波羅蜜為作明導，能具足檀波羅蜜；
菩薩摩訶薩行持戒時，般若波羅蜜為作明導，能具足尸羅波羅蜜；
菩薩摩訶薩行忍辱時，般若波羅蜜為作明導，能具足羼提波羅蜜；
菩薩摩訶薩行精進時，般若波羅蜜為@t25p480a作明導，能具足毘梨耶波羅蜜；
菩薩摩訶薩行禪#59.142時，般若波羅蜜為作明導，能具足禪波羅蜜；
菩薩摩訶薩觀諸法時，般若波羅蜜為作明導，能具足般若波羅蜜。
%48.206 3、諸波羅蜜入般若中而無別，以無所得故
一切法以無所得故──所謂色乃至一切種智。
憍尸迦！譬如閻浮提諸樹，種種葉、種種華、種種果、種種色，其蔭無差別；諸波羅蜜入般若波羅蜜中，至薩婆若#59.143，無差別亦如是，以無所得故。」#59.144
~1689
%48.207 （三）天主領解稱歎：主歸般若行#59.145
釋提桓因白佛言：「世尊！般若波羅蜜，大功德成就！世尊！般若波羅蜜，一切功德成就！世尊！般若波羅蜜，無量功德成就！無邊功德成就！無等功德成就！
%48.208 貳、舉「經卷施他」校量「自書寫、受持、正憶念」
%48.209 （壹）天主問「自行般若」與「經卷施他」何者得福多
世尊！若有善男子、善女人書是般若波羅蜜經卷，恭敬、供養、尊重、讚歎，華香乃至幡蓋，如般若波羅蜜所說正憶念；復有善男子、善女人書般若波羅蜜經卷與他人──其福何所為多？」
%48.210 （貳）佛舉舍利反問：「自供養舍利」與「舍利施他」何者得福多
佛告釋提桓因：「憍尸迦！我還問汝，隨汝意報我。若有善男子、善女人供養諸佛舍利，恭敬、尊重、讚歎，華香乃至幡蓋；若復有人分舍利如芥子許與他人，令供養、恭敬、尊重、讚歎，華香乃至幡蓋──其福何所為多？」
%48.211 （參）天主答「舍利施他」勝「自供養舍利」
釋提桓因白佛言：「世尊！如我從佛聞法中義，若有善男子、善女人自供養舍利，乃至幡蓋；若復有人分舍利如芥子許與他人令供養，其福甚多！世尊！佛見是福利眾生故，入金鋼三昧中，碎#59.146金鋼身作末舍利。#59.147何以故？有人佛滅度後，供養佛舍利，乃至如芥子許，其福報無邊，乃至苦盡故。」
%48.212 （肆）佛明「以般若經卷施他令學」勝「自己書寫供養」
佛告釋提桓因：「如是！如是！憍尸迦！若善男子、善女人書般若波羅蜜經卷，供養、恭敬，華香乃至幡蓋；若復有人@t25p480b書般若波羅蜜經卷，與他人令學，是善男子、善女人其福甚多！
%48.213 參、舉「經卷施他」校量「為他解說其義」
%48.214 （壹）明「為他解說其義」勝「經卷施他」
復次，憍尸迦！善男子、善女人如般若波羅蜜中義為他人說，開示、分別，令易解──是善男子、善女人勝於前善男子、善女人功德。所從聞般若波羅蜜，當視其人如佛，亦如高勝梵行人。何以故？當知般若波羅蜜即是佛；般若波羅蜜不異佛，佛不異般若波羅蜜。
%48.215 （貳）釋勝意
%48.216 一、三世聖人皆學般若成道
過去、未來、現在諸佛皆從般若波羅蜜中學，得阿耨多羅三藐三菩提；
及高勝梵行人──高勝梵行人者，所謂阿鞞跋致菩薩摩訶薩──亦學是般若波羅蜜，~1690當得阿耨多羅三藐三菩提；
聲聞人亦學是般若波羅蜜，得阿羅漢道；
求辟支佛道人亦學是般若波羅蜜，得辟支佛道。
菩薩亦學是般若波羅蜜，得入菩薩位。
以是故，憍尸迦！善男子、善女人欲供養現在諸佛，恭敬、尊重、讚歎，華香乃至幡蓋，當供養般若波羅蜜！
%48.217 二、釋尊以自身為例證成
我見是利益，初得阿耨多羅三藐三菩提時，作如是念：『誰有可供養、恭敬、尊重、讚歎、依止住者？』
憍尸迦！我，一切世間中，若天、若魔、若梵、若沙門、婆羅門中，不見與我等者，何況有勝者！
我自思念：『我所得法，自致作#59.148佛；我供養是法，恭敬、尊重、讚歎，當依止住，依是法#59.149。何等是法？所謂般若波羅蜜。』
憍尸迦！我自供養是般若波羅蜜#59.150，恭敬、尊重、讚歎已，依止住；何況善男子、善女人欲得阿耨多羅三藐三菩提，而不供養般若波羅蜜，恭敬、尊重、讚歎，華香、瓔珞乃至幡蓋？
何以故？般若波羅蜜中生諸菩薩摩訶薩，諸菩薩摩訶薩中生諸佛。
%48.218 三、結勸
以是故，憍@t25p480c尸迦！善男子、善女人若求佛道、若求辟支佛道、若求聲聞道，皆應供養般若波羅蜜，恭敬、尊重、讚歎，華香乃至幡蓋。」
^60.1
%49.0 壹、舉「以世間善化他」校量「以般若經卷化他」
%49.1 （壹）舉「以十善道化他」校量「以般若經卷化他」
%49.2 一、「教閻浮提人行十善」校量「經卷化他」
%49.3 （一）正說「經卷化他」勝「教閻浮提人行十善」
佛告釋提桓因#60.4言：「憍尸迦！若有善男子、善女人教一閻浮提人行十善道。於汝意云何？以是因緣故，得福多不？」
答言：「甚多！世尊！」
佛言：「不如是善男子、善女人書持般若波羅蜜經卷與他人，令讀、誦、說，得福多。
%49.4 （二）釋因由：般若中廣說無漏法，從般若中學，得成三乘道
何以故？是般若波羅蜜中廣說諸無漏法，#60.5善男子、善女人從是中學──已學、今學、當學，入正法#60.6位中──已入、今入、當入，得須陀洹果──已得、今得、當得；乃至阿羅漢果，求辟支佛道亦如是。
諸菩薩摩訶薩求阿耨多羅三藐三菩提，入正法位中──已入、今入、當入，得阿耨多羅三藐三菩提──@t25p481c已得、今得、當得。#60.7
~1695憍尸迦！何等是無漏法？所謂四念處乃至八聖道分、四聖諦，內空乃至無法有法空，佛十力乃至十八不共法。善男子、善女人學是法，得阿耨多羅三藐三菩提──已得、今得、當得。
%49.5 （三）舉譬明理
%49.6 1、明「教一人得二乘果」勝「教閻浮提人行十善」
%49.7 （1）教一人令得須陀洹
%49.8 A、明勝
憍尸迦！若有善男子、善女人教一人令得須陀洹果，是人得福德勝教一閻浮提人行十善道。
%49.9 B、釋因由：二乘聖者能永離三惡道故
何以故？#60.8憍尸迦！教一閻浮提人行十善道，不離地獄、畜生、餓鬼苦。
憍尸迦！教一人得須陀洹果，離三惡道故。
%49.10 （2）例餘
乃至阿羅漢果#60.9、辟支佛道亦如是。
%49.11 2、明「教一人作佛」勝「教閻浮提人得二乘果」
%49.12 （1）明勝
憍尸迦！若善男子、善女人教一閻浮提人令得須陀洹果、斯陀含果#60.10、阿那含、阿羅漢、辟支佛道，不如善男子、善女人教一人令得阿耨多羅三藐三菩提得福多！
%49.13 （2）釋因由：以菩薩因緣能生二乘及諸佛故
何以故？憍尸迦！以菩薩因緣故，生須陀洹果#60.11乃至阿羅漢、辟支佛；以菩薩因緣故，生諸佛。
%49.14 （四）合譬說
%49.15 1、明經卷化他得福多
以是因緣故，憍尸迦！當知善男子、善女人書般若波羅蜜經卷與他人，令書、持、讀、誦、說，得福多！
%49.16 2、釋因由：於般若中學，得生人天善處乃至成佛
何以故？是般若波羅蜜中廣說諸善法。是善法中學#60.12，便出生剎利大姓、婆羅門大姓、居士大家，四天王天乃至非有想非無想天，便有四念處乃至一切種智，便有諸~1696須陀洹乃至阿羅漢、辟支佛，便有諸佛。#60.13
%49.17 二、「教諸世界眾生行十善」校量「經卷化他」
%49.18 （一）舉四天下世界
憍尸迦！置一閻浮提#60.14人。若有善男子、善女人教四天下世界中眾生令行十善道，於汝意云何？是人以是因緣故，得福多不？」
答言：「甚多！世尊！」
佛言：「不如是#60.15善男子、善女人書般若波羅蜜經卷與他人，令書、持、讀、誦、說，得福多！
餘如上說。
%49.19 （二）舉小千世界
憍尸迦！置四天下世界中眾生。若教小千世界中眾生令行十善道亦如是。
%49.20 （三）舉中千世界
憍尸迦！@t25p482a置小千世界中眾生。若教二千中世界中眾生令行十善道；若有善男子、善女人書般若波羅蜜經卷與他人，令書、持、讀、誦，是人得福多！
餘如上說。
%49.21 （四）舉大千世界
憍尸迦！置二千中世界中眾生。若教三千大千世界中所有眾生令行十善道；復有人書般若波羅蜜經卷與他人，令書、持、讀、誦，是人福德多！
%49.22 （五）舉十方恒河沙世界
憍尸迦！置三千大千世界中眾生。若教如恒河沙等世界中所有眾生令行十善道；若復有人書般若波羅蜜經卷與他人，令書、持、讀、誦，其福德多！
餘如上說。
%49.23 （貳）舉「教眾生禪定、五神通」校量「經卷化他」
%49.24 一、舉教一閻浮提眾生
復次，憍尸迦！有人教一閻浮提眾生，令立四禪、四無量心、四無色定、五神通。於汝意云何？是善男子、善女人福德多不？」
釋提桓因言：「甚多！世尊！」
~1697佛言：「不如是善男子、善女人書般若波羅蜜經卷與他人，令書、持、讀、誦、說，得福多！何以故？是般若波羅蜜中廣說諸善法。
餘如上說。
%49.25 二、舉教餘世界眾生
憍尸迦！置閻浮提眾生，復置四天下世界中眾生、小千世界中眾生、二千中世界中眾生、三千大千世界中眾生。憍尸迦！若有人教十方如恒河沙等世界中眾生，令立四禪、四無量心、四無色定、五神通，於汝意云何？是人福德多不？」
答言：「甚多！世尊！」
佛言：「不如是善男子、善女人書般若波羅蜜經卷與他人，令書、持、讀、誦、說，得福多！何以故？是般若波羅蜜中廣說諸善法。
餘如上說。
%49.26 （參）合舉「教十善道、禪定、五神通」校量「自行般若」
%49.27 一、明「自行般若」為勝
復次，憍尸迦！若有善男子、善女人受是般若波羅蜜，書#60.16、持、讀、誦、說、正憶念，是人福德勝教閻浮提人行十善道，立四禪、四無量心、四無色定、五神通。
%49.28 二、別釋「正憶念」
正憶念#60.17者，受、持、親近般若波羅蜜，乃至正憶念，@t25p482b不以二法、不以不二法；受、持、親近禪波羅蜜、毘梨耶波羅蜜、羼提波羅蜜、尸#60.18波羅蜜、檀波羅蜜，乃至正憶念，不以二法、不以不二法；為阿耨多羅三藐三菩提，正憶念內空乃至一切種智，不以二法、不以不二法。#60.19
%49.29 （肆）舉「般若化他」校量「自行般若」，佛述「具自行化他者」更勝
%49.30 一、明「般若化他」
復次，憍尸迦！若有善男子、善女人為他人種種因緣演說般若波羅蜜義，開示、分別，令易解。
憍尸迦！何等是般若波羅蜜義？
憍尸迦！般若波羅蜜義者，不應以二相觀#60.20、不應以不二相觀，非有相、非無相，不入不出，不增不損，不垢不淨，不生不滅，不取不捨，不住非不住，非實非虛，非合~1698非散，非著非不著，非因非不因，非法非不法，非如非不如，非實際非不實際。#60.21
%49.31 二、「般若化他」勝「自行般若」
憍尸迦！若善男子、善女人能以是般若波羅蜜義為他人種種因緣演說、開示、分別，令易解──是善男子、善女人所得福德甚多，勝自受持般若波羅蜜，親近、讀、誦、說、正憶念。
%49.32 三、佛述「具自行化他者」更勝
復次，憍尸迦！善男子、善女人自受持般若波羅蜜，親近、讀、誦、說、正憶念；亦為他人種種因緣演說般若波羅蜜義，開示、分別，令易解──是善男子、善女人所得功德甚多！」
%49.33 四、天主勸應巧說般若
釋提桓因白佛言：「世尊！善男子、善女人應如是演說般若波羅蜜義#60.22，開示、分別，令易解！」
%49.34 五、佛述成，明巧說般若其福無邊
佛告釋提桓因：「如是！憍尸迦！是善男子、善女人應如是演說般若波羅蜜義，開示、分別，令易解。憍尸迦！善男子、善女人如是演說般若波羅蜜義，開示、分別，令易解，得無量無邊阿僧祇福德。
%49.35 （伍）「供養十方佛」校量「以般若化他」
若有善男子、善女人供養十方無量阿僧祇諸佛，盡其壽命，隨其所須，恭敬、尊重、讚歎，華香乃至幡蓋#60.23供養；若復有善男子、@t25p482c善女人種種因緣為他人廣說般若波羅蜜義，開示、分別，令易解──是善男子、善女人功德甚多！
何以故？諸過去、未來、現在諸佛皆於是般若波羅蜜中學，得阿耨多羅三藐三菩提──已得、今得、當得。
%49.36 （陸）「有所得行六度」校量「以無所得為方便演說般若化他」
%49.37 一、正較量：「以無所得為方便演說般若化他」勝「有所得行六度」
復次，憍尸迦！若善男子、善女人於無量無邊阿僧祇劫行檀波羅蜜，不如是善男子、善女人以般若波羅蜜為他人演說其義，開示、分別，令易解，其福甚多，以無所得故。#60.24
~1699
%49.38 二、明「般若正義」
%49.39 （一）論「有所得行、無所得行」
%49.40 1、有所得行
云何名有所得？
憍尸迦！若菩薩摩訶薩用有所得故布施，布施時作是念：『我與，彼受，所施者物。』是名得檀，不得波羅蜜。
『我持戒，此是戒。』是名得戒，不得波羅蜜。
『我忍辱，為是人忍辱。』是名得忍辱，不得波羅蜜。
『我精進，為是事懃精進。』是名得精進，不得波羅蜜。
『我修禪，所修是禪。』是名得禪，不得波羅蜜。
『我修慧，所修是慧。』是名得慧，不得波羅蜜。
憍尸迦！是善男子、善女人如是行者，不得具足檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜。」#60.25
%49.41 2、無所得行
釋提桓因白佛言：「世尊！菩薩摩訶薩云何修具足檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜？」
佛告釋提桓因：「菩薩摩訶薩布施時，不得與者、不得受者、不得所施物，是人得具足檀波羅蜜；乃至修般若波羅蜜時，不得智、不得所修智#60.26，是人得具足般若波羅蜜。#60.27
~1700憍尸迦！是為菩薩摩訶薩具足檀波羅蜜乃至般若波羅蜜。
%49.42 （二）論「相似般若、非相似般若」
%49.43 1、勸如法演說真實般若
善男子、善女人如是行般若波羅蜜，當為他人演說其義，開示、分別，令易解；禪波羅蜜、毘梨耶波羅蜜、羼提波羅蜜、尸羅波羅蜜、檀@t25p483a波羅蜜，演說其義，開示、分別，令易解。
何以故？憍尸迦！未來世當有善男子、善女人欲說般若波羅蜜，而說相似般若波羅蜜；有善男子、善女人發阿耨多羅三藐三菩提心，聞是相似般若波羅蜜，失正道。善男子、善女人應為是人具足演說般若波羅蜜義，開示、分別，令易解。」#60.28
%49.44 2、辨相似般若、非相似般若
%49.45 （1）明相似般若
%49.46 A、總說：有所得般若是為相似般若
釋提桓因白佛言：「世尊！何等是相似#60.29般若波羅蜜？」#60.30
佛言：「有善男子、善女人說有所得般若波羅蜜，是為相似般若波羅蜜。」
%49.47 B、別辨
%49.48 （A）著心取相，說五蘊等無常、苦、無我，是名相似般若
%49.49 a、著心取相說無常
釋提桓因白佛言：「世尊！云何善男子、善女人說有所得般若波羅蜜是為相似般若波羅蜜？」
佛言：「善男子、善女人說有所得般若波羅蜜是相似般若波羅蜜者，#60.31說色無常#60.32，~1701作是言：『能如是行，是行般若波羅蜜。』行者求色無常，是為行相似般若波羅蜜。
說受、想、行、識無常，作是言：『能如是行，是行般若波羅蜜。』行者求受、想、行、識無常，是為行相似般若波羅蜜。
說眼無常乃至說意無常；說色無常乃至說法無常；說眼界無常，色界、眼識界無常，乃至說意界、法界、意識界無常。說地種無常乃至說識種無常；說眼識界#60.33無常乃至說意識界無常；說眼觸無常乃至說意觸無常；說眼觸因緣生受無常乃至說意觸因緣生受無常──廣說如五眾。
%49.50 b、著心取相說苦、無我
說色苦，乃至說意觸因緣生受苦；說色無我，乃至說意觸因緣生受無我──皆如#60.34五眾說。
%49.51 （B）著心取相說「依無常、苦、無我修六度萬行乃至薩婆若」，是名相似般若
行者行檀波羅蜜時，為說色無常、苦、無我；乃至意觸因緣生受，說無常、苦、無我。尸羅波羅蜜乃至般若波羅蜜亦如是。
行四禪、四無量心、四無色定，為說無常、苦#60.35、無我；行四念@t25p483b處，為說無常、苦、無我。
乃至行薩婆若時，為說無常、苦、無我。
作如是教：『能如是行者，是為行般若波羅蜜。』
憍尸迦！是名相似般若波羅蜜。#60.36
~1702
%49.52 （C）著心取相說「如是修行，當得諸果」，是名相似般若
%49.53 a、說當得十地
復次，憍尸迦！若善男子、善女人當來世說相似般若波羅蜜，作是言：『汝善男子修行般若波羅蜜，汝修行般若波羅蜜時，當得初地乃至當得十地。』禪波羅蜜乃至檀波羅蜜亦如是。
行者以相似有所得，以總相#60.37修是般若波羅蜜。憍尸迦！是名相似般若波羅蜜。#60.38
%49.54 b、說當過二乘
復次，憍尸迦！善男子、善女人欲說般若波羅蜜，作是言：『汝善男子修行般若波羅蜜已，當過聲聞、辟支佛地。』是名相似般若波羅蜜。
%49.55 c、說當證無生、得神通
復次，善男子、善女人為求佛道者如是說：『汝善男子、善女人修行般若波羅蜜已，入菩薩位，得無生法忍；得無生法忍已，便#60.39住菩薩神通，從一佛界至一佛界，供養諸佛，恭敬、尊重、讚歎。』如是說者，是名相似般若波羅蜜。
%49.56 d、說當得無邊福
復次，憍尸迦！善男子、善女人為求佛道者如是說：『汝善男子、善女人學是般若波羅蜜，受、持、讀、誦、說、正憶念，當得無量無邊阿僧祇功德。』如是說者，是名相似般若波羅蜜。
%49.57 （D）著心取相說「一切善根迴向菩提」，是名相似般若
復次，善男子、善女人為求佛道者說：『如過去、未來、現在諸佛功德善本，從初發心至成得佛，都合集迴向阿耨多羅三藐三菩提。』如是說者，是名相似般若波羅蜜。」#60.40
~1703
%49.58 （2）明非相似般若
%49.59 A、天主問
釋提桓因白佛言#60.41：「世尊！云何善男子、善女人為求佛道者不說相似般若波羅蜜？」
%49.60 B、佛答
%49.61 （A）觀五蘊等自性空，常、無常等不可得
佛言：「若善男子、善女人為求佛道者說般若波羅蜜：『善男子、善女人！汝修行般若波羅蜜，莫觀色無常。
何以故？色、@t25p483c色性空，是色性非法，若非法即名為般若波羅蜜。般若波羅蜜中色非常非無常。
何以故？是中色尚不可得，何況常、無常！』#60.42
憍尸迦！善男子、善女人如是說者，是名不說相似般若波羅蜜。
受、想、行、識亦如是。
%49.62 （B）觀諸法自性空，無有法可住可過、可入可出、可生可滅
復次，憍尸迦！善男子、善女人為求佛道者說：『汝善男子、善女人修行般若波羅蜜，於諸法莫有所過、莫有所住。
何以故？般若波羅蜜中無有法可過、可住。
所以者何？一切法自性空，自性空是非法，若非法即是為般若波羅蜜。
般若波羅蜜中，無有法可入可出、可生可滅。』#60.43
憍尸迦！是善男子、善女人如是說，是名不說相似般若波羅蜜。
~1704
%49.63 （C）廣說與相似相違，是為非相似般若
廣說如上，與相似相違，#60.44是名不說相似般若波羅蜜。
%49.64 三、結：如法說般若正義功德勝
如是，憍尸迦！善男子、善女人應如是演說般若波羅蜜義。
若如是說般若波羅蜜義，所得功德，勝於前者。
^60.2
%49.98 貳、舉「以出世善化他」校量「般若化他」
%49.99 （壹）舉「教諸世界眾生得二乘果」校量「般若化他」
%49.100 一、「般若化他」勝「教諸世界眾生得聲聞果」
%49.101 （一）教諸世界眾生得初果
%49.102 1、閻浮提眾生
復次，憍尸迦！閻浮提中所有眾生，皆教令得須陀洹。#60.59於汝意云何？是人得福多不？」
答言：「甚多！世尊！」
佛言：「不如是善男子、善女人以般若波羅蜜為他人種種因緣演說其義，開示、分別，令易解；如是言：『善男子！汝來！受是般若波羅蜜，勤讀、誦、說、正憶念，如般若波羅蜜中所說行。』何以故？是般若波羅蜜中出生諸須陀洹。#60.60
%49.103 2、四天下眾生乃至十方如恆沙等世界眾生
憍尸迦！置閻浮提中眾生，復置四天下眾生，小千世界、二千中世界、三千大千世界中眾生。若有人教十方如恒河沙等世界@t25p484c中眾生，盡教令得須陀洹。於汝意云何？是人得福多不？」
答言：「甚多！世尊！」
佛言：「不如是善男子、善女人以般若波羅蜜為他人種種因緣演說其義，開示、分別，令易解；如是言：『善男子！汝來！受是般若波羅蜜，勤讀、誦、說、正憶念，如般若波羅蜜中所說行。』何以故？般若波羅蜜中出生諸須陀洹。
~1708
%49.104 （二）教諸世界眾生得二果乃至四果
復次，憍尸迦！若有善男子、善女人教閻浮提中人，令得斯陀含、阿那含、阿羅漢。於汝意云何？是人得福多不？」
答言：「甚多！世尊！」
佛言：「不如是善男子、善女人以般若波羅蜜為他人種種因緣演說其義，開示、分別，令易解；如是言：『汝來！善男子！受是般若波羅蜜，勤讀、誦、說、正憶念，如般若波羅蜜中所說行。』何以故？般若波羅蜜中出生諸斯陀含、阿那含、阿羅漢故。
乃至教十方如恒河沙等世界中眾生亦如是。
%49.105 二、「般若化他」勝「教諸世界眾生得辟支佛道」
復次，憍尸迦！若善男子、善女人教一閻浮提中眾生令得辟支佛道#60.61。於汝意云何？是人得福多不？」
答言：「甚多！世尊！」
佛言：「不如善男子、善女人以般若波羅蜜為他人種種因緣演說其義，開示、分別，令易解；如是言#60.62：『汝來！善男子！受是般若波羅蜜，勤讀、誦、說、正憶念，如般若波羅蜜中所說行。』何以故？般若波羅蜜中出生諸辟支佛道故。
四天下乃至十方如恒河沙等世界中眾生亦如是。
%49.106 （貳）舉「教諸世界眾生得大乘道果」校量「以般若化他」
%49.107 一、正校量
%49.108 （一）「以般若正義化他」勝「教諸世界眾生令發無上道乃至得不退轉」
%49.109 1、「般若化他」勝「教諸世界眾生令發無上道」
復次，憍尸迦！善男子、善女人教一閻浮提中眾生令發阿耨多羅三藐三菩提心。於汝意云何？是人得福多不？」
答言：「甚多！世尊！」
佛言：「不如是善男子、善女人以般若波羅蜜為他人種種因緣演說其義，開示、分別，令易解；如是言：『@t25p485a汝當隨般若波羅蜜中學，當得一切智法；汝若得一切智法，汝便得修行般若波羅蜜，增益、具足；若得修行般若波羅蜜，增益、具足，汝當得阿耨多羅三藐三菩提。#60.63』
何以故？憍尸迦！般若波羅蜜中生諸初發意菩薩摩訶薩故。
乃至十方如恒河沙等世界亦如是。
%49.110 2、「般若化他」勝「教諸世界眾生令住不退轉」
復次，憍尸迦！善男子、善女人教一閻浮提中眾生令住阿鞞跋致地。於汝意云何？是人得福多不？」
~1709答言：「甚多！世尊！」
佛言：「不如是善男子、善女人以般若波羅蜜為他人種種因緣演說其義，開示、分別，令易解；如是言：『汝來！善男子！受是般若波羅蜜，乃至如般若波羅蜜中所說行，汝便得一切智法；得一切智法已，乃至便得阿耨多羅三藐三菩提。』
何以故？般若波羅蜜中生諸菩薩摩訶薩阿鞞跋致地故。
乃至十方如恒河沙等世界亦如是。
%49.111 （二）教化近佛菩提之菩薩，其功德轉多
%49.112 1、「為一不退轉菩薩說般若正義」勝「教諸世界眾生令發無上道」
復次，憍尸迦！一閻浮提中眾生發意求阿耨多羅三藐三菩提；若有善男子、善女人為是人演說般若波羅蜜，及其義解、開示、分別；如是言：『汝來！善男子！#60.64受是般若波羅蜜，乃至如般若波羅蜜中所說行；學已，汝當得阿耨多羅三藐三菩提。』
復有人為一阿鞞跋致菩薩演說般若波羅蜜，及其義解、開示、分別；如是言：『善男子！汝來！受是般若波羅蜜，乃至如般若波羅蜜中所說行；學已，汝當得阿耨多羅三藐三菩提。』是善男子所得功德甚多。
乃至十方如恒河沙等世界中亦如是。
%49.113 2、「為一疾得佛道菩薩說般若正義」勝「教諸世界眾生皆得不退轉」
復次#60.65，憍尸迦！若有一閻浮提中眾生皆得阿鞞跋致阿耨多羅三藐三菩提；復有善男子、善女人以般若波羅蜜@t25p485b為是人演說其義。於是中有一菩薩疾得阿耨多羅三藐三菩提；若有善男子、善女人為是菩薩演說般若波羅蜜，及其義解──是人功德最多。#60.66
乃至十方如恒河沙等世界亦如是。」
%49.114 二、勸進教化供養
%49.115 （一）天主勸進
~1710釋提桓因白佛言：「世尊！如菩薩摩訶薩轉轉#60.67近#60.68阿耨多羅三藐三菩提者，如是應轉轉教行檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜；應教內空乃至無法有法空，四念處乃至八聖道分，佛十力、四無所畏、四無礙智、十八不共法；亦應供養衣服、臥具、飲食、湯藥，#60.69隨其所須。
是善男子、善女人，法施、財施供養是菩薩，所得功德，勝於前者。何以故？世尊！是菩薩摩訶薩疾得阿耨多羅三藐三菩提故。」#60.70
%49.116 （二）須菩提述成
爾時，慧命須菩提語釋提桓因言：「善哉！善哉！憍尸迦！汝為聖弟子，安慰諸菩薩摩訶薩為阿耨多羅三藐三菩提者以法施、財施利益，法應爾#60.71。#60.72
何以故？菩薩中生諸佛聖眾。若菩薩不發阿耨多羅三藐三菩提心者，是諸菩薩不能學六波羅蜜乃至十八不共法；若不學六波羅蜜乃至十八不共法者，不能得阿耨多羅三藐三菩提；若不能得阿耨多羅三藐三菩提者，則無聲聞、辟支佛。
以是故，憍尸迦！諸菩薩摩訶薩學六波羅蜜乃至十八不共法；學六波羅蜜乃至十八不共法#60.73時，得阿耨多羅三藐三菩提；得阿耨多羅三藐三菩提故，斷地獄、畜生、餓鬼道，世間便有剎利大姓、婆羅門大姓、居士大家、四天王天乃至非有想非無想天，便有檀波羅蜜、尸羅、羼提、毘梨耶、禪波羅@t25p485c蜜、般若波羅蜜、內空乃至無法有法空、四念處乃至十八不共法出現於世，聲聞、辟支佛乘、佛乘皆現於世。」
^61.1
%50.0 壹、彌勒明隨喜迴向義
%50.1 （壹）菩薩隨喜迴向其福最上
%50.2 一、顯勝：以無所得為方便，隨喜福德與一切眾生共迴向無上菩提
爾時，彌勒菩薩#61.3摩訶薩語慧命須菩提：「有菩薩摩訶薩隨喜福德，與一切眾生共之，迴向阿耨多羅三藐三菩提，以無所得故。若聲聞、辟支佛福德，若一切#61.4眾生福#61.5德，若布施，若持戒，若修定，若隨喜；是菩薩摩訶薩隨喜福德，與一切眾生共之，迴向阿耨多羅三藐三菩提，其福最上、第一、最妙、無上、無與等者#61.6！#61.7
%50.3 二、釋因由：菩薩為調、為淨、為度一切眾生故
何以故？聲聞、辟支佛及一切眾生布施、持戒、修定、隨喜，為自調、為自淨、為自度故，所#61.8謂四念處乃至八聖道分，空、無相、無作；菩薩隨喜福德，迴向阿耨多羅三~1715藐三菩提，持是功德，為調一切眾生、為淨一切眾生、為度一切眾生故起。」#61.9
%50.4 （貳）須菩提二問，彌勒二答
%50.5 一、初問答
%50.6 （一）須菩提問：菩薩隨喜佛及弟子眾等善根迴向無上菩提，如所念可得不
爾時，慧命須菩提白彌勒菩薩#61.10言：「諸菩薩摩訶薩念十方無量無邊阿僧祇世界中，無量無邊阿僧祇諸滅度佛──是佛#61.11從初發心至#61.12得阿耨多羅三藐三菩提，乃至#61.13入無餘涅槃，乃至法盡──於其中間諸善根；應六波羅蜜，及諸聲聞#61.14人善根──若布施福德、持戒#61.15福德#61.16、修定#61.17福德，及諸學人無漏善根、無學人無漏善根，諸佛戒眾、定眾、慧眾、解脫眾、解脫知見眾、一切智、大慈大悲及餘無量阿僧祇諸佛法；及諸佛所說法──是法中學，得須陀洹果乃至得阿羅漢果、辟支佛道，入@t25p487b菩薩摩訶薩位；及餘眾生種諸善根──是諸善根，一切和合，隨喜福#61.18德，迴向阿耨多羅三藐三菩提，最上、第一、最妙、無上、無與等者！如是隨喜已，持是隨喜福德，迴向阿耨多羅三藐三菩提。
若有善男子行菩薩乘者作是念：『我是心#61.19迴向阿耨多羅三藐三菩提。』是生心、緣、事，若善男子取相迴向阿耨多羅三藐三菩提，如所念可得不？」#61.20
~1716
%50.7 （二）彌勒答：不得如所念
彌勒菩薩語須菩提：「是善男子行菩薩乘迴向阿耨多羅三藐三菩提，心是緣事，若善男子取相，不得如所念！」#61.21
%50.8 二、第二問答
%50.9 （一）須菩提難
%50.10 1、若諸緣事等無所有，云何不墮顛倒
須菩提語彌勒菩薩：「若諸緣、諸事#61.22無所有，是善男子行菩薩乘者取相，於十方諸佛諸善根──從初發心乃至法盡，及聲聞、辟支佛#61.23諸善根，學、無學善根──一切和合隨喜功德，迴向阿耨多羅三藐三菩提；以無相故，是菩薩將無#61.24顛倒──無常謂常，想顛倒、心顛倒、見顛倒；不淨謂淨、苦謂樂、無我謂我，想顛倒、心顛倒、見顛倒？#61.25
%50.11 2、若諸法無所有，云何得隨喜迴向事
若如緣、如事，阿耨多羅三藐三菩提亦如是，迴向心亦如是，檀波羅蜜，尸羅、羼提、毘梨耶、禪、般若波羅蜜，乃至十八不共法亦如是。#61.26若爾者#61.27，何等是緣？何等是事？何等是阿耨多羅三藐三菩提？何等是善根？何等是隨喜心迴向阿耨多羅三藐三菩提？」
^61.2
%50.99 （二）彌勒答
%50.100 1、明「取相隨喜迴向」與「不取相隨喜迴向」
%50.101 （1）明「不取相隨喜迴向」
彌勒菩薩語須菩提#61.78：「若諸菩薩摩訶薩久行六波羅蜜、多供養諸佛、種善根、與善知識相隨、善學自相空法──是諸菩薩，是緣、是事、諸佛、諸善根、隨喜福德，不取相，迴向阿耨多羅三藐三菩提，以不#61.79二法非不二法、非相非不相、非可得法非不可得法、非淨非垢、不生不滅法，是名迴向阿耨多羅三藐三菩提。#61.80
~1725
%50.102 （2）明「取相隨喜迴向」
若諸菩薩不久行六波羅蜜、不多供養諸佛、不種善根、不與善知識相隨、不善學自相空法──是諸菩薩，是諸緣、是諸事、諸佛、諸善根、隨喜福德，諸心取相，迴向阿耨多羅三藐三菩提，是不名迴向。#61.81
%50.103 2、明「堪受法者」與「不堪受法者」#61.82
%50.104 （1）不堪受法者──新學菩薩
須菩提！如是般若波羅蜜義乃至一切種智義，所謂內空乃至無法有法空，#61.83不應為新學菩薩說。何以故？是菩薩所有少許信樂恭敬清淨心皆亡#61.84失。
%50.105 （2）堪受法者──阿鞞跋致菩薩，善知識守護之久學菩薩
當在阿鞞跋致菩薩摩訶薩前說，若有為善知識所護，若久供養諸佛、種諸善根，應為是人說如是般若波羅蜜義乃至一切種智義#61.85，所謂內@t25p489b空乃至無法有法空。是人聞是法，不沒、不驚、不畏、不怖。#61.86
%50.106 3、明「正迴向」
%50.107 （1）思惟心、緣、事、善根皆盡、滅、變、離
須菩提！菩薩摩訶薩隨喜福德，應如是迴向阿耨多羅三藐三菩提──所謂菩薩用心隨喜功德，迴向阿耨多羅三藐三菩提，是心盡、滅、變、離，是緣、是事、是諸善根亦盡、滅、變、離。是中何等是#61.87隨喜心？何等是諸緣？何等是諸事？何等是諸善根隨喜迴向阿耨多羅三藐三菩提？
~1726
%50.108 （2）二心不俱，一切心相畢竟空，不可以取相迴向
二心不俱，是心性亦不可得迴向，菩薩云何隨喜心迴向阿耨多羅三藐三菩提？
%50.109 （3）菩薩能知諸法空而復能以無所得為方便隨喜迴向，是名正迴向
若菩薩摩訶薩行般若波羅蜜時，如是知：是般若波羅蜜無有法，乃至檀波羅蜜亦無有法；色無有法，受、想、行、識乃至阿耨多羅三藐三菩提#61.88無有法──菩薩摩訶薩應如是隨喜功德迴向阿耨多羅三藐三菩提。
若能如是迴向，是名隨喜功德迴向阿耨多羅三藐三菩提。」#61.89
^61.3
%50.128 貳、須菩提說隨喜迴向義
%50.129 （壹）天主三問，須菩提三答
%50.130 一、天主問三事
%50.131 （一）新發意菩薩聞無相迴向，不怖畏耶
爾時，釋提桓因#61.106語須菩提：「新發意菩薩聞是事，將無驚懼、怖畏？
%50.132 （二）云何作諸善根迴向
須菩提！云何新發意菩薩作諸善根迴向阿耨多羅三藐三菩提？
%50.133 （三）云何隨喜福德迴向
復云何隨喜福德迴向阿耨多羅三藐三菩提？」#61.107
~1729
%50.134 二、須菩提三答
%50.135 （一）答第一問：多信解道法，常隨善知識，不受著諸法故不怖畏
須菩提語釋提桓因：「若新發意菩薩行般若波羅蜜，不受是般若波羅蜜，以無所得故、無相故，乃至檀波羅蜜亦如是。多信解內空乃至多信解無法有法空，多信解四念處乃至十八不共法。
常與善知識相隨，是善知識為說六波羅蜜義，開示、分別，如是教授#61.108，令常不離般若波羅蜜，乃至得入菩薩法位，終不離般若波羅蜜乃至不離檀波羅蜜，不離四念處乃至十八不共法。
亦教語魔事，聞種種魔事已，不增不減。何以故？是菩薩摩訶薩不受一切法故。
%50.136 （二）答第二問：至得無上菩提，終不離善根
是菩薩亦常不離諸佛，乃至得菩薩#61.109位，於中種善根；以是善根故，生菩薩家，乃#61.110至得阿耨多羅三藐三菩提，終不離是善根。#61.111
%50.137 （三）答第三問：於過去諸佛及弟子眾功德隨喜迴向
復次，新發意菩薩摩訶薩於過去十方無量無邊阿僧祇世界中諸佛斷生死#61.112道、斷諸戲論、道盡、棄重擔、滅聚落刺、斷諸有結、正智、得解脫，及弟子所作功德，於中若剎利大姓、婆羅門大姓、居士大家、四天王天乃至淨居天所種善根──是一切和合稱量，以隨喜心，最上、第一、最妙、無上、無與等者#61.113，迴@t25p490b向阿耨多羅三藐三菩提。」#61.114
~1730
%50.138 （貳）彌勒二問，須菩提十一答
%50.139 一、彌勒初問，須菩提七答
%50.140 （一）彌勒初問：新發意菩薩念諸佛等功德隨喜迴向，云何不墮顛倒
爾時，彌勒菩薩語須菩提：「若新發意菩薩摩訶薩念諸佛及弟子諸善根隨喜功德最上、第一、最妙、無上、無與等者#61.115，隨喜已，應迴向阿耨多羅三藐三菩提；云何菩薩不墮想顛倒、心顛倒、見顛倒？」
%50.141 （二）須菩提七答
%50.142 1、不生佛想、僧想及善根想，於迴向心亦不生心想，則不墮顛倒
須菩提言：「若菩薩摩訶薩念諸佛及僧，於中不生佛想、不生僧想，無善根想；用是心迴向阿耨多羅三藐三菩提，是心中亦不生心想。菩薩如是迴向，想不顛倒、心不顛倒、見不顛倒。
若菩薩摩訶薩念諸佛及僧善根，取相；取相已，迴向阿耨多羅三藐三菩提，菩薩如是名為想顛倒、心顛倒、見顛倒。#61.116
%50.143 2、知隨喜心、迴向心、迴向處等皆盡滅，是為正迴向
若菩薩摩訶薩用是心念諸佛及僧諸善根；是心念時，即知盡滅；若盡滅，是法不可得迴向，所用迴向心亦是盡滅相，所迴向處#61.117法亦如是#61.118相。若如是迴向，是名正迴向，非邪迴向。
菩薩摩訶薩應如是迴向阿耨多羅三藐三菩提。#61.119
%50.144 3、知諸法盡滅自性空，是名真迴向
復次，若菩薩摩訶薩──過去諸佛善根及弟子善根，是中凡夫人聞法種善根，若諸~1731天、龍、夜叉、揵闥婆、阿修羅、迦樓羅、緊那羅、摩睺羅伽聞法種善根，若剎利大姓、婆羅門大姓、居士大家、四天王天乃至阿迦尼吒天聞法種善根，發阿耨多羅三藐三菩提心──是一切福德和合稱量，隨喜功德#61.120，最上、第一、最妙、無上、無與等者，迴向阿耨多羅三藐三菩提。是時菩薩若如是知是諸法盡滅，所迴向處法#61.121亦自性空，能如是迴向，是名真迴向阿耨多羅三藐三菩提。
%50.145 4、知諸法自性空，無有法能迴向法，是名正迴向
復次，若菩薩如是知，無有法能迴向法。何以故？一切法自性空故。若如@t25p490c是迴向，是名正迴向阿耨多羅三藐三菩提。
如是菩薩摩訶薩行般若波羅蜜乃至檀波羅蜜，不墮想顛倒、心顛倒、見顛倒。何以故？菩薩不著是迴向，亦不見以諸善根迴向菩提心處，是名菩薩摩訶薩無上迴向。#61.122
^61.4
%50.187 5、於自起福德離五眾等諸法相而隨喜迴向，名正迴向
復次，若菩薩摩訶薩知所起#61.144福德離五眾、十二入、十八界，亦知#61.145般若波羅蜜是離相，乃至檀波羅蜜是離相，內空乃至無法有法空是離相，四念處乃至十八不共法是離相。如是菩薩摩訶薩隨喜心起福德，迴向阿耨多羅三藐三菩提。#61.146
~1736
%50.188 6、知隨喜福德及佛、善根、迴向心等諸法自性離，名正迴向
復次，若#61.147菩薩摩訶薩@t25p491c隨喜福德，知隨喜福德自性離；亦知諸佛離佛性；諸善根亦離善根性；菩提心，菩提心性亦離；迴向，迴向性亦離；菩薩，菩薩性亦離；般若波羅蜜，般若波羅蜜性亦離；禪波羅蜜......毘梨耶波羅蜜......羼提波羅蜜......尸羅波羅蜜......檀波羅蜜，檀波羅蜜性亦離；乃至十八不共法，十八不共法性亦離。菩薩摩訶薩應如是行離相般若波羅蜜，是名菩薩摩訶薩般若波羅蜜中生隨喜福德。#61.148
%50.189 7、性常寂滅，不墮有相無相，如是迴向名正迴向
%50.190 （1）知隨喜福德及迴向心「如過去佛滅度相」，是正迴向不墮顛倒
復次，菩薩摩訶薩，諸過去滅度佛諸善根，若欲迴向，應如是迴向，作是念：『如諸佛滅度相，諸善根相亦如是，滅度法相亦如是；我用心迴向，是心相亦如是。』若能如是迴向，當知是迴向阿耨多羅三藐三菩提，不墮想顛倒、心顛倒、見顛倒。#61.149
%50.191 （2）若取相迴向，不名善根迴向，墮三種顛倒
若菩薩摩訶薩行般若波羅蜜時，取諸佛、善根相迴向阿耨多羅三藐三菩提，是不名為迴向。何以故？諸過去佛及善根非相緣、非無相緣。若菩薩摩訶薩作#61.150如是取相，是不名善根迴向阿耨多羅三藐三菩提。如是菩薩摩訶薩墮想顛倒、心顛倒、見顛倒。#61.151
~1737
%50.192 （3）結：於諸佛及諸善根及諸心不取相，名為正迴向不墮顛倒
若菩薩摩訶薩，諸佛及諸善根及諸#61.152心不取相，是名以諸善根迴向阿耨多羅三藐三菩提。是菩薩摩訶薩不墮想顛倒、心顛倒、見顛倒。」
%50.193 二、彌勒再問，須菩提四答
%50.194 （一）彌勒再問：菩薩云何於諸善根不取相而能迴向
爾時，彌勒菩薩問須菩提#61.153：「云何菩薩摩訶薩於諸善根不取相，能迴向阿耨多羅三藐三菩提？」
%50.195 （二）須菩提四答
%50.196 1、不離般若方便力
%50.197 （1）福德若離般若，則不可得迴向
須菩提言：「以是事故，當知菩薩摩訶薩所學般若波羅蜜中，應有般若波羅蜜方便力。若是福德離般若波羅蜜，不得迴向阿耨多羅三藐三菩提。#61.154何以故？般若波羅蜜中，諸佛不可得@t25p492a，諸善根不可得，迴向阿耨多羅三藐三菩提心亦不可得。#61.155
%50.198 （2）思惟取相迴向之過失
%50.199 A、取相有所得，諸佛不許
於是中，菩薩摩訶薩行般若波羅蜜時，應如是思惟：『諸過去佛及弟子身皆滅，諸善根亦滅；我今取相分別諸佛、諸善根及諸心──如#61.156是取相迴向阿耨多羅三藐三菩提，諸佛所不許。何以故？取相、有所得故，所謂於過去諸佛取相分別。』
是故菩薩摩訶薩欲以諸善根迴向阿耨多羅三藐三菩提，不應有得、不應取相。如是迴向──若有得#61.157、取相迴向，諸佛不說有大利益。何以故？是迴向雜毒故。
%50.200 B、取相迴向如食雜毒，是為謗佛，不隨佛教，不隨法說
%50.201 （A）舉喻
譬如美食雜毒，雖有好色、好香，為人所貪而#61.158雜毒；愚癡之人食之歡喜，貪~1738其好色香美可口；飯欲消時，受若死、若死等苦。
%50.202 （B）合法
若善男子、善女人不諦#61.159受、不諦取相、不諦誦讀#61.160、不解中義#61.161，如是教他言：『汝善男子！過去、未來、現在十方#61.162諸佛，從初發意已#61.163來，至得阿耨多羅三藐三菩提，入無餘涅槃，乃至法盡──於其中間，行般若波羅蜜時作諸善根；行禪波羅蜜、毘梨耶波羅蜜、羼提波羅蜜、尸羅波羅蜜、檀波羅蜜時作諸善根；修四禪、四無量心、四無色定、四念處乃至八聖道分、佛十力乃至修十八不共法時作諸善根；淨佛世界#61.164、成就眾生作諸善根；及諸佛戒眾、定眾、慧眾、解脫眾、解脫知見眾、一切種智、無錯謬法、常捨行；及諸弟子是中所種善根，及諸佛所記當作辟支佛，是中諸天、龍、阿修羅、迦樓羅、緊那羅、摩睺羅伽等所種善根──是諸福德，稱量和合，隨喜迴向阿耨多羅三藐三菩提。』
是迴向，以取相得法故，如雜毒食。得法者，終無正@t25p492b迴向。何以故？是得法雜毒，有相、有動、有戲論。若如是迴向，則為謗佛，不隨佛教、不隨法說。#61.165
%50.203 2、如諸佛所知智慧迴向
是善男子、善女人求佛道#61.166，應如是學過去、未來、現在諸佛從初發意乃至法盡，及弟子行般若波羅蜜時作善根，乃至修一切種智，如上說。
云何諸善根迴向阿耨多羅三藐三菩提正迴向？#61.167
有求佛道善男子、善女人行般若波羅蜜，不欲謗諸佛者，諸#61.168福德應如是迴向──~1739『如諸佛所知無上智慧，是諸善根相、是諸善根性，我亦如是隨喜；如諸佛所知，我亦如是迴向阿耨多羅三藐三菩提。』求菩薩道善男子、善女人應如是迴向阿耨多羅三藐三菩提。
若如是迴向，則為不謗佛，如佛所教、如佛法說。是菩薩摩訶薩迴向，則無雜毒。
^61.5
#61.187
%50.229 3、知諸法實相無生，名無雜毒迴向
~1742
%50.230 （1）無雜毒迴向
%50.231 A、知諸法非三界繫，三世亦不攝，是名正迴向
復次，求佛道善男子#61.188、善女人行般若波羅蜜時，諸善根應如是迴向──如色不繫欲界、不繫色界、不繫無色界；不繫法者，不名過去、不名未來、不名現在。如受、想、行、識不繫欲界、不繫色界、不繫無色界；不繫法者，不名過去、未來、現在。十二入、十八界亦如是。如般若@t25p493b波羅蜜不繫欲界、不繫色界、不繫無色界；不繫法者，不名過去、未來、現在。禪波羅蜜乃至檀波羅蜜亦如是，內空乃至無法有法空亦如是。如四念處不繫欲界、不繫色界、不繫無色界；不繫法者，不名過去、未來、現在。乃至八聖道分亦如是，佛十力乃至十八不共法亦如是。如如、法性、法相、法住、法位、實際、不可思議性，戒、定、慧、解脫、解脫知見眾，一切種智、無#61.189錯謬法、常捨行，不繫欲界、不繫色界、不繫無色界；不繫法者，不名過去、未來、現在。是迴向、所迴向處、行者不繫皆亦如是。如#61.190是諸佛亦不繫，諸善根亦不繫，是諸聲聞、辟支佛善根亦不繫；不繫法者，不名過去、未來、現在。
%50.232 B、知諸法無生、無所有，不可以取相有所得迴向
若菩薩摩訶薩行般若波羅蜜時，如是知色不繫三界；不繫法者，不名過去、未來、現在。若法不#61.191過去、未來、現在者，不可以取相有所得法#61.192迴向阿耨多羅三藐三菩提。何以故？是色無生。若法無生則無法，#61.193無法中不可迴向。受、想、行、識亦如是。#61.194
檀波羅蜜乃至般若波羅蜜，四念處乃至無#61.195錯謬#61.196法、常捨行，不繫三界。不繫法者，亦非過去、未來、現在。若非過去、未來、現在法者，不可以取相有所得法迴向阿耨多羅三藐三菩提。何以故？是法無生。若法#61.197無生則無法，無法中不可迴向。
菩薩摩訶薩如是迴向則無#61.198雜毒。
~1743
%50.233 （2）雜毒邪迴向──取相有所得，不能具諸功德
若求佛道善男子、善女人以取相得法，以諸善根迴向阿耨多羅三藐三菩提，是名邪迴向。
若邪迴向，諸佛所不稱譽。
用是邪迴向，不能具足檀波羅蜜乃至般若波羅蜜，不@t25p493c能具足四念處乃至八聖道分、內空乃至無法有法空、佛十力乃至無錯謬法、常捨行，不能具足淨佛世界、成就眾生；若不能淨佛世界、成就眾生，則不能得阿耨多羅三藐三菩提。
何以故？是迴向雜毒故。
%50.234 4、以「如諸佛所知」迴向，名正迴向
復次，菩薩摩訶薩行般若波羅蜜時，應作是念：『如諸佛所知諸善根迴向，是#61.199真迴向；我亦應以是法#61.200相迴向。』是名正迴向。」
%50.235 參、佛讚須菩提所說，格量、顯勝
%50.236 （壹）佛讚須菩提所說
%50.237 一、佛讚善哉
爾時，佛讚#61.201須菩提：「善哉！善哉！#61.202如汝所為，為作佛事。
%50.238 二、釋因由：以無相、自性空等為方便和合隨喜迴向故
為諸菩薩摩訶薩說所應迴向法，以無相、無得、無出、無垢無淨、無法性、自相空、常性空、法性、如、實際故。#61.203
%50.239 （貳）格量、顯勝：心不著諸善根迴向，功德最上
%50.240 一、「無著迴向」勝「教三千大千世界眾生皆得世間善法」
「須菩提！若三千大千世界中眾生皆當得十善道、四禪、四無量心、四無色定#61.204、五神通。於須菩提意云何？是眾生得福多不？」
「甚多！世尊！」
~1744佛言：「不如是善男子、善女人於諸善根心不著迴向阿耨多羅三藐三菩提，最上#61.205、第一、最妙、無上、無與等。
%50.241 二、「無著迴向」勝「盡形壽供養三千大千世界二乘聖者」
復次，須菩提！若三千大千世界中眾生皆當作須陀洹乃至阿羅漢、辟支佛；若有善男子、善女人盡形壽供養、恭敬、尊重、讚歎，衣服、飲食，臥具、醫藥，供給所須。於須菩提意云何？是善男子、善女人，是因緣@t25p494a故，得福德多不？」
「甚多！世尊！」
佛言：「不如是善男子、善女人於諸善根心不著迴向阿耨多羅三藐三菩提，最上、第一、最妙、無上、無與等。
%50.242 三、「無著迴向」勝「十方如恒沙等世界眾生，如恒沙等劫供養大千世界中皆發菩提心之菩薩」
復次，須菩提！若三千大千世界中眾生皆發阿耨多羅三藐三菩提心，十方如恒河沙等世界中一一眾生如恒河沙等劫，恭敬、尊重、讚歎、供養是菩薩，衣服、飲食，臥具、醫藥，供給所須。於須菩提意云何？是善男子、善女人，是因緣故，得福多不？」#61.206
「甚多！世尊！無量無邊阿僧祇，不可以譬喻為比。世尊！若是福德有形者，十方如恒河沙等世界所不受！」
佛告#61.207須菩提：「善哉！善哉！如汝所言。雖爾，不如善男子、善女人於諸善根心不著迴向阿耨多羅三藐三菩提，最上、第一、最妙、無上、無與等#61.208。是無著迴向功德，比前功德，百倍、千倍、百千#61.209億倍#61.210乃至算數譬喻所不能及！何以故？是善男子、善女人取相得法行十善道、四禪、四無量心、四無色定、五神通，取相得法供養須陀洹，恭敬、尊重、讚歎，衣服、飲食，臥具、醫藥，供給所須，乃至取相供養菩薩故。」
%50.243 肆、諸天領悟說義，佛述成並校量功德
%50.244 （壹）諸天領悟說義
%50.245 一、欲界天眾
%50.246 （一）四天王天眾
爾時，四天王天與二萬諸天子#61.211合掌禮佛，作是言：「世尊！菩薩摩訶薩最大迴向，以方便力故、以無所得故、以無相法故、以無覺法故，諸善根迴向阿耨多羅三藐三~1745菩提。如是迴向，不墮二法。」#61.212
%50.247 （二）三十三天眾
爾時，釋提桓因亦與無數#61.213三十三天及餘諸天子持天華、瓔珞#61.214、擣香#61.215、澤香、天衣、幡蓋、鼓天伎樂以供養佛，作#61.216如#61.217是言：「世尊！菩薩摩訶薩最大迴向，以方便力故、以無所得故、以無相法故、以無覺法故，諸善根迴向阿耨多羅三藐三菩提。如是迴向，不墮二法。」
%50.248 （三）餘欲界四天眾
須夜摩天王與千天子，刪#61.218兜率陀、化樂、他化自在諸天王各與千天子俱，供養佛已，作如是言：「世尊！菩薩摩訶薩最大迴向，以方便力故、以無所得故、以無相法故、以無覺法故，諸善根迴向阿耨多羅三藐三菩提。如是迴向，不墮二法。」
%50.249 二、色界天眾
爾時，諸梵天王#61.219與無數百千億那由他諸天俱詣佛所，頭面禮佛足，發大音聲，作@t25p494b#61.220如是言：「未曾有也！世尊！菩薩摩訶薩為般若波羅蜜所護，以方便力故，勝前善男子、善女人取相有所得者。」
光音天乃至阿迦尼吒天與無數百千億那由他諸天俱詣佛所，頭面禮佛足，發大音聲，作如是言：「未曾有也！世尊！菩薩摩訶薩為般若波羅蜜所護，以方便力故，勝前善男子、善女人取相有所得者。」
%50.250 （貳）佛述成並校量功德
爾時，佛告四天王天乃至阿迦尼吒諸天子：「若三千大千世界中所有眾生皆發阿耨多羅三藐三菩提心，是一切菩薩念過去、未來、現在諸佛及聲聞、辟支佛諸善根，從初發意乃至法住，於其中間所有善根；并餘一切眾生所有善根──所謂布施、持戒、忍辱、精進、一心、智慧，檀波羅蜜乃至般若波羅蜜，戒眾、定眾、慧眾、解脫眾、解脫知見眾──如是等諸餘無量佛法，一切和合隨喜；隨喜已，迴向阿耨多羅三藐三菩提，以取相有所得故。#61.221
~1746復有善男子、善女人發阿耨多羅三藐三菩提心，念過去、未來、現在諸佛及聲聞、辟支佛，從初發意乃至法住，於其中間所有善根；并餘一切眾生所有善根──所謂布施、持戒、忍辱、精進、一心、智慧，檀波羅蜜乃至無量諸佛法，一切和合稱量，以無所得故、無二法故、無相法故、不著法故、無覺法故，是最上隨喜，第一、最妙、無上、無與等隨喜；隨喜已，迴向阿耨多羅三藐三菩提。#61.222
是善男子、善女人功德勝前善男子、善女人功德，百倍、千倍、百千億倍乃至算數譬喻所不能及！」
%50.251 伍、須菩提請法，佛重明正迴向義，並校量功德勸修
%50.252 （壹）須菩提問「正迴向」義
爾時，須菩提白佛言：「世尊！世尊說#61.223善男子、善女人和合諸善根稱量，隨@t25p494c喜迴向，最上、第一、最妙、無上、無與等。世尊！云何名隨喜最上乃至無與等？」
%50.253 （貳）佛重說正迴向義，並校量功德勸修
%50.254 一、佛重說正迴向義
%50.255 （一）如諸法實相隨喜迴向
佛言：「若善男子、善女人念#61.224過去、未來、現在諸法，不取不捨、不念非不念、不得非不得，是諸法中，亦無有法生者滅者、若垢若淨，諸法不增不減、不來不去、不合不散、不入不出；如過去、未來、現在諸法相，如如相、法性、法住、法位，我亦如是隨喜；隨喜已，迴向阿耨多羅三藐三菩提──如是迴向，最上、第一、最妙、無上、無與等！
須菩提！是隨喜法比餘隨喜，百倍、千倍、百千億倍乃至算數譬喻所不能及！
%50.256 （二）知一切法與解脫平等隨喜迴向，當疾得無上菩提
復次，須菩提！求佛道善男子、善女人於過去、未來、現在諸佛及聲聞、辟支佛從初發心乃至法住，於其中間所有善根──若布施乃至智慧，檀波羅蜜乃至無量諸佛法，及餘一切眾生所有善根，若欲隨喜者，應如是隨喜──作是念：『布施與解脫等，~1747戒、忍、精進、禪、智與解脫等；色與解脫等，受、想、行、識亦與解脫等；內空與解脫等，乃至無法有法空亦與解脫等；四念處與解脫等，乃至八聖道分亦與解脫等；佛十力與解脫等，乃至一切種智亦與解脫等；戒眾、定眾、慧眾、解脫眾、解脫知見眾，亦與解脫等；隨喜與解脫等；過去、未來、現在諸法與解脫等；十方諸佛與解脫等；諸佛迴向與解脫等；諸佛與解脫等，諸佛滅度與解脫等；諸佛弟子聲聞、辟支佛與解脫等，諸佛弟子滅度與解脫等；諸佛法相與解脫等，諸聲聞、辟支佛法相與解脫等，一切諸法相亦與解脫等。我以是諸善根相隨喜功德迴向阿耨多羅三藐三菩@t25p495a提，亦與解脫等──不生不滅故。』
須菩提！是名諸菩薩摩訶薩隨喜功德，最上、第一、最妙、無上、無與等。
須菩提！菩薩成就是#61.225隨喜功德，當疾得阿耨多羅三藐三菩提。
%50.257 二、校量功德
復次，須菩提！十方如恒河沙等諸佛及弟子現在，若有求佛道善男子、善女人盡形壽供養是諸佛及弟子一切所須，供養、恭敬、尊重、讚歎，衣服、飲食，臥具、醫藥；是諸佛滅度後，晝夜懃修，供養、恭敬、尊重、讚歎，華香乃至旛蓋伎樂，以取相有所得故。持戒、忍辱、精進、禪定、修智慧，以取相有所得故。#61.226
復有善男子、善女人發意求阿耨多羅三藐三菩提，行檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜時#61.227，以不#61.228取相、無所得法#61.229方便力諸善根迴向阿耨多羅三藐三菩提──是福德最上、第一、最妙、無上、無與等，勝前福德，百倍、千倍、百千億倍乃至算數譬喻所不及#61.230！
%50.258 三、勸修
如是，須菩提！菩薩摩訶薩行檀波羅蜜時，尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜時，以方便力故，諸善根應迴向#61.231阿耨多羅三藐三菩提，以不取相、無所得法故。」
^62.1
%51.0 壹、稱歎般若
%51.1 （壹）舉法：能作隨喜，令入佛道者，是般若波羅蜜
爾時，慧命舍利弗白佛言：「世尊！是般若波羅蜜？」
佛言：「是般若波羅蜜。」#62.2
%51.2 （貳）稱歎#62.3
%51.3 一、照明清淨歎
「世尊！般若波羅蜜能照一切法，畢竟淨故。
~1753
%51.4 二、歸崇禮敬歎
世尊！應禮般若波羅蜜。
%51.5 三、不著三界歎
世尊！般若波羅蜜不著三界。
%51.6 四、能除煩惱歎
世尊！般若波羅蜜除諸闇#62.4冥，一切煩惱諸見除故。
%51.7 五、助道最上歎
世@t25p496b尊！般若波羅蜜一切助道法中最上。
%51.8 六、作安隱斷苦畏歎
世尊！般若波羅蜜安隱，能斷一切怖畏苦惱故。
%51.9 七、總攝五眼歎
世尊！般若波羅蜜能與光明，五眼莊嚴故。
%51.10 八、顯示中道歎
世尊！般若波羅蜜能示導#62.5墮邪道#62.6眾生，離二邊故。
%51.11 九、能成佛智歎
世尊！般若波羅蜜是一切種智，#62.7一切煩惱及習斷故。
%51.12 十、生諸佛法歎
世尊！般若波羅蜜──諸菩薩摩訶薩母，能生諸佛法故。#62.8
%51.13 十一、不生不滅歎
世尊！般若波羅蜜不生不滅，自相空故。
%51.14 十二、遠離斷常，拔生死苦本歎
世尊！般若波羅蜜遠離生死，非常非滅故。
%51.15 十三、施與樂本歎
世尊！般若波羅蜜──無救者作護，施一切珍寶故。
%51.16 十四、不可破壞歎
世尊！般若波羅蜜具足力#62.9，無能破壞故。
~1754
%51.17 十五、不轉不還歎
世尊！般若波羅蜜能轉三轉十二行#62.10法輪，一切諸法不轉#62.11不還故。
%51.18 十六、能離有無歎
世尊！般若波羅蜜能示諸法性，無法有法空#62.12故。#62.13
%51.19 貳、明「供養般若如供養佛無異」
%51.20 （壹）明供養之法
%51.21 一、舍利弗問
世尊！應云何供養般若波羅蜜？」#62.14
%51.22 二、佛答
%51.23 （一）正說：禮般若波羅蜜，當如禮世尊
佛言：「當如供養世尊。禮般若波羅蜜，當如禮世尊。
%51.24 （二）釋因由
%51.25 1、般若與佛無異
何以故？世尊不異般若波羅蜜，般若波羅蜜不異世尊；世尊即是般若波羅蜜，般若波羅蜜即是世尊。
~1755
%51.26 2、般若出生三乘乃至生一切善法故
是般若波羅蜜中出生諸佛、菩薩、辟支佛、阿羅漢、阿那含、斯陀含、須陀洹；般若波羅蜜中生十善道、四禪、四無量心、四無色定、五神通，內空乃至無法有法空，四念處乃至八聖道分；是般若波羅蜜中生#62.15佛十力、十八不共法、大慈大悲、一切種智。」
%51.27 （貳）釋疑
%51.28 一、釋「何因緣故問供養般若」
%51.29 （一）天主問
爾時，釋提桓因心念：「何因緣故舍利弗問是事？」念已，語舍利弗：「何因緣故問是事？」
%51.30 （二）舍利弗釋
%51.31 1、以般若方便力，成隨喜迴向
舍利弗語釋提桓因言：「憍尸迦！諸菩薩摩訶薩為般若波羅蜜守護，以漚和拘舍羅力#62.16故，於過去、未來、現在諸佛，從初發心乃至法住，於其中間所作善根，一切和合隨喜，迴向阿耨多羅三藐三@t25p496c菩提。以是因緣故，我問是事。#62.17
%51.32 2、般若勝五度，將導五度等趣佛智
%51.33 （1）標宗
憍尸迦！菩薩摩訶薩般若波羅蜜勝檀波羅蜜、尸羅、羼提、毘梨耶、禪波羅蜜。
%51.34 （2）舉喻
譬如生盲人，若百、若千、若百千而無前導，不能趣道、入城。
%51.35 （3）合法
憍尸迦！五波羅蜜亦如是，離般若波羅蜜，如盲無導，不能趣道、不能得一切種#62.18智。
憍尸迦！若五波羅蜜得般若波羅蜜將#62.19導#62.20，是時五波羅蜜名為有眼；般若波羅蜜將導，得波羅蜜名字。」#62.21
~1756
%51.36 二、釋「云何獨讚般若」
%51.37 （一）天主問：何故獨讚般若
釋提桓因語舍利弗：「如汝所言：『般若波羅蜜將導五波羅蜜故，得波羅蜜名字。』
舍利弗！若無檀波羅蜜，五波羅蜜不得波羅蜜名字；若無尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜，五波羅蜜不得波羅蜜名字。
若爾者，何以故獨讚般若波羅蜜？」
%51.38 （二）舍利弗答：雖六度相資，然般若力勝故
舍利弗言：「如是！如是！憍尸迦！無檀波羅蜜，五波羅蜜不得波羅蜜名字；無尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜，五波羅蜜不得波羅蜜名字。
但菩薩摩訶薩住般若波羅蜜中，能具足檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜。以是故，憍尸迦！般若波羅蜜於五波羅蜜中，最上、第一、最妙、無上、無與等。」
%51.39 參、明生般若
%51.40 （壹）觀諸法不生，是則般若生
%51.41 一、正明
舍利弗白佛言：「世尊！云何應生般若波羅蜜？」#62.22
佛告舍利弗：「色不生故，般若波羅蜜生；受、想、行、識不生故，般若波羅蜜生；檀波羅蜜不生故，般若波羅蜜生；乃至禪波羅蜜不生故，般若波羅蜜生；內空乃至無法有法空......四念處乃至八聖道分......佛十力乃至一切智#62.23......；一切種智不生故，般若波羅蜜生。如是諸法不生故，般若波羅蜜應生。」#62.24
%51.42 二、釋因由
舍利弗言：「世尊！@t25p497a云何色不生故般若波羅蜜生？乃至一切諸法不生故般若波羅蜜應生？」
佛言：「色不起、不生、不得、不失故，乃至一切諸法不起、不生、不得、不失故，般若波羅蜜生。」#62.25
~1757
%51.43 （貳）無生故無合，無所得不取相
%51.44 一、無生故無合──有方便則成
%51.45 （一）舍利弗與佛論：般若於諸法無生故無合
舍利弗白佛言：「如是生般若波羅蜜，與何等法合？」
佛言：「無所合。以是故得名般若波羅蜜。」
「世尊！不合何等法？」
佛言：「不與不善法合，不與善法合；不與世間法合，不與出世間法合；不與有漏法合，不與無漏法合；不與有罪法合，不與無罪法合；不與有為法合，不與無為法合。何以故？般若波羅蜜不為得諸法故生，以是故於諸法無所合。」#62.26
%51.46 （二）天主與佛論：般若與一切法合，亦無所合
%51.47 1、般若與薩婆若無所得故不合
爾時，釋提桓因白佛言：「世尊！是般若波羅蜜亦不合薩婆若？」
佛言：「如是！憍尸迦！般若波羅蜜亦不合薩婆若，亦不得。」#62.27
%51.48 2、非如凡夫心合，應如佛心合
%51.49 （1）不如凡夫人取相、著名、作起有為法合
釋提桓因言：「世尊！云何般若波羅蜜亦不合薩婆若，亦不得？」
佛言：「般若波羅蜜不如名字、不如相、不如起作法合。」#62.28
%51.50 （2）應如佛心合
釋提桓因言：「今云何合？」
佛言：「若菩薩摩訶薩如不取、不受、不住、不著、不斷──如是合，亦無所合。如是，憍尸迦！般若波羅蜜、一切法合，亦無所合。」#62.29
~1758
%51.51 3、帝釋領解
爾時，釋提桓因白佛言：「未曾有也！世尊！是般若波羅蜜為一切法不起、不生、不得、不失故生。」
%51.52 二、若取相分別合不合或著無所有──無方便則失
%51.53 （一）須菩提明：以有所得分別合不合，是則失般若
須菩提白佛言：「世尊！若菩薩摩訶薩行般若波羅蜜時，作是念：『般若波羅蜜，若一切法合、若不合。』是菩薩摩訶薩則捨般若波羅蜜、遠離般若波羅蜜。」#62.30
%51.54 （二）佛復明：著空無所有，是亦失般若
佛告須菩提：「復有因緣，菩薩摩訶薩捨般若波羅蜜、遠離般若波羅蜜。若菩薩摩訶薩作是念：『是般若波羅蜜無所有、空虛、不堅固。』#62.31是菩薩摩訶薩則捨般若波羅蜜、遠離般若@t25p497b波羅蜜。須菩提！以是因緣故，捨離般若波羅蜜。」
%51.55 肆、明信般若
%51.56 （壹）標宗：信般若則不信色等諸法
須菩提白佛言：「世尊！信般若波羅蜜，為u信u何法？」#62.32
佛告須菩提：「信般若波羅蜜，則不信色，不信受、想、行、識；不信眼乃至意；不信色乃至法；不信眼界乃至意識界；不信檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜；不信內空乃至無法有法空；不信四念處乃至八聖道分；不信佛十力乃至十八不共法；不信須陀洹果、斯陀含果、阿那含果、阿羅漢果、辟支佛道；不信菩薩道；不信阿耨多羅三藐三菩提乃至一切種智。」
%51.57 （貳）釋因由：一切法不可得故
須菩提白佛言：「世尊！云何信般若波羅蜜時，不信色乃至一切種智？」
佛告須菩提：「色不可得故，信般若波羅蜜，不信色；#62.33乃至一切種智不可得故，信般若波羅蜜，不信一切種智。以是故，須菩提！信般若波羅蜜時，不信色乃至不信一切種智。」
^62.2
%51.128 伍、領解稱歎：般若波羅蜜名為摩訶波羅蜜
%51.129 （壹）須菩提正歎
須菩提白佛言：「世尊！是般若波羅蜜名為摩訶波羅蜜。」
%51.130 （貳）佛反問：以何因緣故名為摩訶波羅蜜
「須菩提！何因緣故，是般若波羅蜜名為摩訶波羅蜜？」
%51.131 （參）須菩提釋
%51.132 一、舉五門釋
%51.133 （一）不分別諸法大小等，名為摩訶波羅蜜
%51.134 1、不作大小
須菩提言：「世尊！是般若波羅蜜，不作色大、不作色小，受、想、行、識不作大、不作小；眼乃至意，色乃至法，眼識界乃至意識界，不作大、不作小；檀波羅蜜乃至禪波羅蜜，不作大、不作小；內空乃至無法有法空，不作大、不作小；四念處乃至阿耨多羅三藐三菩提，不作大、不作小；諸佛法，不作大、不作小；諸佛，不作大、不作小。
%51.135 2、不作合散
是般若波羅蜜，不作色合、不作色散，受、想、行、識不作合、不作散；乃至諸佛不作合、不作散。#62.70
~1766
%51.136 3、不作無量非無量
色不作#62.71無量、不作非無量；乃至諸佛不作無量、亦不作非無量。
%51.137 4、不作廣狹
色不作#62.72廣、不@t25p499a作狹；乃至諸佛不作廣、不作狹。
%51.138 5、不作有力無力
不作色有力、不作色無力；乃至諸佛不作有力、不作無力。#62.73
世尊！以是因緣故，是般若波羅蜜名摩訶波羅蜜。
%51.139 （二）著「不作大小」等相，亦失般若，不能得無上菩提
%51.140 1、起「作大小、不作大小」等想則失般若
世尊！若新發意菩薩摩訶薩若不遠離般若波羅蜜、不遠離禪波羅蜜、不遠離毘梨耶波羅蜜、不遠離羼提波羅蜜、不遠離尸羅波羅蜜、不遠離檀波羅蜜，如是念：『是般若波羅蜜，不作色大、不作色小，乃至諸佛不作大、不作小；色不作合、不作散；不作色無量、不作色非無量；不作色有力、不作色無力；乃至諸佛不作有力、不作無力。』世尊！菩薩摩訶薩若如是知，是為不行般若波羅蜜。#62.74
何以故？是非般若波羅蜜相──所謂作色大小乃至諸佛作大小，色有力、無力乃至諸佛有力、無力。#62.75
~1767
%51.141 2、以有所得故，不能得無上菩提
世尊！是菩薩摩訶薩用有所得故，有大過失──所謂行般若波羅蜜時，作色大、作色小，乃至諸佛作有力、作無力。何以故？有所得相者，無阿耨多羅三藐三菩提。#62.76
%51.142 二、舉十門釋
%51.143 （一）不生門
所以者何？眾生不生故，般若波羅蜜亦應不生；色不生故，般若波羅蜜不生；乃至佛不生故，般若波羅蜜不生。
%51.144 （二）性無門
眾生性無故，般若波羅蜜性無；色性無故，般若波羅蜜性無；乃至佛性無故，般若波羅蜜性無。#62.77
%51.145 （三）非法門
眾生非法故，般若波羅蜜非法；色非法故，般若波羅蜜非法；乃至佛非法故，般若波羅蜜非法。#62.78
%51.146 （四）空門
眾生空故，般若波羅蜜空；色空故，般若波羅蜜空；乃至佛空故，般若波羅蜜空。
%51.147 （五）離門
眾生離故，般若波羅蜜離；色離故，般若波羅蜜離；乃至佛離故，般若波羅蜜離。
%51.148 （六）無有門
眾生無有故，般若波羅蜜無有；@t25p499b色無有故，般若波羅蜜無有；乃至佛無有故，般若波羅蜜無有。#62.79
~1768
%51.149 （七）不可思議門
眾生不可思議故，般若波羅蜜不可思議；色不可思議故，般若波羅蜜不可思議；乃至佛不可思議故，般若波羅蜜不可思議。
%51.150 （八）不滅門
眾生不滅故，般若波羅蜜不滅；色不滅故，般若波羅蜜不滅；乃至佛不滅故，般若波羅蜜不滅。
%51.151 （九）不可知門
眾生不可知故，般若波羅蜜不可知；色不可知故，般若波羅蜜不可知；乃至佛不可知故，般若波羅蜜不可知。
%51.152 （十）力不成就門
眾生力不成就故，般若波羅蜜力不成就；色力不成就故，般若波羅蜜力不成就；乃至佛力不成就故，般若波羅蜜力不成就。
%51.153 三、結歎
世尊！以是因緣故，諸菩薩摩訶薩般若波羅蜜名為摩訶波羅蜜。」#62.80
^62.3
%52.0 壹、明信解般若與毀訾般若
%52.1 （壹）明般若甚深，云何得信解
%52.2 一、舍利弗問
爾時，慧命舍利弗白佛言#62.94：「世尊！有菩薩@t25p500b摩訶薩信解是般若波羅蜜者，（1）從何處終來生是間？（2）發阿耨多羅三藐三菩提心來為幾時？（3）為供養幾佛？（4）行檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜來幾時，能隨順解深般若波羅蜜義？」#62.95
%52.3 二、佛答#62.96
%52.4 （一）明所具因緣
佛告舍利弗：「（1）是菩薩摩訶薩供養十方諸佛，來生是間；（2）是菩薩發阿耨多羅三藐三菩提心來無量無邊阿僧祇百千萬億劫；（4）是菩薩摩訶薩從初發心常行檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜；（3）供養無量無邊不可思議阿僧祇諸佛，來生是間。
%52.5 （二）見聞般若如見佛、從佛聞法，能以無相、無二、無所得為方便隨順信解深般若義
舍利弗！是菩薩摩訶薩若見、若聞般若波羅蜜，作是念：『我見佛，從佛聞法#62.97。』舍利弗！是菩薩摩訶薩能隨順解深般若波羅蜜義，以無相、無二#62.98、無所得故。」#62.99
~1773
%52.6 （貳）所信般若無聞無見，諸法鈍故
%52.7 一、須菩提問般若可見可聞不
須菩提白佛言：「世尊！是般若波羅蜜可聞、可見耶？」
%52.8 二、佛答：般若不可得見聞
佛告須菩提：「是般若波羅蜜無有聞者、無有見者；般若波羅蜜無聞、無見，諸法鈍故。禪波羅蜜、毘梨耶波羅蜜、羼提波羅蜜、尸羅波羅蜜、檀波羅蜜無聞、無見，諸法鈍故。#62.100
內空無聞、無見，諸法鈍故；乃至無法有法空無聞、無見，諸法鈍故。
四念處無聞、無見，諸法鈍故；乃至八聖道分無聞、無見，諸法鈍故。
佛十力乃至十八不共法無聞、無見，諸法鈍故。
須菩提！佛及佛道無聞、無見，諸法鈍故。」
%52.9 （參）明亦有新學能信深般若，亦有久學謗般若
%52.10 一、須菩提問
須菩提白佛言：「世尊！是菩薩幾時行佛道，能習行如是深般若波羅蜜？」#62.101
%52.11 二、佛分別答
%52.12 （一）雖初發意，習行六度，善具方便，能信受般若
佛告須菩提：「是中應分別說。
須菩提！有菩薩摩訶薩初發意習行深般若波羅蜜、禪波羅蜜、毘梨耶波羅蜜、羼提波@t25p500c羅蜜、尸羅波羅蜜、檀波羅蜜，以方便力故，於諸法無所破壞，不見諸法無利益者；亦終不遠離行六波羅蜜，亦不遠離諸佛；從一佛世界至一佛世界，若欲以善根力供養諸佛，隨意即得；終不生母人腹中，終不離諸神通，終不生諸煩惱及聲聞、辟支佛心；從一佛世界至一佛世界，成就眾生、淨佛世界。須菩提！如是等諸菩薩摩訶薩能習行深般若波羅蜜。#62.102
~1774
%52.13 （二）雖是久學，以有所得故，不能信受而毀訾般若
%52.14 1、明毀訾般若之行
須菩提！有菩薩摩訶薩多見諸佛若無量百千萬億，從諸佛所，行布施、持戒、忍辱、精進、一心、智慧，皆以有所得故。
是菩薩聞說深般若波羅蜜時，便從眾中起去，不恭敬深般若波羅蜜及諸佛。是菩薩今在此眾中坐，聞是甚深般若波羅蜜，不樂，便捨去。#62.103何以故？是善男子、善女人等先世聞深般若波羅蜜時棄捨去，今世聞深般若波羅蜜亦棄捨去，身心不和。
是人種愚癡因緣業，種是愚癡因緣罪故，聞說深般若波羅蜜毀呰#62.104；毀訾般若波羅蜜故，毀呰過去、未來、現在諸佛一切智、一切種智。#62.105
%52.15 2、述毀訾般若之報
%52.16 （1）明破法所受之苦
%52.17 A、先受地獄苦
是人毀呰三世諸佛一切智#62.106，起破法業；因緣#62.107集故，無量百千萬億歲墮大地獄中。是破法人輩，從一大地獄至一大地獄，若火劫起時，至他方大地獄中生；在彼間，從一大地獄至一大地獄，彼間若火#62.108劫起時，復至他方大地獄中生；在彼間，從一大地獄至一大地獄，如是遍十方，彼間若火劫起故，從彼死，破法業因緣未盡故，還來是間大地獄中生。此間，亦從一大地獄至一大地獄，受無量苦，此間火劫起故，復@t25p501a至十方他世界生。#62.109
~1775
%52.18 B、次受畜生苦
畜生中，受破法罪業苦，如地獄中說。
%52.19 C、雖得人身，生下賤家，生身不全，生無三寶處等苦
重罪漸薄，或得人身，生#62.110盲人家，生旃陀羅家，生除廁、擔死人種種下賤家；若無眼、若一眼、若眼瞎，若#62.111無舌、無耳、無手；#62.112所生處無佛、無法、無佛弟子處。何以故？種破法業，積集厚重具足故，受是果報。」
%52.20 （2）論罪輕重──校量「破法罪」與「五逆罪」
%52.21 A、舍利弗問
爾時，舍利弗白佛言：「世尊！五逆罪與破法#62.113相似#62.114耶？」
%52.22 B、佛答
%52.23 （A）論因
佛告舍利弗：「不應言相似。所以者何？若有人聽說是甚深般若波羅蜜時，毀呰不信，作是言：『不應學是法，是非法、非善、非佛教，諸佛不說是語。』是人自毀訾般若波羅蜜，亦教他人毀訾般若波羅蜜；自壞其身，亦壞他人身；自飲毒殺身，亦飲他人毒；自失其身，亦失他人身；自不知不信、毀訾深般若波羅蜜，亦教他人令不信、不知。
舍利弗！如是人，我不聽聞其名字，#62.115何況眼見！何以故？當知是人名為污法人，為墮衰濁黑性。
如是人，若有聽其言、信用其語，亦受如是苦。舍利弗！若人破般若波羅蜜，當知是名為破法人。」#62.116
~1776
%52.24 （B）論果#62.117
%52.25 a、初問答：為何不說所受罪身大小
舍利弗白佛言：「世尊！世尊說破法之人所受重罪，不說是人所受身體大小？」#62.118
佛告舍利弗：「不須說是人受身大小。何以故？是破法人若聞所受身大小，便當吐熱血，若死、若近死苦。是破法人聞如是身有如是重罪，是人便大愁憂，如箭入心，漸漸乾枯。作是念：『破法罪故，得如是大醜身，受如是無量苦。』以是故，佛不聽舍利弗問是人所受身體大小。」
%52.26 b、次問答：聞無量苦，足為未來世作明誡
舍利弗白佛言：「願佛說之！為未來世作明誡#62.119，令知破法業積集故，得如是大醜身，受如是大#62.120苦。」
佛告舍利弗：「後世@t25p501b人若聞是破法業積集厚重具足，受大地獄中久久無量苦，聞是久久無量苦時#62.121，足為未來世作明誡！」
舍利弗白佛言：「世尊！若白淨#62.122善男子、善女人聞是法足作依止，寧失身命，終不破法，自念：『我若破法，當受如是苦！』」
^63.1
%52.85 3、勸善攝三業，兼辨毀謗之因
%52.86 （1）勸攝三業，莫受諸苦
爾時，須菩提白佛言：「世尊！若#63.1善男子、善女人應好攝身、口、意業，無受如是諸苦──或不見佛，或不聞法，或不親近僧，或生無佛世界中，或生人中墮貧窮家，或人不信受其言。」#63.2
%52.87 （2）明毀謗因
%52.88 A、積集惡口業故有破法重罪
%52.89 （A）須菩提問
須菩提白佛言：「世尊！以積集口業故，有是破法重罪耶#63.3？」
%52.90 （B）佛答
佛告須菩提：「以積集口業故，有是破法重罪。
須菩提！是愚癡人在佛法中出家受戒，破深般若波羅蜜，毀呰、不受。#63.4
須菩提！若破般若波羅蜜、毀呰般若波羅蜜，@t25p503b則為破十方諸佛一切智；一切智#63.5破故，則為破佛寶，破佛寶故破法寶，破法寶故破僧寶；破三寶故，則破世間正見；破世間正見故，則為#63.6破四念處乃至破一切種智法；破一切種智法故，則得無量無邊阿僧祇罪；得無量無邊阿僧祇罪已，則#63.7受無量無邊阿僧祇憂苦。」
%52.91 B、明四因緣毀壞般若
%52.92 （A）總標
須菩提白佛言：「世尊！是愚癡人毀呰破壞深般若波羅蜜，有幾因緣？」
~1785佛告須菩提：「有四因緣，是愚癡人毀呰破#63.8是深般若波羅蜜。」
%52.93 （B）別辨
須菩提言：「世尊！何等四？」
%52.94 a、為魔所使
「是愚癡人為魔所使故，欲毀呰破壞深般若波羅蜜──是名初因緣。
%52.95 b、不信解深法
是愚癡人不信深法，不信不解，心不得清淨──是第二因緣故，是愚癡人欲毀呰破壞深般若波羅蜜。
%52.96 c、外值惡師，內復懈怠、堅著五蘊
是愚癡人與惡知識相隨，心沒懈怠，堅著五受眾──是第三因緣故，是愚癡人欲毀呰破壞深般若波羅蜜。
%52.97 d、多懷瞋恚，自高輕人
是愚癡人多行瞋恚，自高輕人──是第四因緣故，是愚癡人欲#63.9毀呰破壞深般若波羅蜜。
%52.98 （C）結
須菩提！以是四因緣故，是愚癡人欲毀呰破壞深般若波羅蜜。」#63.10
^63.2
#63.26
%52.116 貳、明般若甚深難信難解
%52.117 （壹）依諸法不縛不解，明般若深難信難解
%52.118 一、以三緣故難信難解
須菩提白佛言：「世尊！是#63.27般若波羅蜜，（1）不勤精進、（2）種不善根、（3）惡友相得人，難信難解！」#63.28
佛言：「如是！如是！須菩提！是深般若波羅蜜，不勤精進、種不善根、惡友相得人，難信難解！」
%52.119 二、更明諸法不縛不解故，般若甚深難信難解
%52.120 （一）須菩提問
須菩提白佛言：「世尊！是般若波羅蜜云何甚深難信難解？」#63.29
%52.121 （二）佛答
%52.122 1、約五陰明
「須菩提！色不縛不解。何以故？無所有性是色。
受、想、行、識不縛不解。何以故？無所有性是受、想、行、識。#63.30
%52.123 2、約六度明
檀波羅蜜不縛不解。何以故？無所有性是檀波羅蜜。
尸羅波羅蜜不縛不解。何以故？無所有性是尸羅波羅蜜。
羼提波羅蜜不縛不解。何以故？無所有性是羼提波羅蜜。
毘梨耶波羅蜜不縛不解。何以故？無所有性是毘梨耶波羅蜜。
~1789禪波羅蜜不縛不解。何以故？無所有性是禪波羅蜜。
般若波羅蜜不縛不解。何以故？無所有性是般若波羅蜜。
%52.124 3、約十八空及諸道法明
須菩提！內空不縛不解。何以故？無所有性是內空。
乃至無法有法空不縛不解，何以@t25p504b故？無所有性是無法有法空。
四念處不縛不解。何以故？無所有性是四念處。
乃至一切智、一切種智不縛不解。何以故？無所有性是一切種智。
%52.125 4、約三世明
須菩提！色本際不縛不解。何以故？本際無所有性是色。
受、想、行，識乃至一切種智本際不縛不解。何以故？本際無所有性是一切種智。#63.31
須菩提！色後際不縛不解。何以故？後際無所有性是色。
受、想、行、識乃至一切種智後際不縛不解。何以故？後際無所有性是一切種智。
須菩提！現在色不縛不解。何以故？現在無所有性是色。
受、想、行、識乃至現在一切種智不縛不解。何以故？現在無所有性是一切種智。」
%52.126 （貳）依諸法畢竟淨、無二無別，明般若難信難解
%52.127 一、以七因緣、八因緣故難信難解
%52.128 （一）須菩提說七因緣
須菩提白佛言：「世尊！是般若波羅蜜，（1）不勤精進、（2）不種善根、（3）惡友相得、（5）懈怠、（6）少進、（7）喜忘、（8）無巧便慧──如此之人，實難信難解！」#63.32
%52.129 （二）佛說八因緣
「如是！如是！須菩提！是般若波羅蜜，（1）不勤精進、（2）不種善根、（3）惡友相得、（4）u繫屬於魔u、（5）懈怠、（6）少進、（7）喜忘、（8）無巧便慧──如此之人，實難信難解。
%52.130 二、釋因由：諸法畢竟淨，無二無別故般若甚深
%52.131 （一）因淨，果亦淨
何以故？色淨，果亦淨；#63.33受、想、行、識淨，果亦淨；#63.34乃至阿耨多羅三藐三菩提~1790淨，果亦淨。
%52.132 （二）「諸法淨」與「般若淨」無二無別
復次，須菩提！色淨故即般若波羅蜜淨，般若波羅蜜淨即色淨。#63.35
受、想、行、識淨故#63.36即般若波羅蜜淨，般若波羅蜜淨即受、想、行、識淨。
乃至一切種智淨即般若波羅蜜淨，般若波羅蜜淨即一切種智淨。
色淨、般若波羅蜜淨，無二無別、無斷無壞#63.37；乃至一切種智淨、般若波羅蜜淨，無二無別、無斷無壞。
%52.133 （三）「不二淨」與「諸法淨」無二無別
復次，須菩提！不二淨故色淨，不二淨故乃至一切種智淨。
何以故？是不二淨、色淨乃至一切種智淨，無二無別故。#63.38@t25p504c
%52.134 （四）「我等淨」與「諸法淨」無二無別
我淨、眾生淨乃至知者、見者淨故，色淨、受想行識淨乃至一切種智淨。
色淨乃至一切種智淨故，我、眾生乃至知者、見者淨。
何以故？我、眾生乃至知者、見者淨，色淨乃至一切種智淨，不二不別、無斷無壞。#63.39
^63.3
%52.168 （五）「三毒淨」與「諸法淨」無二無別
復次，須菩提！婬淨故#63.58色淨乃至一切種智淨。何以故？婬淨、色淨乃至一切種智淨，不二不別#63.59。瞋、癡淨故色淨乃至一切種智淨。何以故？瞋癡淨、色淨乃至一切種智淨，不二不別#63.60。#63.61
%52.169 （六）「十二因緣淨乃至一切種智淨」無二無別
復次，須菩提！無明淨故諸行淨，諸行淨故識淨，識淨故名色淨，名色淨故六入#63.62淨，六入淨故觸淨，觸淨故受淨，受淨故愛淨，愛淨故取淨，取淨故有淨，有淨故生淨，生淨故老死淨，老死淨故般若波羅蜜淨，般若波羅蜜淨故乃至檀波羅蜜淨，檀波羅蜜淨故內空淨，內空淨故乃至無法有法空淨，無法有法空淨故四念處淨，四念處淨故乃至一切智淨，一切智淨故一切種智淨。
何以故？是一切智淨、一切種智淨，不二不別、無斷無壞。#63.63
%52.170 （七）「六度淨、十八空淨、三十七道品淨乃至一切智淨」，展轉皆清淨，無二無別
復次，須菩提！般若波羅蜜淨故色淨，乃至般若波羅蜜淨故#63.64一切智淨。是般若波羅蜜淨、一切智淨，不二不別故。
須菩提！禪波羅蜜淨故乃至一切智淨，毘梨耶波羅蜜、羼提波羅蜜、尸羅波羅蜜、~1795檀波羅蜜淨故乃至一切智淨。#63.65
內空淨故乃至一切智淨，#63.66四念處淨故乃至一切智淨。#63.67
復次，須菩提！一切智淨故乃至般若波羅蜜淨。如是一一如先說。#63.68
%52.171 （八）「有為淨、無為淨」無二無別
復次，須菩提！有為淨故無為淨。何以故？有為淨、無為淨，@t25p505c不二不別、無斷無壞故。#63.69
%52.172 （九）「三世淨」無二無別
復次，須菩提！過去淨故未來、現在淨，未來淨故過去、現在淨，現在淨故過去、未來淨。何以故？現在淨、過去未來淨，不二不別、無斷無壞故。」#63.70
^63.4
%53.0 壹、舍利弗以十門歎#63.90般若深淨
%53.1 （壹）甚深門歎#63.91
爾時，舍利弗白佛言#63.92：「世尊！是淨甚深！」
佛言：「畢竟淨故。」
舍利弗言：「何法淨故，是淨甚深？」
佛言：「色淨故，是淨甚深。受、想、行、識淨故，四念處淨故乃至八聖道分淨故，佛十力淨故乃至十八不共法淨故#63.93，菩薩淨故、佛淨故#63.94，一切智、一切種智淨故──是淨甚深。」#63.95
~1800
%53.2 （貳）照明歎#63.96
「世尊！是淨明！」
佛言：「畢竟淨故。」
舍利弗言：「何法淨故，是淨明？」
佛言：「般若波羅蜜淨故，是淨明；乃至檀波羅蜜淨故，是淨明；四念處乃至一切智淨故，是淨明。」#63.97
%53.3 （參）不相續歎#63.98
「世尊！是淨不相續！」
佛言：「畢竟淨故。」
舍利弗言：「何法不相續故，是淨不相續？」
佛言：「色不去不相續故，是淨不相續；乃至一切種智不去不相續故，是淨不相續。」#63.99
%53.4 （肆）無垢歎#63.100
「世尊！是淨無垢！」
佛言：「畢竟淨故。」
舍利弗言：「何法無@t25p506c垢故，是淨無垢？」
佛言：「色性常淨故，是淨無垢；乃至一切種智性常淨故，是淨無垢。」#63.101
~1801
%53.5 （伍）無得無著歎#63.102
「世尊！是淨無得無著！」
佛言：「畢竟淨故。」
舍利弗言：「何法無得無著故，是淨無得無著？」
佛言：「色無得無著故，是淨無得無著；乃至一切種智無得#63.103無著故，是淨無得無著。」#63.104
%53.6 （陸）無生歎
%53.7 一、諸法無生
「世尊！是淨無生！」
佛言：「畢竟淨故。」
舍利弗言：「何法無生故，是淨無生？」
佛言：「色無生故，是淨無生；乃至一切種智無生故，是淨無生。」#63.105
%53.8 二、三界無生
%53.9 （一）欲界無生
「世尊！是淨不生欲界中！」
佛言：「畢竟淨故。」
舍利弗言：「云何是淨不生欲界中？」
佛言：「欲界性不可得故，是淨不生欲界中。」
~1802
%53.10 （二）色界無生
「世尊！是淨不生色界中！」
佛言：「畢竟淨故。」
舍利弗言：「云何是淨不生色界中？」
佛言：「色界性不可得故，是淨不生色界中。」
%53.11 （三）無色界無生
「世尊！是淨不生無色界中！」
佛言：「畢竟淨故。」
舍利弗言：「云何是淨不生無色界中？」
佛言：「無色界性不可得故，是淨不生無色界中。」#63.106
%53.12 （柒）無知歎#63.107
「世尊！是淨無知！」
佛言：「畢竟淨故。」
舍利弗言：「云何是淨無知？」
佛言：「諸法鈍故，是淨無知。」
「世尊！色無知，是淨淨！」#63.108
佛言：「畢竟淨故。」
舍利弗言：「云何色無知是淨淨？」
佛言：「色自性空故，色無知是淨淨。」
「世尊！受、想、行、識無知是淨淨！」
佛言：「畢竟淨故。」
舍利弗言：「云何受、想、行、識無知是淨淨？」
佛言：「受、想、行、識自性空故，無知是淨淨。」#63.109
~1803
%53.13 （捌）一切法淨歎
「世尊！一切法淨故，是淨淨！」
佛言：「畢竟淨故。」
舍利弗言：「云何一切法淨故，是淨淨？」
佛言：「一切法不可得故，一切法淨是淨淨。」#63.110
%53.14 （玖）無損益歎#63.111
「世尊！是般若波羅蜜於薩婆若無益無損！」
佛言：「畢竟淨故。」
舍利弗@t25p507a言：「云何般若波羅蜜於薩婆若無益無損？」
佛言：「法常住相故，般若波羅蜜於薩婆若無益無損。」#63.112
%53.15 （拾）無所受歎#63.113
「世尊！是般若波羅蜜淨，於諸法無所受！」
佛言：「畢竟淨故。」
舍利弗言：「云何般若波羅蜜淨，於諸法無所受？」
佛言：「法性不動故，是般若波羅蜜淨，於諸法無所受。」#63.114
^63.5
~1807
%53.37 貳、須菩提歎淨，如來述成
%53.38 （壹）須菩提舉我淨及我無邊二門以明法淨#63.137
%53.39 一、舉「我淨門」
%53.40 （一）我淨故五眾淨，我無所有故五眾畢竟淨
%53.41 1、舉「色」明
爾時，慧命須菩提白佛#63.138言：「世尊！我淨故色淨。」
佛言：「畢竟淨故。」
須菩提言：「以何因緣我淨故色淨畢竟淨？」
佛言：「我無所有故，色無所有畢竟淨。」
%53.42 2、舉「非色」明
「世尊！我淨故受想行識淨。」
佛言：「畢竟淨故#63.139。」
須菩提言：「何因緣故，我淨故#63.140受想行識淨畢竟淨？」
佛言：「我無所有故，受想行識無所有畢竟淨。」#63.141
%53.43 （二）我淨故六度乃至十八不共法淨，我無所有故六度乃至十八不共法是畢竟淨
「世尊！我淨故檀波羅蜜淨，我淨故尸羅波羅蜜淨，我淨故羼提波羅蜜淨，我淨故毘梨耶波羅蜜淨，我淨故禪波羅蜜淨。世尊！我淨故般若波羅蜜淨。世尊！我淨故四念處淨；世尊！我淨故乃至八聖道分淨。世尊！我淨故佛十力淨；世尊！我淨故乃至十八不共法淨。」
佛言：「畢竟淨故。」
須菩提言：「何因緣故，我淨檀波羅蜜淨，我淨乃至十八@t25p508a不共法淨？」
佛言：「我無所有故，檀波羅蜜無所有淨，乃至十八不共法無所有故淨。」#63.142
~1808
%53.44 （三）我淨故無為道果淨，我自相空故無為道果是畢竟淨
「世尊！我淨故須陀洹果淨，我淨故斯陀含果淨，我淨故阿那含果淨，我淨故阿羅漢果淨，我淨故辟支佛道淨，我淨故佛道淨。」
佛言：「畢竟淨。」
須菩提言：「何因緣故，我淨須陀洹果淨、斯陀含果淨、阿那含果淨、阿羅漢果淨、辟支佛道淨、佛道淨？」
佛言：「自相空故。」#63.143
%53.45 （四）我淨故一切智淨，我無相無念故一切智是畢竟淨
「世尊！我淨故一切智淨。」
佛言：「畢竟淨故。」
須菩提言：「何因緣故，我淨故一切智淨？」
佛言：「無相無念故。」#63.144
%53.46 （五）二淨故無得無著，無垢無淨故無得無著是畢竟淨
「世尊！以二淨故無得無著。」
佛言：「畢竟淨。」
須菩提言：「何因緣故，以二淨故u無得無著u是畢竟淨？」
佛言：「無垢無淨故。」#63.145
~1809
%53.47 二、舉「我無邊故五眾清淨」
「世尊！我無邊故色淨，受、想、行、識淨。」
佛言：「畢竟淨。」
須菩提言：「何因緣故，我無邊故色淨，受、想、行、識淨？」
佛言：「畢竟空、無始空故#63.146。」
%53.48 （貳）般若深淨，若能如是知則名菩薩般若波羅蜜#63.147
%53.49 一、能知空是名菩薩般若波羅蜜
須菩提白佛言：「世尊！若菩薩摩訶薩能如是知#63.148，是名菩薩摩訶薩般若波羅蜜。」
佛言：「畢竟淨故。」#63.149
%53.50 二、空有無礙
%53.51 （一）雖畢竟空而有道種慧
須菩提言：「何因緣故，菩薩摩訶薩能如是知，是名菩薩摩訶薩般若波羅蜜？」
佛言：「知道種#63.150故。#63.151」#63.152
~1810
%53.52 （二）具道種慧而復畢竟空
%53.53 1、正明
%53.54 （1）觀色等法畢竟空
「世尊！若菩薩摩訶薩行般若波羅蜜，以方便力故，作是念：『色不知色，受、想、行，識不知#63.153識；過去法不知過去法，未來法不知未來法，現在法不知現在法。』」#63.154
%53.55 （2）觀能修者及所修法皆空
佛言：「菩薩摩訶薩行般若波羅蜜，以方便力故，不作是念：『我施與彼人；我持戒，如是持戒；我修忍，如是修忍；我精進，如是精進；我入禪，如是入禪；我修智慧，如是修智慧；我得福德，如是得福德；我當入菩薩法位中，我當淨佛世界、成就眾生，當得一切種智。』
%53.56 2、釋因由
須菩提！@t25p508b是菩薩摩訶薩行般若波羅蜜，以方便力故，無諸憶想分別，內空、外空、內外空、空空、大空、第一義空、有為空、無為空、無始空、散空、性空、諸法空、自相空故。
%53.57 （三）結成
須菩提！是名菩薩摩訶薩行般若波羅蜜，方便力故無所礙。」#63.155
^64.1
$$壹、舍利弗以十門歎般若深淨（承上卷63）
$$貳、須菩提歎淨，如來述成（承上卷63）
%53.84 參、天主問礙法，須菩提明「菩薩麁礙無礙相」
%53.85 （壹）明「礙法」
%53.86 一、正明「礙」
爾時，釋提桓因問#64.2須菩提：「云何是求菩薩道善男子礙法？」
須菩提報釋提桓因言：「憍尸迦！有求菩薩道善男子、善女人取心相──所謂取檀波羅蜜相，取尸羅波羅蜜相、羼提波羅蜜相、毘梨耶波羅蜜相、禪波羅蜜相、般若波羅蜜相，取內空相、外空相、內外空相乃至無法有法空相，取四念處相乃至八聖道分相，取佛十力相乃至十八不共法相，取諸佛相，取於諸佛種善根相；是一切福德和合，取相迴向阿耨多羅三藐三菩提。#64.3
%53.87 二、結取相之過失
憍尸迦！是名求菩薩道善男子、善女人礙法。用是法故，不能無礙行般若波羅蜜。
何以故？憍尸迦！是色相不可迴向，受、想、行、識相不可迴向，乃至一切#64.4智相不可迴向。#64.5
~1815
%53.88 （貳）明「無礙」
%53.89 一、正明「無礙」
復次，憍尸迦！若菩薩摩訶薩示、教、利、喜他人阿耨多羅三藐三菩提，應#64.6示、教、利、喜一切諸法實相。若求菩薩道善男子、善女人行檀波羅蜜時，不應作是分@t25p509b別言：『我施與，我持戒，我忍辱，我精進，我入禪，我修智慧，我行內空、外空、內外空，乃至我行無法有法空，我修四念處，乃至我行阿耨多羅三藐三菩提。』善男子、善女人應如是示、教、利、喜他人阿耨多羅三藐三菩提。#64.7
%53.90 二、結得二益
%53.91 （一）自無錯謬
若如是示、教、利、喜阿耨多羅三藐三菩提，自無錯謬，
%53.92 （二）令他離礙
亦如佛所許#64.8法示、教、利、喜，令是善男子、善女人遠離一切礙法。」#64.9
%53.93 肆、佛為須菩提說「微細礙相」
%53.94 （壹）佛說「微細礙相」
爾時，佛讚#64.10須菩提：「善哉！善哉#64.11！如汝為諸菩薩說諸礙法。須菩提！汝今更聽我說#64.12微細礙相。汝#64.13須菩提！一心好聽！」
~1816佛告須菩提：「有善男子、善女人發阿耨多羅三藐三菩提心，取相念諸佛。須菩提！所可有相，皆是礙相。
又於諸佛從初發意乃至法住，於其中間所有善根取相憶念；取相憶念已，迴向阿耨多羅三藐三菩提。須菩提！所可有相，皆是礙相。
又於諸佛及弟子所有善根及餘眾生善根，取相迴向阿耨多羅三藐三菩提。須菩提#64.14！所可有相，皆是礙相。
何以故？不應取相憶念諸佛，亦不應取相念諸佛善根。」#64.15
%53.95 （貳）須菩提領悟稱歎，如來述成
%53.96 一、甚深歎〔諸法常離故般若甚深〕
須菩提白佛言：「世尊！是般若波羅蜜甚深！」
佛言：「一切法常離故。」#64.16
%53.97 二、敬禮歎#64.17
~1817
%53.98 （一）須菩提歎
須菩提言：「世尊！我當禮般若波羅蜜！」
%53.99 （二）佛總述
佛告須菩提：「是般若波羅蜜無起無作故，無有能得者。」
%53.100 （三）須菩提陳所悟
須菩提言：「世尊！一切諸法亦#64.18不可得。」#64.19
%53.101 （四）佛別述〔諸法一性，非二性故，離諸礙相〕
佛言：「一切法一性，非二性。#64.20
須菩提！是#64.21一#64.22法性，是亦無性；是無性即是性，是性不起不作。
如是，須菩提！菩薩摩訶薩若知諸法一性，所謂無性，無起無作，則遠離一切礙相#64.23。」#64.24
%53.102 三、難知難解歎
須菩提白佛言：「世尊！是般若波羅蜜，難知難解！」
佛言：「如所言。是般若波@t25p509c羅蜜，無見者、無聞者、無知者、無識者、無得者。」#64.25
%53.103 四、不思議歎
「世尊！是般若波羅蜜，不可思議！」
佛言：「如#64.26所言。是般若波羅蜜不從心生，不從色、受、想#64.27、行、識生，乃至不從十八不共法生。」#64.28
^64.2
%54.0 壹、辨「正行般若」
%54.1 （壹）明般若無作
須菩提白佛言#64.48：「是般若波羅蜜無所作。」
佛言：「作者不可得故，色不可得，乃至一切法不可得故。」#64.49
%54.2 （貳）明云何行般若
%54.3 一、須菩提問
「世尊！若菩薩摩訶薩欲行般若波羅蜜，應云何行？」
%54.4 二、佛答
%54.5 （一）不行諸法
佛告須菩提：「菩薩摩訶薩欲行般若波羅蜜，不行色，是行般若波羅蜜；不行受、想、行、識，是行般若波羅蜜。乃至不行一切種智，是行般若波羅蜜。
%54.6 （二）不行諸觀
不行色常、無常，是行般若波羅蜜；乃至一切種智不行常、無常，是行般若波羅蜜。
不行色若苦、若樂，是行般若波羅蜜；乃至不行一切種智若苦、若樂，是行般若波羅蜜。
不行色是我、非我，是行般若波羅蜜；乃至不行一切種智是我、非我，是行般若波羅蜜。
不行色淨、不淨，是行般若波羅蜜；乃至不行一切種智淨、不淨，是行般若波羅蜜。
~1822何以故？是色無所有性，云何有常無常、苦樂、我無我、淨不淨？受、想、行、識亦無所有性，云何有常無常乃至淨不淨？乃至一切種智無所有性，云何有常無常乃至淨不淨？
%54.7 （三）不行不具足
復次，須菩提！菩薩摩訶薩行般若波羅蜜時，不行色不具足，是行般若波羅蜜；不行受、想、行、識不具足，是行般若波羅蜜。#64.50乃至不行一切種智不具足，是行般若波羅蜜。
何以故？色不具足者，是不名色；如是亦不行，是行般若波羅蜜。受、想、行、識不具足者，是不名識；如是亦不行，是行般若波羅蜜。
乃至@t25p510cu不行u一切種智不具足者，是不名一切種智；如是亦不行，是行般若波羅蜜。」#64.51
%54.8 三、須菩提歎佛善說礙不礙相
須菩提白佛言：「未曾有也！世尊善說求菩薩道善男子、善女人礙不礙相。」#64.52
%54.9 四、佛述成，復明不行諸法不礙，是行般若波羅蜜
佛言：「如是！如是！須菩提！佛善說求菩薩道善男子、善女人礙不礙相。
復次，須菩提！若菩薩摩訶薩行般若波羅蜜時，不行色不礙，是行般若波羅蜜；不行受、想、行、識不礙，是行般若波羅蜜。不行眼不礙，是行般若波羅蜜；不行耳、鼻、舌、身不礙，是行般若波羅蜜；不行意不礙，是行般若波羅蜜。不行檀波羅蜜不礙，是行般若波羅蜜；不行尸羅波羅蜜不礙，是行般若波羅蜜；不行羼提波羅蜜不礙，是行般若波羅蜜；不行毘梨耶波羅蜜不礙，是行般若波羅蜜；不行禪波羅蜜不礙，是行般若波羅蜜；不行般若波羅蜜不礙，是行般若波羅蜜；乃至不行一切種智不礙，是行般若波羅蜜。
須菩提！菩薩摩訶薩如是行般若波羅蜜時，知色是不礙，知受、想、行、識是不礙；乃至知一切種智#64.53是不#64.54礙；知須陀洹果不礙，知斯陀含果不礙，知阿那含果不礙，知~1823阿羅漢果不礙#64.55，知辟支佛道不礙，知阿耨多羅三藐三菩提道不礙。」#64.56
%54.10 （參）須菩提讚歎般若法、行般若人
%54.11 一、歎般若法
%54.12 （一）須菩提領解稱歎
爾時，慧命須菩提白佛言：「未曾#64.57有也！世尊！是甚深法，若說亦不增不減，若不說亦不增不減。」
%54.13 （二）如來述成，更明深理
佛語須菩提：「如是！如是！是#64.58甚深法若說亦不增不減，若不說亦不增不減。
譬如佛盡形壽，若讚、若毀虛空#64.59──讚時亦不增不減，毀時亦不增不減。
須#64.60菩提！如幻人，若讚時不增不減，毀時亦不增不減；讚時不喜，毀時不@t25p511a憂。
須菩提！諸法#64.61相亦如是，若說亦如本不異，若不說亦如本不異。」#64.62
%54.14 二、歎行般若人
%54.15 （一）歎菩薩所為甚難，諸法雖不可得而菩薩能大莊嚴
%54.16 1、標歎
須菩提白佛言#64.63：「世尊！諸菩薩摩訶薩所為甚難！修行是般若波羅蜜時，不憂不#64.64喜，而能習行#64.65般若波羅蜜，於阿耨多羅三藐三菩提亦不轉還。何以故？世尊！修般若波羅蜜，如修虛空。如虛空中無般若波羅蜜，無禪#64.66、無毘梨耶、無羼提、無~1824尸羅、無檀波羅蜜；如虛空中無色，無受、想、行、識，亦無內空、外空、內外空乃至無法有法空，無四念處乃至無八聖道分，無佛十力乃至無十八不共法，無須陀洹果、斯陀含果、阿那含果、阿羅漢果，無辟支佛道，無阿耨多羅三藐三菩提。修般若波羅蜜，亦如是。#64.67
世尊！應禮是諸菩薩摩訶薩，能大#64.68莊嚴。#64.69
%54.17 2、舉喻顯義
%54.18 （1）為眾生大莊嚴，如為虛空大莊嚴
世尊！是人為眾生大莊嚴、勤精進，如為虛空大莊嚴、勤精進。#64.70
%54.19 （2）欲度眾生，如欲度虛空
世尊！是人#64.71欲度眾生，如欲度虛空。
%54.20 （3）為度虛空等眾生故大莊嚴
世尊！是諸菩薩摩訶薩大莊嚴，為虛空等眾生大莊嚴。
%54.21 （4）欲度眾生，如欲舉虛空
世尊！是人大莊嚴欲度眾生，為如舉虛空。#64.72
%54.22 （二）歎菩薩能大精進、大勇猛，欲度眾生故發無上菩提心
%54.23 1、標歎
世尊！諸菩薩摩訶薩大精進力，欲度眾生故，發阿耨多羅三藐三菩提心。
世尊！諸菩薩摩訶薩大#64.73莊嚴，欲度眾生故，發阿耨多羅三藐三菩提心。
~1825世尊！諸菩薩摩訶薩大勇猛，為度如虛空等眾生故，發阿耨多羅三藐三菩提心。#64.74
%54.24 2、釋因由
何以故？世尊！若三千大千世界滿中諸佛，譬如竹葦、甘蔗、稻麻、叢林，諸佛若一劫、若減一劫說法，一一佛度無量無邊阿僧祇眾生令入涅槃。世尊！是眾生性亦不減#64.75、亦不增#64.76。#64.77何以故？眾生無所有故、眾生離故。乃至十方世界中諸佛所度眾生，亦@t25p511b如是。
%54.25 3、結成
世尊！以是因緣故，我如是說：『是人欲度眾生故，發阿耨多羅三藐三菩提心，為欲度虛空。』」
%54.26 （肆）一比丘歡喜領悟歎法
是時，有一比丘作是言：「我當#64.78禮般若波羅蜜！般若波羅蜜中雖無法生、無法滅，而有戒眾、定眾、慧眾、解脫眾、解脫知見#64.79眾，而有諸須陀洹、諸斯陀含、諸阿那含、諸阿羅漢、諸辟支佛，有諸佛，而有佛寶、法寶、比丘僧寶，而有轉法輪。」#64.80
^64.3
%54.64 貳、所行既成，不假外護
%54.65 （壹）欲習般若，應當習空
爾時，釋提桓因語須菩提#64.110：「若菩薩摩訶薩習般若波羅蜜，為習何法？」
須菩提語釋提桓因言：「憍尸迦！是菩薩摩訶薩習般若波羅蜜，為習空。」
%54.66 （貳）如所說行，即為真守護
%54.67 一、天主問
釋提桓因白佛言：「世尊！若善男子、善女人受持般若波羅蜜，親近、讀#64.111、誦、說、~1830正憶念，我當作何等護#64.112？」#64.113
%54.68 二、須菩提答
%54.69 （一）明無法可護
爾時，須菩提語釋提桓因言：「憍尸迦！汝頗見是法可守護者#64.114不？」
釋提桓因言：「不也！須菩提！我不見是法可守護者。」
%54.70 （二）不離正觀即是護
%54.71 1、法說
須菩提言：「憍尸迦！若善男子#64.115、善女人如般若波羅蜜中所說行，即是守護，所謂常不遠離如所說般若波羅蜜行。是善男子、善女人，若人、若非人不得其便，當知是善男子、善女人不遠離般若波羅蜜。
%54.72 2、喻說
%54.73 （1）虛空及夢等喻
憍尸迦！若人欲護#64.116行般若波羅蜜菩薩，為欲護虛空。
憍尸迦！於汝意云何？汝能護夢、焰、影、響、幻、化不？」
釋提桓因言：「不能護。」
「若人欲護行般若波羅蜜諸菩薩摩訶薩亦如是，徒自疲苦。
憍尸迦！於汝意云何？能護佛所化不？」
釋提桓因言：「不能護。」
「若人欲護行般若波羅蜜諸菩薩摩訶薩亦如是。
%54.74 （2）無為法喻
憍尸迦！於汝意云何？能護法性、實際、如、不可思議性不？」
釋提桓因言：「不能護。」
「若人欲護行般若波羅蜜諸菩薩摩訶薩亦如是。」
%54.75 （參）明正觀相
%54.76 一、天主問
爾時，釋提桓因問須菩提：「云何菩薩摩訶薩行般若波羅蜜，知見諸法如夢、如焰、如影、如響#64.117、如幻、如化？諸菩薩摩訶薩如所知見故，不念夢、不念是夢、不念用~1831夢、不念我夢#64.118？焰、影、響、幻、化，亦如是。」#64.119
%54.77 二、須菩提答
%54.78 （一）正明
須菩提言：「憍尸迦！若菩薩摩訶薩行般若波羅蜜，不念色、不念是色#64.120、不念用色、不念@t25p512c我色，是菩薩摩訶薩亦能不念夢、不念是夢、不念用夢、不念我夢#64.121，乃至化#64.122亦不念化、不念是化、不念用化、不念我化；受、想、行、識亦如是。
乃至一切智，不念一切智、不念是一切智、不念用一切智、不念我一切智，是菩薩摩訶薩亦能不念夢、不念是夢、不念用夢、不念我夢；乃至化亦如是。#64.123
%54.79 （二）結義
如是，憍尸迦！菩薩摩訶薩知諸法如夢、如焰、如影、如響、如幻、如化。」
^64.4
#64.152
%54.108 參、勸信受持般若，說般若得無量福德
%54.109 （壹）諸佛同說般若應信受
~1835
%54.110 一、諸天來集
爾時，佛神力故，三千大千世界#64.153中諸四天王天、三十三天、夜摩天、兜率陀天、化樂天、他化自在天，梵身天、梵輔天、梵眾天、大梵天、少光天，乃至淨居天──是一切諸天以天栴檀遙散佛上，來詣佛所，頭面禮佛足，却住一面。
%54.111 二、勸信
%54.112 （一）諸佛同說般若
%54.113 1、現在十方佛同說般若
爾時，四天王天、釋提桓因及三十三天、梵天王乃至諸淨居天，佛神力故，見東方千佛說法，亦如是相、如是名字，說是般若波羅蜜品；諸比丘皆字須菩提#64.154，問難般若波羅蜜品者皆字釋提桓因；南西北方、四維、上下亦如是各千佛現。
%54.114 2、三世諸佛同說般若
爾時，佛告須菩提：「彌勒菩薩摩訶薩#64.155得阿耨多羅三藐三菩@t25p513c提時，亦當於是處#64.156說般若波羅蜜；如#64.157賢劫中諸菩薩摩訶薩得阿耨多羅三藐三菩提時，亦當於是處說般若波羅蜜。」#64.158
%54.115 3、明教門同
%54.116 （1）須菩提三問
須菩提白佛言：「世尊！彌勒菩薩摩訶薩得阿耨多羅三藐三菩提時，用何相、何因、何義#64.159說是般若波羅蜜義？」#64.160
~1836
%54.117 （2）佛三答
%54.118 A、答初問：用何相說般若#64.161
佛告#64.162須菩提：「彌勒菩薩摩訶薩得阿耨多羅三藐三菩提時，色非常非無常，當如是說法；色非苦非樂、色非我非無我、色非淨非不淨，當如是說法；色非縛非解，當如是說法。受、想、行、識非常非無常乃至非縛非解，當#64.163如是說法。
色非過去、色非未來、色非現在，當如是說法；受、想、行、識亦如是。#64.164
色畢竟淨，當如是說法；受、想、行、識畢竟淨，當如是說法；乃至一切智畢竟淨，當如是說法。」#64.165
%54.119 B、答第二問：用何因說般若#64.166
%54.120 （A）須菩提歎般若清淨
須菩提白佛言#64.167：「世尊！是般若波羅蜜清淨。」#64.168
~1837
%54.121 （B）佛答：五眾等法清淨故般若清淨
佛言：「色清淨故，般若波羅蜜清淨；受、想、行、識清淨故，般若波羅蜜清淨。」#64.169
%54.122 C、答第三問：用何義說般若#64.170
%54.123 （A）五眾等法不生不滅、不垢不淨故般若清淨
%54.124 a、法說
「世尊！云何色清淨故般若波羅蜜清淨？云何受、想、行、識清淨故般若波羅蜜清淨？」
佛言：「若色不生不滅#64.171、不垢不淨，是名色清淨#64.172；受想行識不生不滅、不垢不淨，是名受想行識清淨。#64.173
%54.125 b、舉喻
復次，須菩提！虛空清淨故#64.174，般若波羅蜜清淨。」
「世尊！云何虛空清淨故般若波羅蜜清淨？」
佛言：「虛空不生不滅故清淨，般若波羅蜜亦如是。#64.175
%54.126 （B）五眾等法如虛空不可取、不可染污故般若清淨
%54.127 a、法說
復次，須菩提！色不污故，般若波羅蜜清淨；受、想、行、識不污故，般若波羅蜜清淨。」#64.176
~1838
%54.128 b、舉喻
「世尊！云何色不污故般若波羅蜜清淨？受、想、行、識不污故般若波羅蜜清淨？」
佛言：「如虛空不可污故，虛空清淨。」#64.177
「世尊！云何如虛空不可污故@t25p514a虛空清淨？」
佛言：「虛空不可取故虛空清淨，虛空清淨故般若波羅蜜清淨。#64.178
%54.129 （C）虛空可說故般若清淨
復次，須菩提！虛空可#64.179說#64.180故，般若波羅蜜清淨。」
「世尊！云何虛空可說故般若波羅蜜清淨？」
佛言：「因虛空中二聲#64.181出#64.182，般若波羅蜜亦如虛空可說故清淨。#64.183
%54.130 （D）虛空不可說故般若清淨
~1839須菩提！虛空不可說故，般若波羅蜜清淨。」
「世尊！云何虛空不可說故般若波羅蜜清淨？」
佛言：「如虛空不#64.184可說故，般若波羅蜜清淨。#64.185
%54.131 （E）虛空不可得故般若清淨
復次，如虛空不可得故，般若波羅蜜清淨。」
「世尊！云何如虛空不可得故般若波羅蜜清淨？」
佛言：「如虛空無所得相，般若波羅蜜亦如虛空無所得相#64.186故清淨。
%54.132 （F）一切法畢竟淨，無生滅垢淨，故般若淨
復次，須菩提！一切法不生不滅、不垢不淨故，般若波羅蜜清淨。」
「世尊！云何一切法不生不滅、不垢不淨故般若波羅蜜清淨？」
佛言：「一切法畢竟清淨故，般若波羅蜜清淨。」
^65.1
$$參、勸信受持，說般若得無量福德（承上卷64）
$$（壹）諸佛同說般若應信受（承上卷64）
%54.164 （貳）信受般若，離眾病患，諸天隨護
須菩提白佛言：「世尊！若善男子、善女人受持是般若波羅蜜，親近、正憶念者，終不病眼，耳、鼻、舌、身#65.1亦終不病，身無刑#65.2殘，亦不衰耄#65.3，終不橫死。無數百千萬諸天──四天王天乃至淨居諸天皆悉隨從聽受。#65.4
%54.165 （參）為大眾說般若得無量福德
%54.166 一、須菩提說
六齋日──月八日、二十三日、十四日#65.5、二十九日、十五日、三十日，諸天眾會；善男子為法師者，在所說般若波羅蜜處#65.6皆悉來集。
是善男子、善女人在大眾中說是般若波羅蜜，得無量、無邊、阿僧祇、不可思議、不可稱量福德。」
%54.167 二、佛述成，並明得無量福德之因緣
%54.168 （一）佛述成
佛告須菩提：「如是！如是！是善男子、善女人，若六齋日──月八日、二十三日、十四日、二十九日、十五日、三十日，在諸天眾前說是#65.7般若波羅蜜，是善男子、善女人得無量、無邊、阿僧祇、不可思議、不可稱量福德。
%54.169 （二）明得無量福德之因緣
%54.170 1、歎般若為大珍寶，能拔苦，能與樂
何以故？須菩提！般若波羅蜜是大珍寶。何等是大珍寶？
~1844
%54.171 （1）令離苦
是般若波羅蜜能拔地獄、畜生、餓鬼及人中貧窮；
%54.172 （2）令得樂
能與剎利、婆羅門大姓、居士大家，能與四天王天處乃至非有想非無想處，能與須陀洹果、斯陀含果、阿那含果、阿羅漢果、辟支佛道、阿耨多羅三藐三菩提。
何以故？是般若波羅蜜中廣說十善道、四禪、四無量心、四無色定，四念處乃至八聖道分，檀波羅蜜、尸羅波羅蜜、@t25p515b羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜，廣說內空乃至無法有法空，廣說佛十力乃至一切#65.8智。
從是中學，出生剎利大姓、婆羅門大姓、居士大家，出生四天王天、三十三天、夜摩天、兜率陀天、化樂天、他化自在天，梵身天、梵輔天、梵眾天、大梵天，光天、少光天、無量光天、光音天，淨天、少淨天、無量淨天、遍淨天，阿那婆伽#65.9天、得福天、廣果天、無想天、阿浮呵那天、不熱天、快見天、妙見天、阿迦尼吒天，虛空無邊處天、識無邊處天、無所有處天、非有想非無想處天。
是法中學，得須陀洹果、斯陀含果、阿那含果、阿羅漢果，得#65.10辟支佛道，得阿耨多羅三藐三菩提。
%54.173 （3）結
以是故，須菩提！般若波羅蜜名為大珍寶。
%54.174 2、歎般若為無所得珍寶
珍寶波羅蜜中，無有法可得若生若滅、若垢若淨、若取若捨；珍寶波羅蜜，亦無有法若善若不善、若世間若出世間、若有漏若無漏、若有為若無為。
以是故，須菩提！是名無所得珍寶波羅蜜。#65.11
%54.175 3、歎般若為無染珍寶
須菩提！是珍寶波羅蜜，無有法能染污。何以故？所用染#65.12法不可得故。
須菩提！以是故名無染珍寶波羅蜜。#65.13
~1845
%54.176 （三）勸菩薩如般若而行故得利益
%54.177 1、能自利利他，斷諸戲論，嚴土熟生
須菩提！若菩薩摩訶薩行般若波羅蜜時，亦如是不知，亦如是不分別，亦如是不得，亦如是不戲論，是為能修行般若波羅蜜；亦能禮覲諸佛，從一佛國至一佛國，供養、恭敬、尊重、讚歎諸佛；遊諸佛剎，成就眾生、淨佛國土。#65.14
%54.178 2、明般若無有力無非力，即是諸法實相，常住不異
%54.179 （1）正明
須菩提！是般若波羅蜜於諸法無有力、無非力，亦無受、亦無與，不生不滅、不垢不淨、不增不減。
是波羅蜜亦非過去、非未來、非現在；不捨欲界、不住欲界，@t25p515c不捨色界、不住色界，不捨無色界、不住無色界。#65.15
是般若波羅蜜不與檀波羅蜜亦不捨，#65.16不與尸波羅蜜亦不捨，不與羼提波羅蜜亦不捨，不與毘梨耶波羅蜜亦不捨，不與禪波羅蜜亦不捨，不與般若波羅蜜亦不捨。
不與內空亦不捨，乃至不與無法有法空亦不捨。不與四念處亦不捨#65.17，乃至不與八聖道分亦不捨。不與佛十力亦不捨，乃至不與十八不共法亦不捨。
不與須陀洹果亦不捨，乃至不與阿羅漢果亦不捨；不與辟支佛道亦不捨，乃至不與一切智亦不捨。
是般若波羅蜜不與阿羅漢法、不捨凡人法，不與辟支佛法、不捨阿羅漢法，不與佛法、不捨辟支佛法。
是般若波羅蜜亦不與無為法、不捨有為法。
%54.180 （2）釋因由
何以故？若有諸佛、若無諸佛，是諸法相常住不異，法相、法住、法位常住，不謬不失故。」#65.18
^65.2
%54.211 肆、諸天得益稱歎，佛示轉法輪真義
%54.212 （壹）諸天歡喜供養，稱歎見第二法輪轉
爾時，諸天子虛空中立，發大音聲，踊躍歡喜，以漚#65.51鉢羅華、波頭摩華#65.52、拘物頭華#65.53、~1850分陀利華#65.54而散佛上，如#65.55是言：「我等於閻浮提見第二法輪轉#65.56。」
是中無量百千天子得無生法忍。
%54.213 （貳）佛答#65.57
%54.214 一、法輪非第一轉、非第二轉，無法有法空故無轉還
佛告須菩提：「是法輪#65.58非第一轉、非第二轉。是般若波羅蜜不為轉故出#65.59、不為還故出，無法#65.60有法空故。」#65.61
%54.215 二、諸法自相空故，般若波羅蜜無轉無還
%54.216 （一）須菩提問
須菩提白佛言：「世尊！云何無法有法空故，般若波羅蜜不為轉、不為還故出？」
%54.217 （二）佛答
佛言：「般若波羅蜜般若波羅蜜相空，乃至檀波羅蜜檀波羅蜜相空；內空內空相空，乃至無法有法空無法有法空相空；四念處四念處相空，乃至八聖道分八聖道分相空；佛十力佛十力相空，乃至十八不共法十八不共法相空；須陀洹果須陀洹果相空，斯陀含果斯陀含果相空，阿那含果阿那含果相空，阿羅漢果阿羅漢果相空，辟支佛道辟支佛道相空，一切種智一切種智相空。」#65.62
%54.218 伍、須菩提歡喜稱歎，以二諦說般若
%54.219 （壹）須菩提歎般若波羅蜜是摩訶波羅蜜，雖得無上菩提亦無所得，雖轉法輪而無所轉
須菩提白佛言：「世尊！諸菩薩摩訶薩般若波羅蜜是摩訶波羅蜜！
~1851何以故？雖一切@t25p517a法自相#65.63空，而諸菩薩摩訶薩因般若波羅蜜得阿耨多羅三藐三菩提，亦無法可得。
轉法輪，亦無法可轉，亦無法可還；是摩訶般若#65.64波羅蜜中，亦無有法可見。何以故？是法不可得若轉、若還，一切法畢竟不生故。
何以故？是空相不能轉、不能還，無相相不能轉、不能還，無作相不能轉、不能還。#65.65
%54.220 （貳）以二諦說般若
%54.221 一、世俗諦──十門清淨說
若能如是（1）說般若波羅蜜，（2）教、（3）照#65.66、（4）開、（5）示，（6）分別，（7）顯現，#65.67（9）解釋，（10）淺易──有能如是教者，是名清淨說般若波羅蜜。#65.68
%54.222 二、勝義諦──畢竟空無說者，亦無畢定福田
亦無說者、亦無受者、亦無證者；若無說、無受、無證，亦無滅者，是說法中亦無畢定福田。」#65.69
^65.3
%54.248 陸、歎般若導諸行到彼岸究竟#65.104
%54.249 （壹）法說歎（No.01～No.17）
爾時，慧命須菩提白佛言：
%54.250 一、無邊波羅蜜，如虛空無邊故（No.01）
「世尊！無邊波羅蜜是般若波羅蜜。」
佛言：「如虛空無邊故。」（一）#65.105
%54.251 二、等波羅蜜，一切法等故（No.02）
「世尊！等波羅蜜是般若波羅蜜。」
佛言：「諸法等故。」#65.106（二）
%54.252 三、離波羅蜜，畢竟空故（No.03）
「世尊！離波羅蜜是般若波羅蜜。」
佛言：「畢竟空故。」（三）
%54.253 四、不壞波羅蜜，一切法不可得故（No.04）
「世尊！不壞波羅蜜是般若波羅蜜。」
佛言：「一切法不可得故。」#65.107（四）
%54.254 五、無彼岸波羅蜜，無名無身故（No.05）
「世尊！無彼岸波羅蜜是般若波羅蜜。」
佛言：「無名無身故。」#65.108（五）
~1857
%54.255 六、空種波羅蜜，出入息不可得故（No.06）
「世尊！空種波羅蜜是般若波羅蜜。」
佛言：「入出息不可得故。」#65.109（六）
%54.256 七、不可說波羅蜜，覺觀不可得故（No.07）
「世尊！不可說波羅蜜是般若波羅蜜。」
佛言：「覺觀不可得故。」（七）
%54.257 八、無名波羅蜜，受、想、行、識不可得故（No.08）
「世尊！無名波羅蜜是般若波羅蜜。」
佛言：「受、想、行、識不可得故。」#65.110（八）
%54.258 九、無去波羅蜜，一切法無來無去故（No.09）
「世尊！不去波羅蜜是般若波羅蜜。」
佛言：「一切法不來故。」#65.111（九）
%54.259 十、無移波羅蜜，一切法不可伏故（No.10）
「世尊！無移#65.112波羅蜜是般若波羅蜜。」
佛言：「一切法不可伏#65.113故。」#65.114（十）
%54.260 十一、盡波羅蜜，一切法畢竟盡故（No.11）
「世尊！盡波羅蜜是般若波羅蜜。」
佛言：「一切法畢竟盡故。」#65.115（十一）
%54.261 十二、無生波羅蜜，一切法不滅故（No.12）
「世尊！不生波羅蜜是般若波羅蜜。」
佛言：「一切法不滅故。」（十二）
~1858
%54.262 十三、不滅波羅蜜，一切法不生故（No.13）
「世尊！不滅波羅蜜是般若波羅蜜。」
佛言：「一切法不生故。」#65.116（十三）
%54.263 十四、無作波羅蜜，作者不可得故（No.14）
「世尊！無作波羅蜜是般若波羅蜜。」
佛言：「作者不可得故。」（十四）
%54.264 十五、無知波羅蜜，知者不可得故（No.15）
「世尊！無知波羅蜜是般若波羅蜜。」
佛言：「知者不可得故。」#65.117（十五）
%54.265 十六、不到波羅蜜，生死不可得故（No.16）
「世尊！不到波羅蜜是般若波羅蜜。」
佛言：「生死不可得故。」#65.118（十六）
%54.266 十七、不失波羅蜜，一切法不失故（No.17）
「世尊！不失波羅蜜是般若波羅蜜。」
佛言：「一切法不失故。」（十七）
^65.4
%54.291 （貳）譬喻歎（No.18～No.22）
%54.292 一、夢波羅蜜，夢中所見不可得故（No.18）
「世尊！夢波羅蜜是般若波羅蜜。」
佛言：「乃至夢中所見不可得故。」（十八）#65.138
%54.293 二、響波羅蜜，聞聲者不可得故（No.19）
「世尊！響波羅蜜是般若波羅蜜。」
佛言：「聞聲者不可得故。」（十九）
%54.294 三、影波羅蜜，鏡面不可得故（No.20）
「世尊！影波羅蜜是般若波羅蜜。」
佛言：「鏡面不可得故。」#65.139（二十）
%54.295 四、焰波羅蜜，水流不可得故（No.21）
「世尊！焰#65.140波羅蜜是般若波羅蜜。」@t25p519b
佛言：「水流不可得故。」#65.141（二十一）
~1862
%54.296 五、幻波羅蜜，術事不可得故（No.22）
「世尊！幻波羅蜜是般若波羅蜜。」
佛言：「術事不可得故。」#65.142（二十二）
%54.297 （參）離過歎（No.23～No.43）
%54.298 一、不垢波羅蜜，諸煩惱不可得故（No.23）
「世尊！不垢波羅蜜是般若波羅蜜。」
佛言：「諸煩惱不可得故。」（二十三）
%54.299 二、無淨波羅蜜，煩惱虛誑故（No.24）
「世尊！無淨波羅蜜是般若波羅蜜。」
佛言：「煩惱虛誑故。」#65.143（二十四）
%54.300 三、不污波羅蜜，處不可得故（No.25）
「世尊！不污波羅蜜是般若波羅蜜。」
佛言：「處不可得故。」#65.144（二十五）
%54.301 四、不戲論波羅蜜，一切戲論憶想分別滅故（No.26）
「世尊！不戲論波羅蜜是般若波羅蜜。」
佛言：「一切戲論破故。」（二十六）
%54.302 五、無念波羅蜜，一切念破故（No.27）
「世尊！不念波羅蜜是般若波羅蜜。」
佛言：「一切念破故。」#65.145（二十七）
%54.303 六、不動波羅蜜，法性常住故（No.28）
「世尊！不動波羅蜜是般若波羅蜜。」
佛言：「法性常住故。」#65.146（二十八）
~1863
%54.304 七、無染波羅蜜，知一切法妄解故（No.29）
「世尊！無染波羅蜜是般若波羅蜜。」
佛言：「知一切法妄解故。」#65.147（二十九）
%54.305 八、不起波羅蜜，一切法無分別故（No.30）
「世尊！不起波羅蜜是般若波羅蜜。」
佛言：「一切法無分別故。#65.148」#65.149（三十）
%54.306 九、寂滅波羅蜜，一切法相不可得故（No.31）
「世尊！寂滅波羅蜜是般若波羅蜜。」
佛言：「一切法相不可得故。」（三十一）
%54.307 十、無欲波羅蜜，欲自性不可得故（No.32）
「世尊！無欲波羅蜜是般若波羅蜜。」
佛言：「欲不可得故。」#65.150（三十二）
%54.308 十一、無瞋波羅蜜，瞋恚性畢竟無所有故（No.33）
「世尊！無瞋波羅蜜是般若波羅蜜。」
佛言：「瞋恚不實故。」（三十三）
%54.309 十二、無癡波羅蜜，無明黑闇破故（No.34）
「世尊！無癡波羅蜜是般若波羅蜜。」
佛言：「無明黑闇滅故。」（三十四）
%54.310 十三、無煩惱波羅蜜，分別憶想虛妄故（No.35）
「世尊！無煩惱波羅蜜是般若波羅蜜。」
佛言：「分別憶想虛妄故。」#65.151（三十五）
~1864
%54.311 十四、無眾生波羅蜜，眾生無所有故（No.36）
「世尊！無眾生波羅蜜是般若波羅蜜。」
佛言：「眾生無所有故。」（三十六）
%54.312 十五、斷波羅蜜，諸法不起故（No.37）
「世尊！斷#65.152波羅蜜是般若波羅蜜。」
佛言：「諸法不起故。」#65.153（三十七）
%54.313 十六、無二邊波羅蜜，離二邊故（No.38）
「世尊！無二邊波羅蜜是般若波羅蜜。」
佛言：「離二邊故。」（三十八）
%54.314 十七、不破波羅蜜，一切法不相離故（No.39）
「世尊！不破波羅蜜是般若波羅蜜。」
佛言：「一切法不相離故。」#65.154（三十九）
%54.315 十八、不取波羅蜜，過聲聞、辟支佛地故（No.40）
「世尊！不取波羅蜜是般若波羅蜜。」
佛言：「過聲聞辟支佛地故。」#65.155（四十）
%54.316 十九、無分別波羅蜜，妄想分別不可得故（No.41）
「世尊！不分別波羅蜜是般若波羅蜜。」
佛言：「諸妄想不可得故。」（四十一）
%54.317 二十、無量波羅蜜，一切法量不可得故（No.42）
「世尊！無量波羅蜜是般若波羅蜜。」
佛@t25p519c言：「諸法量不可得故。」#65.156（四十二）
~1865
%54.318 二十一、虛空波羅蜜，一切法無所有故（No.43）
「世尊！虛空波羅蜜是般若波羅蜜。」
佛言：「一切法無所有故。」#65.157（四十三）
^65.5
%54.350 （肆）得門歎（No.44～No.90）
%54.351 一、歎行無不成
%54.352 （一）無常等觀#65.172（No.44～No.48）
%54.353 1、無常波羅蜜，一切法破壞故（No.44）
「世尊！無常波羅蜜#65.173是般若波羅蜜。」
佛言：「一切法破壞故。」#65.174（四十四）#65.175
%54.354 2、苦波羅蜜，一切法惱相故（No.45）
「世尊！苦波羅蜜是般若波羅蜜。」
佛言：「一切法惱#65.176相故。」#65.177（四十五）
%54.355 3、無我波羅蜜，一切法不著故（No.46）
「世尊！無我波羅蜜是般若波羅蜜。」
佛言：「一切法不著故。」（四十六）
%54.356 4、空波羅蜜，一切法不可得故（No.47）
「世尊！空波羅蜜是般若波羅蜜。」
佛言：「一切法不可得故。」（四十七）
%54.357 5、無相波羅蜜，一切法不生故（No.48）
「世尊！無相波羅蜜是般若波羅蜜。」
佛言：「一切法不生故。」（四十八）
~1869
%54.358 （二）十八空觀#65.178（No.49～No.65）
%54.359 1、內空波羅蜜，內法不可得故（No.49）
「世尊：內空波羅蜜是般若波羅蜜。」
佛言：「內法不可得故。」（四十九）
%54.360 2、外空波羅蜜，外法不可得故（No.50）
「世尊！外空波羅蜜是般若波羅蜜。」
佛言：「外法不可得故。」（五十）
%54.361 3、內外空波羅蜜，內外法不可得故（No.51）
「世尊！內外空波羅蜜是般若波羅蜜。」
佛言：「內外法不可得故。」（五十一）
%54.362 4、空空波羅蜜，空空法不可得故（No.52）
「世尊！空空波羅蜜是般若波羅蜜。」
佛言：「空空法不可得故。」（五十二）
%54.363 5、大空波羅蜜，一切法不可得故（No.53）
「世尊！大空波羅蜜是般若波羅蜜。」
佛言：「一切法不可得故。」（五十三）
%54.364 6、第一義空波羅蜜，涅槃不可得故（No.54）
「世尊！第一義空波羅蜜是般若波羅蜜。」
佛言：「涅槃不可得故。」（五十四）
%54.365 7、有為空波羅蜜，有為法不可得故（No.55）
「世尊！有為空波羅蜜是般若波羅蜜。」
佛言：「有為法不可得故。」（五十五）
%54.366 8、無為空波羅蜜，無為法不可得故（No.56）
「世尊！無為空波羅蜜是般若波羅蜜。」
佛言：「無為法@t25p520c不可得故。」（五十六）
%54.367 9、畢竟空波羅蜜，諸法畢竟不可得故（No.57）
「世尊！畢竟空波羅蜜是般若波羅蜜。」
佛言：「諸法畢竟不可得故。」#65.179（五十七）
%54.368 10、無始空波羅蜜，諸法無始不可得故（No.58）
「世尊！無始空波羅蜜是般若波羅蜜。」
佛言：「諸法#65.180無始不可得故。」（五十八）
~1870
%54.369 11、散空波羅蜜，散法不可得故（No.59）
「世尊！散空波羅蜜是般若波羅蜜。」
佛言：「散法不可得故。」（五十九）
%54.370 12、性空波羅蜜，有為無為法不可得故（No.60）
「世尊！性空波羅蜜是般若波羅蜜。」
佛言：「有為無為法不可得故。」#65.181（六十）
%54.371 13、諸法空波羅蜜，一切法不可得故（No.61）
「世尊！諸法空波羅蜜是般若波羅蜜。」
佛言：「一切法不可得故。」（六十一）
%54.372 14、自相空波羅蜜，自相離故（No.62）
「世尊！自相空波羅蜜是般若波羅蜜。」
佛言：「自相離故。」#65.182（六十二）
%54.373 15、無法空波羅蜜，無法不可得故（No.63）
「世尊！無法空波羅蜜是般若波羅蜜。」
佛言：「無法不可得故。」#65.183（六十三）
%54.374 16、有法空波羅蜜，有法不可得故（No.64）
「世尊！有法空波羅蜜是般若波羅蜜。」
佛言：「有法不可得故。」#65.184（六十四）
%54.375 17、無法有法空波羅蜜，無法有法不可得故（No.65）
「世尊！無法有法空波羅蜜是般若波羅蜜。」
佛言：「無法有法#65.185不可得故。」#65.186（六十五）
~1871
%54.376 （三）菩提分行（No.66～No.72）
%54.377 1、念處波羅蜜，身受心法不可得故（No.66）
「世尊！念處波羅蜜是般若波羅蜜。」
佛言：「身受心法不可得故。」（六十六）
%54.378 2、正懃波羅蜜，善不善法不可得故（No.67）
「世尊！正懃波羅蜜是般若波羅蜜。」
佛言：「善不善法不可得故。」（六十七）
%54.379 3、如意足波羅蜜，四如意足不可得故（No.68）
「世尊！如意足波羅蜜是般若波羅蜜。」
佛言：「四如意足不可得故。」（六十八）
%54.380 4、根波羅蜜，五根不可得故（No.69）
「世尊！根波羅蜜是般若波羅蜜。」
佛言：「五根不可得故。」（六十九）
%54.381 5、力波羅蜜，五力不可得故（No.70）
「世尊！力波羅蜜是般若波羅蜜。」
佛言：「五力不可得故。」（七十）
%54.382 6、覺波羅蜜，七覺分不可得故（No.71）
「世尊！覺波羅蜜是般若波羅蜜。」
佛言：「七覺分不可得故。」（七十一）
%54.383 7、道波羅蜜，八聖道分不可得故（No.72）
「世尊！道波羅蜜是般若波羅蜜。」
佛言：「八聖道分不可得故。」（七十二）
%54.384 （四）三三昧（No.73～No.75）
%54.385 1、無作波羅蜜，無作不可得故（No.73）
「世尊！無作波羅蜜是般若波羅蜜。」
佛言：「無作不可得故。」（七十三）
%54.386 2、空波羅蜜，空相不可得故（No.74）
「世尊！空波羅蜜是般若波羅蜜。」
佛言：「空相不可得故。」（七十四）
%54.387 3、無相波羅蜜，寂滅相不可得故（No.75）
「世尊！無相波羅蜜是般若波羅蜜。」
佛言：「寂滅相不可得故。」（七十五）
%54.388 （五）出世禪（No.76～No.77）
%54.389 1、背捨波羅蜜，八背捨不可得故（No.76）
「世尊！背#65.187捨波羅蜜是般若波羅蜜。」
佛言：「八背捨@t25p521a不可得故。」（七十六）
~1872
%54.390 2、定波羅蜜，九次第定不可得故（No.77）
「世尊！定#65.188波羅蜜是般若波羅蜜。」
佛言：「九次第定不可得故。」（七十七）
%54.391 （六）六度行（No.78～No.83）
     %54.392 1、檀波羅蜜，慳貪不可得故（No.78）
「世尊！檀波羅蜜是般若波羅蜜。」
佛言：「慳貪不可得故。」（七十八）
     %54.393 2、尸羅波羅蜜，破戒不可得故（No.79）
「世尊！尸羅波羅蜜是般若波羅蜜。」
佛言：「破戒不可得故。」（七十九）
     %54.394 3、羼提波羅蜜，忍、不忍辱不可得故（No.80）
「世尊！羼提波羅蜜是般若波羅蜜。」
佛言：「忍#65.189不忍辱不可得故。」（八十）
     %54.395 4、毘梨耶波羅蜜，懈怠、精進不可得故（No.81）
「世尊！毘梨耶波羅蜜是般若波羅蜜。」
佛言：「懈怠精進不可得故。」（八十一）
     %54.396 5、禪波羅蜜，定、亂不可得故（No.82）
「世尊！禪波羅蜜是般若波羅蜜。」
佛言：「定亂不可得故。」（八十二）
     %54.397 6、般若波羅蜜，癡、慧不可得故（No.83）
「世尊！般若波羅蜜是般若波羅蜜。」
佛言：「癡慧不可得故。」（八十三）
%54.398 二、歎果無不滿（No.84～No.90）
%54.399 （一）十力波羅蜜，一切法不可伏故（No.84）
「世尊！十力波羅蜜是般若波羅蜜。」
佛言：「一切法不可伏故。」#65.190（八十四）
%54.400 （二）無所畏波羅蜜，道種智不沒故（No.85）
「世尊！無所畏波羅蜜是般若波羅蜜。」
佛言：「道種智不沒故。」#65.191（八十五）
~1873
%54.401 （三）無礙智波羅蜜，一切法無障無礙故（No.86）
「世尊！無礙智波羅蜜是般若波羅蜜。」
佛言：「一切諸#65.192法無障無#65.193礙故。」#65.194（八十六）
%54.402 （四）佛法波羅蜜，過一切法故（No.87）
「世尊！佛法波羅蜜是般若波羅蜜。」
佛言：「過一切法故。」#65.195（八十七）
%54.403 （五）如實說波羅蜜，一切語言皆是如實故（No.88）
「世尊！如實說者#65.196波羅蜜是般若波羅蜜。」
佛言：「一切說#65.197如實故。」#65.198（八十八）
%54.404 （六）自然波羅蜜，一切法中得自在力故（No.89）
「世尊！自然波羅蜜是般若波羅蜜。」
佛言：「一切法中自在故。」#65.199（八十九）
%54.405 （七）佛波羅蜜，正知一切法、一切種故（No.90）
「世尊！佛波羅蜜是般若波羅蜜。」
佛言：「知一切法、一切種智#65.200故。」#65.201（九十）
^66.1
%55.0 壹、歎行般若人，讚般若功德，勸修般若
%55.1 （壹）讚歎行般若人
%55.2 一、明信受人之德
%55.3 （一）天主歎
爾時釋提桓因作是念：「若善男子、善女人得聞般若波羅蜜經耳者，是人於前世佛#66.2作功德，與善知識相隨，何況受持、親近、讀、誦、正憶念、如說行！當知是善男子、善女人多親近諸佛，能得聽、受#66.3、如說行，能問、能答；當知是善男子、善女人於前世多供養親近諸佛故，聞是深般若波羅蜜，不驚、不怖、不畏；當知是人亦於無量億劫行檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜。」#66.4
%55.4 （二）舍利弗歎
%55.5 1、正歎
爾時，舍利弗白佛言：「世尊！若有善男子、善女人聞是深般若波羅蜜，不驚、不怖、不畏，聞已受持、親近、如說習行，當知是善男子、善女人如阿鞞跋致菩薩摩訶薩。
%55.6 2、釋因由
何以故？世尊！是般若波羅蜜甚深！若先世不久行檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜，終不能信解深@t25p522b般若波羅蜜。
~1879
%55.7 二、明不信人之過失
世尊！若有善男子、善女人呰#66.5毀深般若波羅蜜者，當知是人前世亦呰毀深般若波羅蜜。何以故？是善男子、善女人聞說深般若波羅蜜時，無信無樂、心不清淨；當知是善男子、善女人先世不問不難諸佛及弟子：『云何應行檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜？云何應修內空乃至云何應修無法有法空？云何應修四念處乃至云何應修八聖道分？云何應修佛十力乃至云何應修十八不共法？』」
%55.8 （貳）天主述成、禮敬般若
%55.9 一、未久習者則不能信解般若
釋提桓因語舍利弗：「是深般若波羅蜜，若有善男子、善女人不久行檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜，不行內空乃至無法有法空，不行四禪、四無量心、四無色定，不行四念處乃至八聖道分，不行佛十力乃至十八不共法──如是人不信解是深#66.6般若波羅蜜，有何可怪！
%55.10 二、天主禮敬般若
大德舍利弗！我禮般若波羅蜜！禮般若波羅蜜，是禮一切智。」
%55.11 （參）如來述成，勸修般若
%55.12 一、如來述成
佛告釋提桓因：「如是！如是！憍尸迦！禮般若波羅蜜，是禮一切智。
%55.13 二、釋因由
何以故？憍尸迦！諸佛一切智皆從般若波羅蜜生，一切智即是般若波羅蜜。#66.7
%55.14 三、勸修
以是故，憍尸迦！善男子、善女人欲住一切智，當住般若波羅蜜。若善男子、善女人欲生道種智，當習行般若波羅蜜；欲斷一切諸結及習，當習行般若波羅蜜。善男子、善女人欲轉法輪，當習行般若波羅蜜。善男子、善女人欲得須陀洹果、斯陀含#66.8果、阿那含果、阿羅漢果，當習行般若波羅蜜；欲得辟支佛道，當習行般若@t25p522c波羅蜜；欲教眾生令得須陀洹果、斯陀含果、阿那含果、阿羅漢果、辟支佛道，當習行般若波羅蜜。若善男子、善女人欲教眾生令得阿耨多羅三藐三菩提，若欲總攝比丘僧，當習行般若波羅蜜。」
^66.2
%55.32 貳、習般若行
%55.33 （壹）論「住、習行」
~1882
%55.34 一、天主問云何住、云何習行
釋#66.33提桓因白佛言：「世尊！菩薩摩訶薩欲@t25p523b行般若波羅蜜時，云何名住般若波羅蜜、禪波羅蜜、毘梨耶波羅蜜、羼提波羅蜜、尸羅波羅蜜、檀波羅蜜？云何住內空#66.34乃至無法有法空？云何住四禪、四無量心、四無色定、五神通？云何住四念處乃至八聖道分？云何住佛十力乃至十八不共法？#66.35
世尊！菩薩摩訶薩云何習行般若波羅蜜乃至檀波羅蜜、內空乃至十八不共法？」#66.36
%55.35 二、佛答
%55.36 （一）稱美天主善問
佛語釋提桓因：「善哉！善哉！憍尸迦！汝能樂問是事，皆是佛神力！
%55.37 （二）正答
%55.38 1、明「不住」義
%55.39 （1）述所行
%55.40 A、不住蘊處界為習行般若
憍尸迦！若菩薩摩訶薩行般若波羅蜜時，若不住色中，為習行般若波羅蜜；若不住受、想、行、識中，為習行#66.37般若波羅蜜。
眼、耳、鼻、舌、身、意，色、聲、香、味、觸、法，眼界乃至意識界，亦如是。#66.38
%55.41 B、不住諸道法為各各自習其行
憍尸迦！若菩薩摩訶薩不住般若波羅蜜中，為習#66.39般若波羅蜜；不住禪波羅蜜中，為習禪波羅蜜；不住毘梨耶波羅蜜中，為習毘梨耶波羅蜜；不住羼提波羅蜜中，為習羼提波羅蜜；不住尸羅波羅蜜中，為習尸羅波羅蜜；不住檀波羅蜜中，為習檀波羅蜜。
如是，憍尸迦！是名菩薩摩訶薩不住般若波羅蜜，為習般若波羅蜜。
~1883憍尸迦！不住內空中，為習內空；乃至不住無法有法空，為習無法有法空；不住四禪，為習四禪；不住四無量心，為習四無量心；不住四無色定，為習四無色定；不住五神通，為習五神通；不住四念處，為習四念處；乃至不住八聖道分，為習行八聖道分；不住佛十力，為習行佛十力；乃至不住十八不共法，為習行十八不共法。
%55.42 （2）釋因緣
何以故？憍尸迦！是菩薩不得色可住、可習處；乃至十八不共法，不得十八不共法可住、可習處。#66.40
%55.43 2、不習一切法，是名習一切法，以諸法三際不可得故
復次，憍尸迦！菩薩@t25p523c摩訶薩不習色，若不習色，是名習色。受、想、行、識乃至十八不共法亦如是。#66.41
何以故？是菩薩摩訶薩，色前際不可得、中際不可得、後際不可得；乃至十八不共法亦如是。」
%55.44 （貳）舍利弗稱歎，佛述義
%55.45 一、歎般若法
%55.46 （一）甚深歎
舍利弗白佛言：「世尊！是般若波羅蜜甚深！」
佛言：「色如甚深故，般若波羅蜜甚深；受、想、行、識如甚深故，般若波羅蜜甚深。乃至十八不共法亦如是。」
%55.47 （二）難可測量歎
舍利弗言：「世尊！是般若波羅蜜難可測量！」
佛言：「色難可測量故，般若波羅蜜難可測量；受、想、行、識乃至十八不共法難可測量故，般若波羅蜜難可測量。」#66.42
%55.48 （三）無量歎
「世尊！是般若波羅蜜無量！」
佛言：「色無量故，般若波羅蜜無量；受、想、行、識乃至十八不共法無量故，般若波羅蜜無量。」#66.43
~1884
%55.49 二、論「般若行」
%55.50 （一）不行甚深
佛告舍利弗：「若菩薩摩訶薩行般若波羅蜜時，不行色甚深，為行般若波羅蜜；#66.44不行受、想、行、識，乃至不行十八不共法甚深，為行般若波羅蜜。
何以故？色甚深相為非色；受、想、行、識，乃至十八不共法甚深相#66.45為非十八不共法。如是不行，為行般若波羅蜜。#66.46
%55.51 （二）不行難測量
舍利弗！若菩薩摩訶薩行般若波羅蜜時，不行色難#66.47測量，為行般若波羅蜜；不行受、想、行、識，乃至不行十八不共法難測量，為行般若波羅蜜。
何以故？色難測量相為非色；受、想、行、識，乃至十八不共法難測量相為非十八不共法。
%55.52 （三）不行無量
舍利弗！若菩薩摩訶薩行般若波羅蜜時，不行色無量，為行般若波羅蜜；不行受、相#66.48、行、識，乃至不行十八不共法無量，為行般若波羅蜜。
何以故？色是無量相為非色；受、想、行、識，乃至十八不共法無量相為非十八不共法。
%55.53 三、誡說
%55.54 （一）顯「應說、不應說」
舍利弗@t25p524a白佛言：「世尊！是般若波羅蜜甚深，甚深相難見、難解、不可思量#66.49，不應在新發意菩薩前說。#66.50何以故？新發意菩薩聞是甚深般若波羅蜜，或當驚怖，心生疑悔，不信不行。
是甚深般若波羅蜜當在阿鞞跋致菩薩摩訶薩前說；是菩薩聞是甚深般若波羅蜜，不驚、不怖，心不疑悔，則能信行。」
~1885
%55.55 （二）明「為新發意者說深般若之過失」
釋提桓因問舍利弗：「若在新發意菩薩摩訶薩前說是深般若波羅蜜，有何等過？」
舍利弗報釋提桓因：「憍尸迦！若在新發意菩薩前說是深般若波羅蜜，或當驚怖，呰毀#66.51不信──是新發意菩薩或有是處。
若新發意菩薩聞是深般若波羅蜜，毀呰不信，種三惡道業；是業因緣故，久久難得阿耨多羅三藐三菩提。」
^66.3
#66.72
%55.83 四、歎行般若者
%55.84 （一）垂#66.73受記者聞法不怖
%55.85 1、天主問
釋提桓因問舍利弗：「頗有未受記菩薩摩訶薩聞是深般若波羅蜜不驚、不怖者不？」
%55.86 2、舍利弗答
舍利弗言：「如是！憍尸迦！若有菩薩摩訶薩聞是深般若波羅蜜不驚、不怖，當知是菩薩受#66.74阿耨多羅三藐三菩提記不久，不過一佛、兩佛。」#66.75
%55.87 3、佛述義
佛告舍利弗：「如是！如是！是菩薩摩訶薩久發意、行六波羅蜜、多供養諸佛，聞是深般若波羅蜜，不驚、不怖、不畏，聞即受持，如般若波羅蜜#66.76中#66.77所說行。」#66.78
~1889
%55.88 （二）舉喻明理
%55.89 1、初說二喻
%55.90 （1）夢行喻
%55.91 A、舉喻
爾時，舍利弗白佛言：「世尊！我欲說譬喻。如求菩薩道善男子、善女人夢中修行般若波羅蜜、入禪定、勤精進、具足忍辱、守護於戒、行布施，修行內空、外空，乃至坐於道場，當知是善男子、善女人近阿耨多羅三藐三菩提；何況菩薩摩訶薩欲得阿耨多羅三藐三菩提，覺#66.79時修#66.80行般若波羅蜜、入禪定、勤精進、具足忍辱、守護於戒、行布施，而不疾成#66.81阿耨多羅三藐三菩提、坐於道場！
%55.92 B、合法
世尊！善男子、善女人善根成就，得聞般若波羅蜜，受持乃至如說行；當知是菩薩摩訶薩久發意、種善根、多供養諸佛、與善知識相隨；是#66.82人能受持般若波羅蜜乃至正憶念，當知是人近受阿耨多羅三藐三菩提記。當知是善男子、善#66.83女人如阿鞞跋致菩薩摩訶薩，於阿耨多羅三藐三菩提不動轉，能得深般若波羅蜜；得已，能受持、讀、誦，乃至正憶念。#66.84
%55.93 （2）過嶮道喻
%55.94 A、舉喻
世尊！譬如人欲過百由旬、若二百、三百、四百由旬曠野嶮#66.85道，先見諸相──若放牧#66.86者、若壃界、@t25p525b若園#66.87林──如是等諸相，故知近城、邑#66.88、聚落。是人見是相已，作如#66.89是念：『如我所見相，當知城、邑、聚落不遠。』心得安隱，不畏賊難、惡蟲#66.90、飢渴。
%55.95 B、合法
世尊！菩薩摩訶薩亦如是，若得是#66.91深般若波羅蜜，受持、讀、誦乃至正憶念，~1890當知近受得阿耨多羅三藐三菩提記不久，當知是菩薩摩訶薩不應畏墮聲聞、辟支佛地。是諸先相，所謂甚深般若波羅蜜，得聞、得見、得受#66.92乃至正憶念故。」
%55.96 2、佛述成，令復說
佛告舍利弗：「如是！如是！汝復樂說者，便說。」
%55.97 3、舍利弗次舉三喻
%55.98 （1）近海喻
%55.99 A、舉喻
「世尊！譬如人欲見大海，發心往趣，不見樹相、不見山#66.93相，是人雖未見大海，知大海不遠。何以故？大海處平，無樹相、無山相故。
%55.100 B、合法
如是，世尊！菩薩摩訶薩聞是深般若波羅蜜、受持乃至正憶念時，雖未#66.94佛前受劫數之記──若劫百#66.95、千劫#66.96、萬劫、百千萬#66.97億劫，是菩薩自知近受阿耨多羅三藐三菩提記不久。何以故？我得聞是深般若波羅蜜，受持、讀、誦乃至正憶念故。
%55.101 （2）春樹喻
%55.102 A、舉喻
世尊！譬如初春，諸樹陳#66.98葉已墮，當知此樹新葉華#66.99果出在不久。何以故？見是諸樹先相故，知今不久葉華果出#66.100；是時閻浮提人，見樹先相，皆大#66.101歡喜#66.102。
%55.103 B、合法
世尊！菩薩摩訶薩得聞是深般若波羅蜜，受持、讀、誦乃至正憶念、如說行，當知是菩薩善根成就、多供養諸佛。是菩薩應作是念：『先世善根所追，趣阿耨多羅三藐三菩提，以是因緣故，得見、得聞是深般若波羅蜜，受持、讀、誦乃至正憶念、如說行。』
是中諸天子曾見佛者，歡喜踊躍，作是念言：『先諸菩薩摩訶薩亦有如是受記先#66.103相，今是菩薩摩訶薩受阿耨多羅三藐三菩提記@t25p525c亦不久。』
~1891
%55.104 （3）懷妊喻
%55.105 A、舉喻
世尊！譬如母人懷妊#66.104，身體苦重，行步不便，坐起不安，眠食轉少，不喜言語，厭本所習，受苦痛故；有異母人見其先相，當知產生不久。
%55.106 B、合法
菩薩摩訶薩亦如是，種善根、多供養諸佛、久行六波羅蜜、與善知識相隨，善根成就，得聞深般若波羅蜜，受持、讀、誦乃至正憶念、如說行；諸菩薩#66.105亦知是菩薩摩訶薩得阿耨多羅三藐三菩提記不久。」
%55.107 4、佛述成
佛告舍利弗：「善哉！善哉！汝所樂說，皆是佛力。」
%55.108 （參）須菩提歎，佛述義
%55.109 一、歎行般若人
%55.110 （一）歎菩薩行諸道法廣益眾生
%55.111 1、須菩提讚佛
爾時，須菩提白佛言：「希有！世尊！諸多陀阿伽度、阿羅呵、三藐三佛陀#66.106善付諸菩薩摩訶薩事。」#66.107
%55.112 2、佛述付囑因緣──菩薩廣行利他
%55.113 （1）總明菩薩發心利益眾生
佛告須菩提：「是#66.108諸菩薩摩訶薩#66.109發阿耨多羅三藐三菩提心，安隱多眾生，令無量眾生得樂，憐愍、安#66.110樂、饒益諸天人故。
%55.114 （2）廣說
%55.115 A、以四攝、十善道成就眾生
是諸菩薩行菩薩道時，以四事攝無量百千眾生，所謂布施、愛語、利益、同事；亦以十善道成就眾生。#66.111
%55.116 B、具行四禪八定
自行初禪，亦教他人令行初禪；乃至自行非有想非無想處，亦教他人令行乃至非~1892有想#66.112非無想處。
%55.117 C、具行六度
自行檀波羅蜜，亦教他人令行檀波羅蜜；自行尸羅波羅蜜，亦教他人令行尸羅波羅蜜；自行羼提波羅蜜，亦教他人令行羼提波羅蜜；自行毘梨耶波羅蜜，亦教他人令行毘梨耶波羅蜜；自行禪波羅蜜，亦教他人令行禪波羅蜜；自行般若波羅蜜，亦教他人令行般若波羅蜜。
%55.118 D、教人得二乘果而自不證
是菩薩得般若波羅蜜，以方便力教眾生令得須陀洹果，自於內不證；教眾生令得斯陀含果、阿那含果、阿羅漢果，自於內不證；教眾生令得辟支佛道，自於內不證。
%55.119 E、具成眾德
自行六波羅蜜，亦教無量百千萬諸菩@t25p526a薩令行六波羅蜜。
自住阿鞞跋致地，亦教他人住#66.113阿鞞跋致地。
自淨佛世界#66.114，亦教他人淨佛世界。
自成就眾生，亦教他人成就眾生。
自得菩薩神通，亦教他人令得菩薩神通。
自淨陀羅尼門，亦教他人淨陀羅尼門。
自具足樂說辯才，亦教他人具足樂說辯#66.115才。
自受色成就，亦教他人令#66.116受色成就。#66.117
自成就三十二相#66.118，亦教他人成就三十二相。
~1893自成就童真地#66.119，亦教他人成就童真地。
自成就佛十力，亦教他人令成就佛十力。
自行四無所畏，亦教他人行#66.120四無所畏。
自行十八不共法，亦教他人行十八不共法。
自行大慈、大悲，亦教他人令行大慈大悲。
自得一切種智，亦教他人令得一切種智。
自離一切結使及習，亦教他人令離一切結使及習。
自轉法輪，亦教他人轉法輪。」
^67.1
~1905
%55.212 參、示留難事，勸速修行得大果報
%55.213 （壹）正舉留難，勸速修持
%55.214 一、須菩提說：甚深般若多有留難
須菩提言#67.53：「世尊！甚可怪！說是般若#67.54波羅蜜時，多有留難！」#67.55
%55.215 二、佛述
%55.216 （一）佛印可，勸速修持
佛言：「如是！如是！須菩提！是甚深般若波羅蜜，多有留難。
以是事故，善男子、善女人若欲書是般若波羅蜜時，應當疾書；若讀、誦、思惟、說、正憶念、修行時，亦應疾修行。#67.56何以故？是甚深般若波羅蜜，若書時，讀、誦、思惟、說、正憶念、修行時，不欲令諸難起故。善男子、善女人若能一月書成，當應勤書；若二月、三月、四月、五月、六月、七月，若一歲書成，亦當#67.57勤書；讀、誦、思惟、說、正憶念、修行，@t25p529a若一月得成就乃至一歲得成就，應當勤成就。
%55.217 （二）釋因由
何以故？須菩提！是珍寶中多有難起故。」
%55.218 （貳）以佛力故，魔難不成
%55.219 一、魔起惡心欲擾亂，雖興留難而不能得
%55.220 （一）須菩提說魔喜作留難
須菩提言：「世尊！是甚深般若波羅蜜中惡魔喜作留難故，不得令書，不得令讀、誦、思惟、說、正憶念、修行。」
%55.221 （二）佛述魔難不成
佛告須菩提：「惡魔雖欲留難是深般若波羅蜜令不得書、讀、誦、思惟、說、正憶念、修行，亦不能破壞是菩薩摩訶薩書般若波羅蜜乃至修行。」
%55.222 二、諸佛善觀識行法者，以護念故魔難不成
%55.223 （一）行持般若，諸佛護念
%55.224 1、舍利弗問
爾時，舍利弗白佛言：「世尊！誰力故，令惡魔不能留難菩薩摩訶薩書深般若波羅蜜乃至修行？」
~1906
%55.225 2、佛答
%55.226 （1）正明佛護
%55.227 A、釋迦牟尼佛力
佛言：「是佛力故，惡魔不能留難菩薩摩訶薩書深般若波羅蜜乃至修行。
%55.228 B、十方現在佛力
舍利弗！亦是十方世界#67.58現在諸佛力故，是諸佛擁護念是菩薩故，令魔不能留難菩薩摩訶薩、令不書成般若波羅蜜乃至修行。#67.59
%55.229 （2）釋因由
何以故？十方世界中現在無量無邊阿僧祇諸佛，擁護念是菩薩書深般若波羅蜜乃至修行；法應爾#67.60，無能作留難！#67.61
%55.230 （3）勸念佛恩
舍利弗！善男子、善女人應當作是念：『我書是深般若波羅蜜乃至修行，皆是十方諸佛力。』」
%55.231 （二）諸佛見證所行，護念持般若者
%55.232 1、諸佛現護持
舍利弗言：「世尊！若有善男子、善女人書是深般若波羅蜜乃至修行，皆是佛力故，當知是人是諸佛所護。」
佛言：「如是！如是！舍利弗！當知若有善男子、善女人書是深般若波羅蜜乃至修行，皆是佛力故，當知亦是#67.62諸佛所護。」#67.63
%55.233 2、諸佛現觀知
%55.234 （1）舍利弗說：若有書持乃至修行般若者，十方諸佛皆以佛眼見知念
舍利弗言：「世尊！十方現在無量無邊阿僧祇諸佛皆識、皆以佛眼見是善男子、善女人書深般若波羅蜜乃至修行時。」#67.64
~1907
%55.235 （2）佛述成
%55.236 A、佛印成：善持般若故佛見知念
佛言：「如是！如是！舍利弗！十方現在無量無邊阿僧祇諸佛皆識、皆以佛眼見是善男子、善女人書深般若@t25p529b波羅蜜乃至修行時。#67.65
%55.237 B、佛復示：近無上道故，於般若多信解，亦供養般若故諸佛念知
舍利弗！是中求菩薩道#67.66善男子、善女人若#67.67書是深般若波羅蜜，受持、讀、誦、正憶念、如說修行，當知是人近阿耨多羅三藐三菩提不久。#67.68
舍利弗！善男子、善女人書是深般若波羅蜜，受持、讀、誦乃至正憶念，是人於深般若波羅蜜多信解相，亦供養、恭敬、尊重、讚歎是深般若波羅蜜，華香、瓔珞#67.69乃至幡蓋供養。#67.70
舍利弗！諸佛皆識、皆以佛眼見是善男子、善女人。
%55.238 （參）行般若者，具大功德
%55.239 一、明得大果報
是善男子、善女人#67.71供養功德，當得大利益、大果報。#67.72
舍利弗！是善男子、善女人以是供養功德因緣故，終不墮惡道中，乃至阿鞞跋致地，終不遠離諸佛。#67.73
~1908舍利弗！是善男子、善女人以是#67.74善根因緣故，乃至阿耨多羅三藐三菩提，終不遠離六波羅蜜，終不遠離內空乃至無法有法空，終不遠離四念處乃至八聖道分，終不遠離佛十力乃至阿耨多羅三藐三菩提。#67.75
^67.2
#67.110
%55.282 二、明般若隨方利益#67.111
%55.283 （一）利益三方眾生
%55.284 1、南方
%55.285 （1）勸修
舍利弗！是深般若波羅蜜，佛般涅槃後，當至南方國土#67.112，#67.113是中比丘、比丘尼、~1914優婆塞、優婆夷當書是深般若波羅蜜，當受持、讀、誦、思惟、說、正憶念、修行。
%55.286 （2）得益
%55.287 A、世間益
以是善根因緣故，終不墮惡道中，受天上、人中樂；
%55.288 B、出世間益
增益六波羅蜜，供養、恭敬、尊重、讚歎諸佛；漸以聲聞、辟支佛、佛乘而得涅槃。
%55.289 2、西方
%55.290 （1）勸修
舍利弗！是深般若波羅蜜，從南方當轉至西方所在處，是中比丘、比丘尼、優婆塞、優婆夷當書是深般若波羅蜜，當受持、讀、誦、思惟、說、正憶念、修行。
%55.291 （2）得益
%55.292 A、世間益
以是善根因緣故，終不墮惡道中，受天上、人中樂；
%55.293 B、出世間益
增益六波羅蜜，供養、恭敬、尊重、讚歎諸佛；漸以聲聞、辟支佛、佛乘而得涅槃。
%55.294 3、北方
%55.295 （1）明般若於北方作佛事
%55.296 A、勸修
舍利弗！是深般若波羅蜜，從西方當轉至北方所在處，是中比丘、比丘尼、優婆塞、優婆夷當書是深般若波羅蜜，當受持、讀、誦、思惟、說、正憶念、修行。
~1915
%55.297 B、得益
%55.298 （A）世間益
以是善根因緣故，終不墮惡道中，受天上、人中樂；
%55.299 （B）出世間益
增益六波羅蜜，供養、恭敬、尊重、讚歎諸佛；漸以聲聞、辟支佛、佛乘而得涅槃。
%55.300 C、別明
%55.301 （A）化導利根、鈍根者
舍利弗！是深般若波羅蜜，是時北方當作佛事。何以故？舍利弗！我法盛時，無有滅相。#67.114
舍利弗！我已念是善男子#67.115、善女人受持#67.116是深般若波羅蜜乃至修行；亦念是善男子、善女人能書是般若#67.117波羅蜜，恭敬、供養、尊重、讚歎，華香乃至幡蓋。
舍利弗！是善男子、善女人以是善根因緣故，終不墮惡道中，受天上、人中樂；增益六波羅蜜，供養、恭敬、尊重、讚歎諸佛；漸以聲聞、辟支佛、佛乘而得涅槃。#67.118
%55.302 （B）諸佛念知讚歎供養、受持般若人
何以故？舍利弗！我以佛眼見是人，我亦稱譽、讚歎；十方@t25p531a世界中無量無邊阿僧祇諸佛亦以佛眼見是人，亦稱譽、讚歎。」
     %55.303 （2）般若在北方廣行異餘三方
%55.304 A、初問答：深般若以何因緣當在北方廣行
%55.305 （A）舍利弗問
舍利弗白佛言：「世尊！是深般若波羅蜜後時當在北方廣行耶？」
%55.306 （B）佛答
佛言：「如是！如是！
~1916舍利弗！是深般若波羅蜜後時在北方當廣行。
舍利弗！後時於北方，是善男子、善女人若聞是深般若波羅蜜，若書、受持#67.119、讀、誦、思惟、說、正憶念、如說修行，當知是善男子、善女人久發大乘心、多供養諸佛、種諸#67.120善根、久與善知識相隨。」
%55.307 B、第二問答：後時北方有幾許人求佛道，能書寫、讀誦般若乃至如說修行
%55.308 （A）舍利弗問
舍利弗白佛言：「世尊！後時北方當有幾所善男子、善女人求佛道，書深般若波羅蜜，乃至如說修行？」
%55.309 （B）佛答#67.121
%55.310 a、求佛道者多，聞深般若不怖者少
佛告舍利弗：「後時北方雖多有求佛道善男子、善女人，少有善男子、善女人#67.122聞是深般若波羅蜜不沒、不#67.123驚、不怖、不畏。
%55.311 b、能信受深般若者，願行必深廣
%55.312 （a）明能信深般若而不怖畏之因緣
%55.313 Ⅰ、多供養諸佛，具足萬行，多利益眾生，於後生時不失菩提心，亦教化他人
何以故？是人多親近供養諸佛、多諮問諸佛，是人必能具足般若波羅蜜、禪波羅蜜、毘梨耶波羅蜜、羼提波羅蜜、尸羅波羅蜜、檀波羅蜜，具足四念處，乃至具足十八不共法。
舍利弗！是善男子、善女人善根純厚#67.124故，能多利益眾生，為阿耨多羅三藐三菩提。#67.125
何以故？我今為是善男子、善女人說應薩婆若法，過去諸佛亦為是善男子、善女人說應薩婆若法。
以是因緣故，是人後生時續得阿耨多羅三藐三菩提心，亦為他人說阿耨多羅三藐三菩提法。#67.126
~1917
%55.314 Ⅱ、煩惱薄，常一心和合，魔不能壞
是善男子、善女人皆一心和合，魔、若魔民不能沮壞阿耨多羅三藐三菩提心，何況惡行人毀呰行深般若波羅蜜者能壞其阿耨多羅三藐三菩提心！#67.127
%55.315 Ⅲ、自得勝法，復教眾生令住善根，趣向無上菩提
舍利弗！是求菩薩道諸善男子、善女人，聞是深般若波羅蜜，大得#67.128法喜、法@t25p531b樂，亦立多人於善根，為阿耨多羅三藐三菩提。#67.129
^67.3
~1920
%55.341 （b）明信般若人發誓願、得果報
%55.342 Ⅰ、於諸佛前立誓願
是善男子、善女人，於我前立誓願：『我行菩薩道時，當度無數百千萬億眾生，令發阿耨多羅三藐三菩提心，示、教、利、喜#67.145，乃至阿鞞跋致地受記。』我知其心，我#67.146亦隨喜。#67.147
是善男子、善女人亦於過去諸佛前立誓願：『我行菩薩道時，當度無數百千萬億眾生，令發阿耨多羅三藐三菩提心，示、教、利、喜，乃至阿鞞跋致地受記。』
諸過去佛亦知其心而隨喜。
%55.343 Ⅱ、修廣大施、種大善根、得大果報，願生他方世界說般若化導眾生
舍利弗！是諸善男子、善女人所為心大，所受色、聲、香、味、觸、法亦大，亦能大施；能大施已，種大善根；種大善根已，得大果報。
為攝眾生故受身，能於眾生中捨內外所有物。
以是善根因緣故#67.148，發願欲生他方世界現在諸佛說深般若波羅蜜處；於諸佛前聞是深般若波羅蜜已，亦於彼示、教、利、喜百千萬億眾生，令發阿耨多羅三藐三菩提心。」#67.149
%55.344 （二）稱歎，釋疑
%55.345 1、舍利弗讚佛
舍利弗白佛言：「希有！世尊！佛於過去、未來、現在法無法不知，無法如#67.150相不~1921知，眾生之行無事不知。今佛悉知過去諸佛及菩薩、聲聞，亦知今現在十方諸佛世界菩薩及聲聞，亦知未來諸佛及菩薩、聲聞。#67.151
%55.346 2、釋疑
%55.347 （1）未來世人勤求六波羅蜜諸經是否皆能得
世尊！未來世有善男子、善女人勤求六波羅蜜，受持、讀、誦乃至修行，有得、有不得？」#67.152
佛告舍利弗：「若善男子、善女人一心精進勤求，當得應六波羅蜜諸經。」#67.153@t25p532b
%55.348 （2）以何因緣能得六波羅蜜深經
舍利弗白佛言：「善男子、善女人如是勤行#67.154，當#67.155得是應#67.156六波羅蜜深經#67.157？」
佛語舍利弗：「是善男子、善女人得是#67.158應六波羅蜜深經。
何以故？善男子、善女人為阿耨多羅三藐三菩提故，與眾生說法，示、教、利、喜，令住六波羅蜜中#67.159。
以是因緣故，是善男子、善女人後身轉生易得應六波羅蜜深經；得已，如六波羅蜜所說修行，精勤不息，乃至淨佛世界、成就眾生，得阿耨多羅三藐三菩提。」#67.160
^68.1
%56.0 壹、辨諸魔事
%56.1 （壹）須菩提問
慧#68.2命須菩提白佛言：「世尊！是善男子、善女人發阿耨多羅三藐三菩提心，行六波羅蜜，成就眾生、淨佛世界──佛已讚歎說其功德。世尊！云何善男子、善女人求於佛道生諸留難#68.3？」
%56.2 （貳）佛答
%56.3 一、依「說法時」辨魔事
%56.4 （一）樂說辯不即生
佛告須菩提：「樂說辯#68.4不即生──當知是菩薩魔事。」
須菩提言：「世尊！何因緣故，樂說辯不即生是菩薩魔事？」
佛言：「有菩薩摩訶薩行般若波羅蜜時，難具足六波羅蜜。以是因緣故，樂說辯不即生是菩薩魔事。#68.5
%56.5 （二）樂說辯卒生
復次，須菩提#68.6！樂說#68.7辯卒#68.8起──當知亦是菩薩魔事。
「世尊！何因緣故，樂說辯#68.9卒起復是魔事？」
~1925佛言：「菩薩摩訶薩行檀波羅蜜乃至般若波羅蜜，著樂說法；以是因緣故，樂說辯卒起──當知是菩薩魔事。#68.10
%56.6 二、依「書寫時」辨魔事
%56.7 （一）偃𠐻傲慢
復次，須菩提！書是般若波羅蜜經時，偃𠐻#68.11傲慢──當知是菩薩魔事。
%56.8 （二）戲笑亂心
復次，須菩提！書是經時，戲笑#68.12亂心──當知是菩薩魔事。
%56.9 （三）輕笑不敬
復次，須菩提！若書是經時，輕笑#68.13不敬──當知是菩薩魔事。
%56.10 （四）心亂不定
復次，須菩提！若書是經時，心亂不定──當知是菩薩魔事。
%56.11 （五）各各不和合
復次，須菩提！若書是經時，各各不和合──當知是菩薩魔事。#68.14
%56.12 三、依「受持、誦說、親近、正憶念時」辨魔事
%56.13 （一）總說六種魔事
%56.14 1、不得經中滋味便捨去
復次，須菩提！善男子、善女人作是念：『我不得是經中滋味。』便棄捨去──當知是菩薩魔事。
%56.15 2、偃𠐻傲慢
復次，須菩提！受持般若波羅蜜，讀、誦、說、若正憶念時，偃𠐻傲慢──當知是菩薩魔事。@t25p533b
%56.16 3、互相形笑
復次，須菩提！若受持般若波羅蜜經，親近、正憶念時，轉相形笑──當知是菩薩魔事。
~1926
%56.17 4、共相輕蔑
復次，須菩提！若受持般若波羅蜜經，讀、誦、正憶念、修行時，共相輕蔑#68.15──當知是菩薩魔事。
%56.18 5、散亂心
若受持般若波羅蜜，讀、誦乃至正憶念時，散亂心──當知是菩薩魔事。
%56.19 6、心不和合
若受持般若波羅蜜，讀、誦乃至正憶念時，心不和合──當知是菩薩魔事。」#68.16
%56.20 （二）別釋「不得經中滋味便捨去」是為魔事
%56.21 1、明捨去因緣
%56.22 （1）未得受記
%56.23 A、不得經中滋味
須菩提白佛言：「世尊！世尊說：『善男子、善女人作是念：「我不得經中滋味。」便棄捨去──當知是菩薩魔事。』世尊！何因緣故，菩薩不得經中滋味，便棄捨去？」#68.17
佛言：「是菩薩摩訶薩前世不久行般若波羅蜜、禪波羅蜜、毘梨耶波羅蜜、羼提波羅蜜、尸羅波羅蜜、檀波羅蜜，是人聞說是般若波羅蜜，便從坐起，作是念言：『我於般若波羅蜜中無記。』心不清淨，便從坐起去──當知是菩薩魔事。」#68.18
%56.24 B、不與授記之因──未入法位故
須菩提白佛言：「世尊！何因緣故不與受#68.19記，聞說是深般若波羅蜜時，便從坐起~1927去？」
佛告須菩提：「若菩薩未入法位中，諸佛不與受#68.20阿耨多羅三藐三菩提記。#68.21
%56.25 （2）不說菩薩名字、生處
復次，須菩提！聞說般若波羅蜜時，菩薩作是念：『我是中無名字。』心不清淨──當知是菩薩魔事。」
須菩提言：「何因緣故，是深般若波羅蜜中，不說是菩薩名字？」
佛言：「未受#68.22記菩薩，諸佛不說名字。」
復次，須菩提！是菩薩摩訶薩作是念：『是般若波羅蜜中，無我生處名字，若聚落、城邑。』是人不欲聽聞般若波羅蜜，便從會中起去。
%56.26 2、明捨般若而去之過失
是人如所起念時，念念却#68.23一劫，甫#68.24當更勤精進求阿耨多羅三藐三菩提。#68.25
^68.2
%56.67 四、棄般若而學二乘經是為魔事
%56.68 （一）捨根攀枝葉喻
%56.69 1、標宗舉喻
復次，須菩提！菩薩學餘經，棄捨般若波羅蜜，終不能至薩婆若。
善男子、善女人為捨#68.74其根而攀枝葉──當知亦是菩薩魔事。」
%56.70 2、學「餘經」不能至薩婆若
須菩提白佛言：「世尊！何等是餘經，善男子、善女人所#68.75學，不能至薩婆若？」
佛言：「是聲聞所應行經，所謂四念處、四正勤、四如意足、五根、五力、七覺分、八聖道分，空、無相、無作解脫門。善男子、善女人住是中，得須陀洹果、斯陀含果、阿那含果、阿羅漢果──是名聲聞所行經#68.76，不能至薩婆若。如是，善男子、善女人捨般若波羅蜜，親近是餘經。
~1934
%56.71 3、學般若經能至薩婆若之因
何以故？須菩提！般若波羅蜜中，出生諸菩薩摩訶薩，成就世間、出世間法。#68.77須菩提！菩薩摩訶薩學般若波羅蜜時，亦學世間、出世間法。#68.78
%56.72 （二）狗捨主從奴求食喻
須菩提！譬如狗不@t25p535a從大家求食，反從#68.79作務#68.80者索。如是，須菩提！當來世有善男子、善女人棄捨#68.81深般若波羅蜜而攀枝葉──聲聞、辟支佛所應行經，當知是為菩薩魔事。#68.82
%56.73 （三）捨象反觀其跡喻
須菩提！譬如有人欲得見象，見已，反觀其跡#68.83。須菩提！於汝意云何？是人為黠#68.84不？」
須菩提言：「為不黠。」
佛言：「諸求佛道善男子、善女人亦復如是，得深般若波羅蜜，棄捨去，取聲聞、辟支佛所應行經。須菩提！當知是為菩薩魔事。
%56.74 （四）捨海反求牛跡水喻
須菩提！譬如人欲見大海，見已，反#68.85求牛跡水。作是念：『大海水能與此等不？』須菩提！於汝意云何？是人為黠不？」
須菩提言：「為不黠。」
~1935佛言：「當來世有求佛道#68.86善男子、善女人亦如是，得深般若波羅蜜，棄捨去，取聲聞、辟支佛所應行經──當知是亦菩薩#68.87摩訶薩魔事。
%56.75 （五）欲作帝釋殿而度量日月宮喻
須菩提！譬如工匠、若工匠#68.88弟子欲擬作釋提桓因勝殿#68.89，而揆#68.90則#68.91日月宮殿#68.92。須菩提！於汝意云何？是人為黠不？」#68.93
須菩提言：「為不黠。」
「如是，須菩提！當來世有薄福德善男子、善女人求佛道者，得是深般若波羅蜜，棄捨去，取#68.94聲聞、辟支佛所應行經中求薩婆若。須菩提！於汝意云何？是人為黠不？」
須菩提言：「為不黠。」
佛言：「當知亦是菩薩魔事。
%56.76 （六）不識聖王而取小王喻
須菩提！譬如有人欲見轉輪聖王，見而不識，後見諸小國王，取其相貌，作#68.95如是言：『轉輪聖王與此何異？』須菩提！於汝意云何？是人為黠不？」
須菩提言：「為不黠。」
「須菩提！當來世有薄福德善男子、善女人求佛道者得是深般若波羅蜜，棄捨去，取聲聞、辟支佛所應行經，持求薩婆若。須菩提！於汝意云何？是人為黠不？」@t25p535b
須菩提言：「為不黠。」
「當知是為#68.96菩薩魔事。
%56.77 （七）捨百味食反食稗#68.97飯喻
須菩提！譬如飢人得百味食，棄捨去，反食六十日穀飯。須菩提！於汝意云何？是~1936人為黠不？」#68.98
須菩提言：「為不黠。」
佛言：「當來世有求佛道善男子、善女人得聞深般若波羅蜜，棄捨去，取聲聞、辟支佛所應行經，持求薩婆若，於汝意云何？是人為黠不？」
須菩提言：「為不黠。」
「當知是亦菩薩魔事。#68.99
%56.78 （八）棄摩尼寶取水精珠喻
須菩提！譬如人得無價#68.100摩尼珠，反持比#68.101水精珠。須菩提！於汝意云何？是人為黠不？」
須菩提言：「為不黠。」
佛言：「當來世有求#68.102佛道善男子、善女人得聞深般若波羅蜜，棄捨去，取聲聞、辟支佛所應行經，持求薩婆若，是人為黠不？」
須菩提言：「為不黠。」
「當知是亦菩薩魔事。
%56.79 五、書般若時樂說不如法事是為魔事
復次，須菩提！是#68.103求佛道善男子、善女人書是深般若波羅蜜時，樂說不如法事，不得書成般若波羅蜜。所謂樂說色、聲、香、味、觸、法，樂說持戒、禪定、無色定，樂說檀波羅蜜乃至般若波羅蜜，樂說四念處乃至阿耨多羅三藐三菩提。
何以故？須菩提！是般若波羅蜜中無樂說相。
須菩提！般若波羅蜜不可思議相，般若波羅蜜不生不滅相，般若波羅蜜不垢不淨相，般若波羅蜜不亂不散相，般若波羅蜜無說#68.104相，般若波羅蜜無言無義#68.105相，般若波~1937羅蜜無所得相。何以故？須菩提！是般若波羅蜜中無是諸相#68.106。
須菩提！若有善男子、善女人求菩薩道者書是般若波羅蜜經時，以是諸法散亂心──當知是亦菩薩魔事。」#68.107
%56.80 六、於般若執著無所有，著文字、無文字皆是魔事
%56.81 （一）依「書寫事」辨魔事
%56.82 1、於般若執著無所有是為魔事
%56.83 （1）顯般若自性無故不可書
須菩提白佛言：「世尊！是般若波羅蜜可書耶？」
佛言：「不可書。何以故？般若波羅蜜自性@t25p535c無故，禪波羅蜜、毘梨耶波羅蜜、羼提波羅蜜、尸羅波羅蜜、檀波羅蜜，乃至一切種智自性無故#68.108；若自性無，是不名為性#68.109，無法不能書#68.110無法。
%56.84 （2）取著無所有則成魔事
須菩提！若求菩薩道善男子、善女人作是念：『無法是深般若波羅蜜。』當知即是菩薩魔事。」#68.111
~1938
%56.85 2、著文字書般若，著無文字亦是魔事
「世尊！是求菩薩道善男子、善女人用文#68.112字書般若波羅蜜，自念：『我書是#68.113般若波羅蜜。』以字#68.114著般若波羅蜜──當知亦是#68.115菩薩魔事。
何以故？世尊！是般若波羅蜜無文字，禪波羅蜜、毘梨#68.116耶波羅蜜、羼提波羅蜜、尸羅波羅蜜、檀波羅蜜無有文字。世尊！色無文字，受、想、行、識無文字，乃至一切種智無文字。世尊！若求菩薩道善男子、善女人著無文字般若波羅蜜，乃至著無文字一切種智──當知亦是菩薩魔事。#68.117
%56.86 （二）例餘「讀、誦、說、正憶念、如說修行」辨魔事
讀、誦、說、正憶念、如說修行，亦如是。」
%56.87 七、書般若乃至修行般若時，起種種異念是為魔事
「復次，須菩提！求佛道善男子、善女人書般若波羅蜜時，若#68.118國土念起、聚落念起、城邑念起、方念起，若聞謗毀其師念起#68.119，若念父母及兄弟姊妹諸餘親里、若念賊、若念旃#68.120陀羅#68.121、若念眾女、若念婬女──如是等種種諸餘異念留難；惡魔復益其念，~1939破壞書般若波羅蜜，破壞讀#68.122、誦、說、正憶念、如說修行。須菩提！當知是亦菩薩#68.123魔事。#68.124
%56.88 八、鈍根人著利養是為魔事
復次，須菩提！求佛道善男子、善女人得名譽、恭敬、布施、供養，所#68.125謂衣服、飲食、臥床、疾藥、種種樂具，善男子、善女人書是般若波羅蜜經，受#68.126、讀、誦#68.127乃至正憶念時，愛#68.128著是事，不得書成般若波羅蜜，乃至正憶念──當知是亦菩薩魔事。#68.129
%56.89 九、無方便人著魔所與二乘經而捨般若是為魔事
復次，須菩提！求佛道善男子、善女人書般若波羅蜜@t25p536a乃至如說修行時，惡魔方便持諸餘深經與是菩薩摩訶薩；有方便#68.130者，不應貪著惡魔所與諸餘深經。何以故？是經不能令人至薩婆若故。
是中無方便菩薩摩訶薩聞是諸餘深經，便捨深般若波羅蜜。
須菩提！我──是般若波羅蜜中，廣說諸菩薩摩訶薩方便道；諸菩薩摩訶薩應當從是中求。須菩提！今善男子、善女人求菩薩道，捨是深般若波羅蜜，於魔所與聲聞、辟支佛深經中求方便道──當知亦是菩薩魔事。#68.131
^68.3
%56.105 十、明師弟不和合為魔事
%56.106 （一）約「有無懈惰」辨
%56.107 1、說法人惰
復次，須菩提！聽法人欲書、持般若波羅蜜，讀、誦、問義、正憶念；說法人懈墮，不欲為說──當知是為#68.166菩薩摩訶薩魔事。
%56.108 2、聽法人惰
須菩提！說法之人心不懈墮，欲令書、持般若波羅蜜；聽法者不欲受之──二心不和，當知是為#68.167魔事。
%56.109 （二）約「欲不欲相離」辨
%56.110 1、說法人不欲而離
復次，須菩提！聽法人若欲書、持般若波羅蜜，讀、誦乃至正憶念；說法者欲至他方──當知是為魔事。
%56.111 2、聽法人不欲而離
須菩提！說法人欲令書、持般若波羅蜜；聽法者欲至他方──二心不和，當知是為魔事。
%56.112 （三）約「多欲少欲」辨
%56.113 1、說法人多欲
復次，須菩提！說法人貴重布施衣服、飲食、臥具、醫藥、資生#68.168之物；聽法人少~1944欲知足，行遠離行，攝念精進，一心智慧。兩不和合，不得書般#68.169若波羅蜜，受持、讀、誦、問義、正憶念──當知是為魔事。
%56.114 2、聽法者多欲
須菩提！說法人少欲知足，行遠離行，攝念精進，一心智慧；聽法者貴重布施衣服、飲食、臥具、醫藥、資生之物。兩不和合，不得書、持般若波羅蜜，讀、誦、問義、正憶念──當知是為魔事。
%56.115 （四）約「行不行頭陀」辨
%56.116 1、聽法人不行頭陀
復次，須菩提！說法者受十二頭陀：一、作阿蘭若，二、常乞食，三、納衣#68.170，四、一坐食，五、節量食，六、中後不飲漿，七、塚間住，八、樹下住，九、露地住，十、常坐不臥，十一、次第乞食，十二、但三衣；#68.171聽法人不受十二頭陀──不作阿蘭若乃至不受但三衣。兩不和合，不得書、持般若波羅蜜，讀、誦、問義、正憶念──當知是為魔事。
%56.117 2、說法者不行頭陀
須菩提！聽法者受十二頭陀，作阿蘭若乃至受但三衣；說法人不受十二頭陀──不作阿蘭若乃至不受但三衣。兩不和合，不得書、持般若波羅蜜，讀、誦、問義、正憶念──當知是為魔事。」
^69.1
#69.2
%56.145 （五）約「信戒有無」辨
「復次，須菩提！說法者有信、有善，欲書#69.3、受深般若波羅蜜乃至正憶念；聽法者無信、破戒惡行，不欲書、受深般若波羅蜜乃至正憶念──當知#69.4是為魔事。
須菩提！聽法者有信、有善，說法者無信、破戒惡行。兩不和合──當知@t25p538c是為魔事。
%56.146 （六）約「施、慳」辨
復次，須菩提！說法者能一切施，心不慳#69.5惜；聽法者悋惜不捨──當知是為魔事。
須菩提！聽法者一切能施，心不慳惜；說法者悋法不施。兩不和合，不得書、持般若波羅蜜乃至正憶念──當知是為魔事。
%56.147 （七）約「受不受供」辨
復次，須菩提！聽法者欲供養說法人衣服、飲食、臥具、醫藥、資#69.6生所須；說法者不欲受之──當知是為魔事。
須菩提！說法者欲#69.7供給聽法人衣服乃至資生所須；聽法者不欲受之。兩不和合，不得書、持般若波羅蜜乃至正憶念──當知是為魔事。
%56.148 （八）約「利鈍根」辨
復次，須菩提！說法者易悟，聽法人闇#69.8鈍──當知是為魔事。
須菩提！聽法者易悟，說法人闇鈍。兩不和合，不得書、持般若波羅蜜乃至正憶念──當知是為魔事。
~1952
%56.149 （九）約「知不知十二部經次第義」辨
復次，須菩提！說法者知十二部經次第義，所謂修妬路乃至優#69.9波提舍#69.10；聽#69.11法者不知#69.12十二部經次第義──當知是為魔事。#69.13
聽法者知十二部經次第義，說法人不#69.14知十二部經次第義。兩不和合，不得書深般若波羅蜜乃至正憶念──當知是為魔事。
%56.150 （十）約「具不具六波羅蜜」辨
復次，須菩提！說法者@t25p539a成就六波羅蜜，聽法人不成就六波羅蜜。兩不和合，不得書深般若波羅蜜乃至正憶念──當知是為魔事。
聽法者有六波羅蜜，說法人無六波羅蜜。兩不和合，不得書深般若波羅蜜乃至正憶念──當知是為魔事。
%56.151 （十一）約「有無方便力」辨
復次，須菩提！說法者於六波羅蜜有方便力，聽法人於六波羅蜜無方便力。兩不和合，不得書深般若波羅蜜乃至正憶念──當知是為魔事。
聽法者於六波羅蜜有方便力，說法人於六波羅蜜無方便力。兩不和合，不得書深般若波羅蜜乃至正憶念──當知是為魔事。
%56.152 （十二）約「得不得陀羅尼」辨
復次，須菩提！說法者得陀羅尼，聽法者#69.15無陀羅尼。兩不和合，不得書深般若波羅蜜乃至正憶念──當知是為魔事。
聽法者得陀羅尼，說法者無陀羅尼。兩不和合，不得書深般若波羅蜜乃至正憶念──當知是為魔事。
%56.153 （十三）約「欲不欲書、持、讀、誦般若波羅蜜」辨
復次，須菩提！說法者欲令書、持般若波羅蜜#69.16乃至正憶念；聽法人不欲書、持般若波羅蜜，讀、誦乃至正憶念。兩不和合，不得書深#69.17般若波羅蜜乃至正憶念──當知是為魔事。
聽法者欲書、讀、誦、說般若波羅蜜；說法者不欲令書般若波羅蜜乃至不欲令說。兩#69.18不和合，不得書深般若波羅蜜乃至正憶念──當知是為魔事。
~1953
%56.154 （十四）約「離不離五蓋」辨
復次，須菩提！說法者離貪欲、瞋恚、睡眠、掉#69.19悔、疑；聽法人貪欲、瞋恚、睡眠、掉悔、疑──當知是為魔事。
聽法者離貪欲、瞋恚、睡眠、掉悔、疑，說法人貪欲、瞋恚、睡眠、掉悔、疑。兩不和合，不得書深般若波羅蜜乃至正憶念──當知是為魔事。
%56.155 （十五）約「壞大乘心」辨
%56.156 1、說三惡道苦，勸速入涅槃
復次，須菩提！書是深般若波羅蜜乃至正憶念時，或@t25p539b有人來，說：『三惡道中苦劇，汝何不於是身盡苦入涅槃？何用是阿耨多羅三藐三菩提為？』
兩不和合，不得書#69.20深#69.21般若波羅蜜乃至正憶念──當知是為魔事。#69.22
%56.157 2、讚天欲樂、定樂，或歎二乘果
復次，須菩提！書是深般若波羅蜜，受持、讀、誦、說、正憶念時，或有人來，讚四天王諸天，讚三十三天、夜摩天、兜率陀天、化樂天、他化自在天、梵天乃至非有想非無想天，讚初禪乃至非有想非無想定，作是言：『善男子！欲界中受五欲快樂，色界中受禪生樂#69.23，無色界中受寂滅樂；是事亦無常、苦、空、無我，變相、盡相、散相、離相、滅相。汝何不於是身中取須陀洹果、斯陀含果、阿那含果、阿羅漢果、辟支佛道？何用是世間生死中受種種苦，求阿耨多羅三藐三菩提為？』
兩不和合，不#69.24得書深般若波羅蜜乃至正憶念──當知是為魔事。#69.25
%56.158 （十六）約「樂不樂聚眾」辨
復次，須菩提！說法者一身無累，自在無礙；聽法人多將人眾。兩不和合，不得書~1954深般若波羅蜜乃至正憶念──當知是為魔事。#69.26
聽法者一身無累，自在無礙；說法者多將人眾。兩不和合，不得書深般若波羅蜜乃至正憶念──當知是為魔事。
%56.159 （十七）約「隨師意者便授與般若，不隨師意者則不授」辨
復次，須菩提！說法者如是言：『汝能隨我意者，當與汝般若波羅蜜，令書#69.27、讀、誦、說、正憶念；若不隨我意者，則不與汝。』兩不和合，不得書深般若波羅蜜，讀、誦、說、正憶念──當知是為魔事。
復次，須菩提！聽#69.28法者欲得追隨如其意，說法者不聽。兩不和合，不得書#69.29深般若波羅蜜乃至正憶念#69.30──當知是為魔事。#69.31
%56.160 （十八）約「欲不欲得利養」辨
復次，須菩提！說法者欲得財利故，與般若波羅蜜，令書、持乃至正#69.32憶念；聽法@t25p539c者以是因緣故，不欲從受。兩不和合，不得書深般若波羅蜜乃至正憶念──當知是為魔事。
聽法者為財利故，欲書深般若波羅蜜，讀、誦、說；說法者以是因緣故，不欲與。兩不和合，不得書深般若波羅蜜，讀、誦、說──當知是為魔事。
%56.161 （十九）約「惜不惜身命」辨
復次，須菩提！說法者欲至他方危命之處，聽法者不欲隨去。兩不和合，不得書深般若波羅蜜乃至正憶念──當知是為魔事。
聽法者欲至他方危命之處，說法者不欲去。兩不和合，不得書深般若波羅蜜乃至正憶念──當知是為魔事。
%56.162 （二十）約「堪不堪忍苦」辨
復次，須菩提！說法者欲至他方飢餓、穀貴、無水之處，聽法者不欲隨去。兩不和合，不得書深般若波羅蜜乃至正憶念──當知是為魔事。
聽法者欲至他方飢餓、穀貴、無水之處，說法者不欲去。兩不和合，不得書深般若波羅蜜乃至正憶念──當知是為魔事。
~1955
%56.163 （二十一）約「徒隨師去不去豐樂之處」辨
復次，須菩提！說法者欲至他方豐樂之處，聽法者欲隨從去。說法者言：『善男子！汝為利養故追隨我，汝善自思惟，若得、若不得，無令後悔！』以是少#69.33因緣故，兩#69.34不和合。聽法者聞之心厭，作是念：『是為#69.35距#69.36逆我#69.37，不欲與我相隨。』便止不去。
兩不和合，不得書深般若波羅蜜乃至正憶念──當知是為魔事。#69.38
%56.164 （二十二）約「徒隨師去不去諸怖畏處」辨
復次，須菩提！說法者欲過曠野，賊怖、旃#69.39陀羅怖、獵師怖、惡獸毒蛇怖；聽法者#69.40欲隨逐#69.41去。說法者言：『善男子！汝何用到彼？彼中多有諸怖──賊怖乃至毒蛇怖。』聽法者聞之，知其不欲與般若波羅蜜書、持乃至正憶念，心厭，不欲追隨。以是少因緣故，兩不和合──當知是@t25p540a為魔事。
%56.165 （二十三）約「徒隨師去不去檀越處」辨
復次，須菩提！說法者多有檀越數往問訊#69.42，以是因緣故，語聽法者：『我有因緣，應往到彼。』聽法人知其意，便止。兩不和合，不得書深般若波羅蜜乃至正憶念──當知是為魔事。#69.43
^69.2
#69.110
%56.186 十一、惡魔化形現前
%56.187 （一）魔化比丘形破壞般若
~1960
%56.188 1、佛總說
復次，須菩提！惡魔作比丘形像來，方便破壞是#69.111般若波羅蜜，不得令書、持、讀、誦、說、正憶念。」
%56.189 2、須菩提問魔破壞因緣
須菩提白佛言：「世尊！何因緣故，惡魔作比丘形像，方便破壞般若波羅蜜，不得令書、持乃至正憶念？」
%56.190 3、佛別釋
%56.191 （1）魔訶菩薩所習非真般若，令墮邪見生疑
佛言：「惡魔作比丘形像來，壞善男子、善女人心，令遠離般若波羅蜜，作是言：『如我所說經即是般若波羅蜜，此經非般若波羅蜜。』
須菩提！是中破壞諸比丘時，有未受記菩薩便墮#69.112疑；墮疑故，不書深般若波羅蜜，不受、不持乃至不作正憶念。
不#69.113和合，不得書深#69.114般若波羅蜜乃至正憶念──當知是為魔事。#69.115
%56.192 （2）魔勸菩薩於實際作證得二乘果，令捨離般若
復次，須菩提！惡魔作比丘身到菩薩所，作#69.116如是言：『若菩薩行般若波羅蜜於實際#69.117作證，得須陀洹果、斯陀含果、阿那含果、阿羅漢果，辟#69.118支佛道！』
以是兩#69.119不和合，不得書深般若波羅蜜乃至正憶念──當知是為魔事。#69.120
%56.193 （3）有相似六度，菩薩應覺察而遠離
復次，須菩提！菩薩#69.121說是深般若波羅蜜時，多有魔事起，留難般若波羅蜜，是為魔事。菩薩摩訶薩應當覺知，知已遠離。」
~1961須菩提言：「世尊！何等是魔事留難，菩薩應當覺知，知已遠離？」
佛言：「似般若波羅蜜諸魔@t25p541b事起，似禪波羅蜜、似毘梨耶波羅蜜、似羼提波羅蜜、似尸羅波羅蜜、似檀波羅蜜魔事起──菩薩應當覺知，知已遠離。
%56.194 （4）有勸持二乘經，宣說二乘法教，當知是魔事，應遠離
復次，須菩提！聲聞、辟支佛所應行經，是菩薩摩訶薩應當知是魔事而#69.122遠離之。#69.123
復次，須菩提！內空#69.124乃至無法有法空，四念處乃至八聖道分，空、無相、無作解脫門──用#69.125是法得須陀洹果、斯陀含果、阿那含果、阿羅漢果、辟支佛道。
如是等諸經，惡魔作比丘形#69.126像，方便與菩薩摩訶薩。
是不和合故，不得書深般若波羅蜜乃至正憶念──當知是為魔事。#69.127
%56.195 （二）魔化佛身等破壞般若
%56.196 1、當知是魔事
%56.197 （1）魔化作佛金色身令貪著
復次，須菩提！惡魔作佛身金色丈光，到菩薩所。是菩薩貪著，貪著#69.128故，耗減#69.129薩婆#69.130若。
是不和合故，不得書深般若波羅蜜乃至正憶念──當知是為魔事。#69.131
%56.198 （2）魔化作佛身攝化眾比丘僧令貪著
復次，須菩提！惡魔作佛身及比丘僧，到菩薩前；是菩薩起貪著意，作是念：『我於當來世亦當如是從#69.132比丘僧為說法。』
~1962是菩薩貪著魔身故，耗減薩婆若，不得書成般若波羅蜜多#69.133乃至正憶念#69.134──當知是為魔事。#69.135
%56.199 （3）魔化作菩薩身令貪著
復次，須菩提！惡魔化作無數百千萬億菩薩，行檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜，指示善男子、善女人。
善男子、善女人見已貪著，貪著故耗減薩婆若，不得書深般若波羅蜜乃至正憶念──當知是為魔事。#69.136
%56.200 2、釋正理：一切法自性空故，佛、菩薩、二乘，乃至無上菩提皆不可得
何以故？是深般若波羅蜜中，無有色，無有受、想、行、識乃至無有#69.137阿耨多羅三藐三菩提。
須菩提！是般若波羅蜜若無有色乃至無阿耨多羅三藐三菩提，是中無佛、無聲聞，無辟支佛、無菩薩。
何以故？一切諸法自性空@t25p541c故。#69.138
%56.201 貳、行般若而遇留難事，佛等護故諸難不成
%56.202 （壹）習行般若時多起魔事
%56.203 一、佛舉譬喻釋留難
復次，須菩提！善男子、善女人書是深#69.139般若波羅蜜，受#69.140、讀、誦、說、正憶念時，~1963多有留難起。
須菩提！譬如閻浮提中珍寶──金、銀、琉璃、車𤦲、馬瑙、珊瑚等寶#69.141，多難多賊；如是，須菩提！善男子、善女人書是深般若波羅蜜乃至正憶念時，多賊、多留難起。」#69.142
%56.204 二、須菩提廣成其義
%56.205 （一）須菩提重述佛語
須菩提白佛言：「如是！世尊！閻浮提中珍寶──金、銀、琉璃，車𤦲、馬瑙，珊瑚等，多賊、多難。世尊！善男子、善女人亦如是，書是深般若波羅蜜乃至正憶念時，多賊、多留難起，多有魔事。
%56.206 （二）明破壞般若者相
何以故？是愚癡人為魔所使，善男子、善女人#69.143書是深般若波羅蜜乃至正憶念時，破壞，令遠離。
世尊！是愚癡人少智少慧，是善男子、善女人書深般若波羅蜜乃至正憶念時，破壞，令遠離。
是愚癡人心不樂大法，是故不書是深般若波羅蜜，不受、不讀、不誦、不正憶念、不如說修行；亦壞他人，令不得書深般若波羅蜜乃至如說修行。」
 %56.207 （貳）諸佛菩薩護念，令魔難不成
%56.208 一、佛述成
佛言：「如是！如是！須菩提！新#69.144發大乘意善男子、善女人為魔所使、不種善根、不供養諸佛、不隨善知識故，不書深#69.145般若波羅蜜乃至不正憶念，而作留難。
是善男子、善女人少智少慧、心不樂大法，是故不能書是深般若波羅蜜乃至正憶念，魔事起故。#69.146
%56.209 二、諸佛菩薩力，令魔難不成
須菩提！若善男子、善女人能書是深般若波羅蜜乃至正憶念時，魔事不起，能具足禪波羅蜜乃至檀波羅蜜，能具足四念處乃至一切種智。須菩提！當知佛力故，是#69.147善男子、善女人能書是深般若波羅蜜乃至正憶念，亦能具足禪#69.148波羅蜜乃至檀波羅蜜、內~1964空乃至無法@t25p542a有法空，具足四念處乃至八聖道分、佛十力乃至一切種智。
須菩提！十方現在無量無邊阿僧祇諸佛亦助是善男子、善女人，令得書是深般若波羅蜜乃至正憶念；十方阿鞞跋致諸菩薩摩訶薩亦擁護祐助#69.149是善男子、善女人書深般若波羅蜜乃至正憶念。」
^69.3
%57.0 壹、略明般若能作恩
%57.1 （壹）舉喻：如子知恩故，守護其母
佛告須菩提：「譬如母人有子若五、若十、若二十、若三十#69.182、若四十、若五十、若百、若千。母中得病，諸子各各勤求救療，作是念：『我等云何令母得安#69.183，無諸患苦不樂之事？風寒、冷熱，蚊#69.184虻、蛇蚖#69.185侵犯母身，是我等憂！』其諸子等常求樂具，供養其母。所以者何？生育我等，示我世間。#69.186
%57.2 （貳）合法
%57.3 一、般若為諸佛母，諸佛知恩故以佛眼常觀護念深般若
%57.4 （一）般若為諸佛母
如是，須菩提！佛常以佛眼視是#69.187深般若波羅蜜。何以故？是深般若波羅蜜能示世間相。
十方現在諸佛亦以佛眼常視是深般若波羅蜜。何以故？是深般若波羅蜜能生諸佛，能與諸佛一切智，能示世間相。
以是故，諸佛常以佛眼視是深般若波羅蜜。#69.188
%57.5 （二）諸賢聖及賢聖法皆從般若中生故
又以般若波羅蜜能生禪波羅蜜乃至檀波羅蜜，能生內空乃至無法有法空，能生四念處乃至八聖道分，能生佛十力乃至一切種智。
~1968如是#69.189般若波羅蜜能生須陀洹、斯陀含、阿那含、阿羅漢、辟支佛、諸佛。
須菩提！所有諸佛已得阿耨多羅三藐三菩提，今#69.190得、當得，皆因深般若波羅蜜因緣故得。
%57.6 二、佛守護行者令增勝
須菩提！若求佛道善男子、善女人書是深般若波羅蜜乃至正憶念，諸佛常以佛眼視是人。
須菩提！是求菩薩道善男子、善女人，諸十方佛常守護，令不退阿耨多羅三藐三菩提。」#69.191
%57.7 貳、廣明般若能作恩
%57.8 （壹）須菩提問
須菩提白佛言：「如世尊所說般若波羅蜜能生諸佛、能示世間相。
世尊！（1）般若波羅蜜云何能生諸佛？
（2）云何能示世間相？
（3）云何諸佛從般若波羅蜜生？
（4）云何@t25p543a諸佛說世間相？」#69.192
%57.9 （貳）佛答
%57.10 一、明「般若能生諸佛」之理，兼答「諸佛從般若生」
佛告須菩提：「是#69.193深般若波羅蜜中生佛十力乃至十八不共法、一切種智。須菩提！得是諸法，故名為佛。須菩提！以是故，深般若波羅蜜能生諸佛。#69.194
~1969
%57.11 二、答般若能示世間相，兼答諸佛說世間相
%57.12 （一）般若能示世間相者，謂能示世間五眾實相
%57.13 1、佛略說：五眾實相是世間相
須菩提！諸佛說五眾是世間相。」#69.195
%57.14 2、須菩提問因緣
須菩提言：「世尊！云何深般若波羅蜜中說五眾相？云何深般若波羅蜜中#69.196示五眾？」#69.197
%57.15 3、佛答：五眾實相不破不壞、不生不滅，乃至無三世
「須菩提！般若波羅蜜不示五眾破、不示五眾#69.198壞，不示生、不示滅，不示垢、不示淨，不示增、不示減#69.199，不示入、不示出，不示過去、不示未來、不示現在。#69.200
何以故？空相不破、不壞，無相相#69.201、無作相不破、不壞#69.202，不起法、不生法、無所有法性法#69.203，不破、不壞相如是示。#69.204
如是，須菩提！佛說深般若波羅蜜能示世間相。#69.205
%57.16 （二）別明「知眾生心行」
%57.17 1、概說：諸佛因深般若悉知眾生心行，亦知一切法不可得，如是說示世間實相
復次，須菩提！諸佛因深般若波羅蜜，悉知無量無邊阿僧祇眾生心所行。
須菩提！是深般若波羅蜜中無眾生、無眾生名，無色#69.206、無色名，無受想行識、無~1970受想行識名，無眼乃至無#69.207意，無眼識乃至無意識，無眼觸乃至無意觸，乃至無一切智#69.208、無一切智#69.209名。
如是，須菩提！是#69.210深般若波羅蜜能示世間相。#69.211
須菩提！是深般若波羅蜜亦不示色，不示受、想、行、識，乃至不示一切種智。
何以故？須菩提！是深般若波羅蜜中尚無般若波羅蜜，何況色乃至一切種智！#69.212
%57.18 2、詳論
%57.19 （1）首辨八心──攝心、亂心、三毒心、無三毒心、廣心、大心、無量心、不可見心
%57.20 A、示知攝心，B、示知亂心──以七相知
%57.21 （A）以法相知
復次，須菩提！所有眾生名數──若有色、若無色，若有想、若無想#69.213、若非有想非#69.214無想，若此間世界、若遍十方世界──是諸眾生若攝心、若亂心，是攝心、亂#69.215心，佛如實知。#69.216
須菩提！云何佛知眾生攝心、亂心相？#69.217
（1）以法相故知。#69.218
~1971用何等法相故知#69.219？
須菩提！@t25p543b是法相中尚無法相相，何況有攝心、亂心！
須菩提！以是法相故，佛知眾生攝心、亂心。#69.220
%57.22 （B）以盡相等六相知
復次，須菩提！佛知眾生攝心、亂心。
云何知？
須菩提！（2）以盡#69.221相故知，（3）以無染相故知，（4）以滅相故知，（5）以斷相故知，（6）以寂相故知，（7）以離相故知。
%57.23 （C）結成
如是，須菩提！佛因般若波羅蜜知眾生攝心、亂心。#69.222
%57.24 C、示知三毒心──以「實相」知
復次，須菩提！佛因般若波羅蜜知眾生染心，如實知染心；瞋心、癡心，如實知瞋心、癡心。」
須菩提白佛言：「世尊！云何佛知眾生染心，如實知染心；瞋心、癡心，如實知瞋心、癡心？」
佛告須菩提：「染心如實相，則無染心相。
何以故？如實相中，心心數法不可得，何況當得染心、不染心！#69.223
須菩提！瞋心、癡心如實相，則#69.224無瞋、無癡相。
何以故？如實相中心心數法尚不可得，何況當得瞋心、不瞋心，癡心#69.225、不癡心！
如是，須菩提！佛因般若波羅蜜，眾生染心，如實知染心；瞋心、癡心，如實知瞋心、癡心。
~1972
%57.25 D、示知無三毒心──以「實相」知
復次，須菩提！佛因般若波羅蜜，眾生無染心，如實知無染心；無瞋心、無癡心，如實知無瞋心、無#69.226癡心。」
須菩提白佛言：「世尊！云何#69.227眾生無染心如實知無染心？無瞋心如實知無瞋心？無癡心如實知無癡心？」
佛告須菩提：「是心無染相中，染相、不染相不可得。
何以故？須菩提！二心不俱故。
如是，須菩提！佛因般若波羅蜜，眾生無染心，如實知#69.228無染心。
須菩提！是無瞋心、無癡心相中，癡心、不癡心不可得。
何以故？二心不俱故。
如是，須菩提！佛因般若波羅蜜，眾生無瞋心、無癡心，如實知。#69.229
%57.26 E、廣心──以「性相無」知
復次，須菩提！佛因般若波羅蜜，是眾生廣心，如實@t25p543c知廣心。」
須菩提白佛言：「世尊！云何佛因般若波羅蜜，是眾生廣心，如實知廣心？」
「須菩提！佛知諸眾生心相不廣不狹、不增不減、不來不去；心相離故，是心不廣乃至不來不去。何以故？是心性無故，誰作廣、誰#69.230作狹#69.231乃至來去？
如#69.232是，須菩提！佛因般若波羅蜜，是眾生廣心，如實知廣心。#69.233
%57.27 F、大心──以「性相無」知
復次，須菩提！佛因般若波羅蜜，是眾生大心，如實知大心。」
須菩提白佛言：「世尊！云何佛因般若波羅蜜，是眾生大心，如實知大心？」
佛告須菩提：「佛因般若波羅蜜，不見眾生心來相、去相，不見眾生心生相、滅~1973相、住相#69.234、異相。
何以故？是諸心性無故，誰來誰去？誰生滅住異？
如是，須菩提！佛因般若波羅蜜，是眾生大心，如實知大心。#69.235
%57.28 G、無量心──以「無依止」知
復次，須菩提！佛因般若波羅蜜，眾生無量心，如實知無量心。」
須菩提白佛言：「世尊！云何佛因般若波羅蜜，眾生無量心，如實知無量心？」
佛告須菩提：「佛因般若波羅蜜，知是眾生心，不見住、不見不住。
何以故？是無量心相無依止故，誰有住不住處？
如是，須菩提！佛因般若波羅蜜，眾生無量心，如實知無量心。#69.236
%57.29 H、不可見心──以「自相空、不可得」知
復次，須菩提！佛因般若波羅蜜，眾生不可見心，如實知不可見心。」
須菩提白佛言：「世尊！云何佛因般若波羅蜜，眾生不可見心，如實知不可見心？」
佛告須菩提：「眾生心是無相，佛如實知無相，自相空故。#69.237
復次，須菩提！佛知眾生心，五眼不能見。
如是，須菩提！佛因般若波羅蜜，眾生不可見心，如實知不可見心。」#69.238
^70.1
%57.62 （2）次辨四心──出、沒、屈、申
%57.63 A、總說
「復次，須菩提！佛因深般若波羅蜜，眾生#70.2心數出、沒、屈、申如實知。」
%57.64 B、別釋
「世尊！云何佛因般若波羅蜜，眾生心數出、沒、屈、申如實知？」
%57.65 （A）總明四心皆依五蘊生
佛言：「一切眾生心數出、沒、屈、申等皆依色、受、想、行、識生；須菩提！佛於是中知眾生心數出、沒、屈、申。#70.3
%57.66 （B）別辨
%57.67 a、執神及世間常、無常等四句
所謂神及世間常是事實，餘妄語──是見依色；#70.4神及世間無常是事實，餘妄語──是見依色；神及世間常亦無常是事實，餘妄語──是見依色；神及世間非常非無常是事實，餘妄語──是見依色。
神及世間常是事實，餘妄語──是見依受；神及世間無常是事實，餘妄語──是見依受；神及世間常亦無常是事實，餘妄語──是見依受；神及世間非常非無常是事實，餘妄語──是見依受。
神及世間常是事實，餘妄語──是見依想；神及世間無常是事實，餘妄語──是見依想；神及世間常亦無常是事實，餘妄語──是見依想；神及世間非常非無常是事實，餘妄語──是見依想。
~1981神及世間常是事實，餘妄語──是見依行；神及世間無常是事實，餘妄語──是見依行；神及世間常亦無常是事實，餘妄語──是見依行；神及世間非常非無常是事實，餘妄語──是見依行。
神及世間常是事實，餘妄語──是見依識；神及世間無常是事實，餘妄語──是見依@t25p545c識；神及世間常亦無常是事實，餘妄語──是見依識；神及世間非常非無常是事實，餘妄語──是見依識#70.5。
%57.68 b、執世間邊、無邊等四句
世間有邊是事實，餘妄語──是見依色；世間無邊是事實，餘妄語──是見依色；世間有邊無邊是事實，餘妄語──是見依色；世間非有邊非無邊是事實，餘妄語──是見依色。
依受、想、行、識亦如是。
%57.69 c、執我與身一、異
神即是身──是見依色；神異身異──是見依色。#70.6
依受、想、行、識亦如是。
%57.70 d、執死後有無如去四句
死後有如去#70.7是事實，餘妄語──是見依色；死後無如去是事實，餘妄語──~1982是見依色；死後或有如去或無如去是事實，餘妄語──是見依色；死後非有如去非無如去是事實，餘妄語──是見依色。#70.8
依受、想、行、識亦如是。
%57.71 C、結
如是，須菩提！佛因#70.9般若波羅蜜，眾生出、沒、屈、申如實知。
%57.72 （三）示諸法如無二無別
%57.73 1、正明如相
%57.74 （1）約法辨
%57.75 A、依五蘊辨
復次，須菩提！佛知色相。云何知色相？
如『如』不壞、無分別、無相、無憶、無戲論、無得，色相亦如是。
須菩提！佛知受、想、行、識相。云何知受、想、行、識相？
如『如相』不壞、無分別、無相、無憶、無戲論、無得，受、想、行、識相亦如是。#70.10
%57.76 B、依一切法辨
如是，須菩提！佛知眾生如相及眾生心數出、沒、屈、申如相。
五#70.11眾如相，諸行如相，即是一切法如相。何等是一切法如相？所謂六波羅蜜如相，六波羅蜜如相即是三十七品如相，三十七品如相即是十八空如相，十八空如相即是@t25p546a八背捨如相，八背捨如相即是九次第定如相，九次第定如相即是佛十力如相，佛十力如相即是四無所畏、四無礙智、大慈大悲乃至十八不共法如相，十八不共法如相即是一切種智如相，一切種智如相即是善法不善法、世間法~1983出世間法、有漏法無漏法如相，無#70.12漏法如相即是過去、未來、現在法#70.13如相，過去、未來、現在法如相即是有為法、無為法如相，有為法、無為法如相即是須陀洹果如相，須陀洹果如相即是斯陀含果如相，斯陀含果如相即是阿那含果如相，阿那含果如相即是阿羅漢果如相，阿羅漢果如相即是辟支佛道如相，辟支佛道如相即是阿耨多羅三藐三菩提如相，阿耨多羅三藐三菩提如相即是諸佛如相，諸佛如相皆是一如相，不二不別、不盡不壞──是名一切諸法如相。#70.14
%57.77 （2）結
佛因般若波羅蜜得是如相，以是因緣故，般若波羅蜜能生諸佛、能示世間相。如是，須菩提！佛知一切法如相──非不如相，不異相；得是如相故，佛名如來。」#70.15
%57.78 2、歎如甚深
%57.79 （1）須菩提歎
須菩提白佛言：「世尊！是諸法如相──非不如相，不異相──甚深！
世尊！諸佛用是如，為人說阿耨多羅三藐三菩提。
世尊！誰能信解是者？唯有阿鞞跋致菩薩及具足正見人、漏盡阿羅漢。#70.16何以故？是法甚深故。」#70.17
%57.80 （2）佛述成
「須菩提！是如無盡相故甚深。」#70.18
~1984須菩提言：「何法無盡相故甚深？」
佛言：「一切法無盡故。如是，須菩提！佛得是一切諸法如已，為眾生說。」#70.19
^70.2
%58.0 壹、明深般若相
%58.1 （壹）天子問
爾時，三千大千世界中所有欲界天子、色界天子遙散華香，來至佛所，頂禮佛足，一面住，白佛言：「世尊！所說般若波羅蜜甚深，何等是深般若波羅蜜相？」
%58.2 （貳）佛答
%58.3 一、正說深般若相
佛告欲界、色界諸天子：「諸天子！(1)空相是深般若波羅蜜相，(2)無相、(3)無作、(4)無起、(5)無生無滅、(6)無垢無淨、(7)無所有法、(8)無相、(9)無依止、(10)虛空相是深般若波羅蜜相。諸天子！如是等相是深般若波羅蜜相。#70.38
%58.4 二、以世諦說，非第一義
佛@t25p548a為眾生用世間法故說，非第一義。#70.39
%58.5 三、深般若諸相，世間無能壞者
%58.6 （一）標義
諸天子！是諸相，一切世間天、人、阿修羅不能破壞。#70.40
%58.7 （二）釋因由
何以故？
%58.8 1、世間天人等亦是相故
是一切世間天、人、阿修羅亦是相故。
~1992
%58.9 2、相不能破相，相不能知相；相不能知無相，無相不能知相
諸天子！相不能破相，相不能知相，相不能知無相，無相不能知相。
是相、是無相、相無相皆無所知，謂知者、知法皆不可得故。#70.41
%58.10 四、明空等諸相是實，佛得如實相故名為如來
%58.11 （一）正說空等諸相非諸法、人、非人等所作
何以故？諸天子！是諸相非色作，非受、想、行、識作；非檀波羅蜜作，非尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜作；非內空作，非外空作，非內外空作，非無法空作，非有法空作，非無法有法空作；非四念處作，乃至非一切種智作。
諸天子！是諸相，非人所有，非非人所有；非世間，非出世間；非有漏，非無漏；非有為，非無為。」#70.42
%58.12 （二）舉喻明理
佛復告諸天子：「譬如有人問：『何等是虛空相？』此人為正問不？」
諸天子言：「世尊！此不正問。何以故？世尊！是虛空無相可說，虛空無為無起故。
%58.13 （三）釋疑
佛告欲界、色界諸天子：「有佛無佛，相性常住。佛得如實相性故，名為如來。」#70.43
%58.14 （參）諸天悟解
諸天子白佛言：「世尊！世尊所得諸相性甚深，得是相故，得無礙智；住是相#70.44中，以般若波羅蜜集諸法自相。」
諸天子言：「希有！世尊！是深般若波羅蜜是諸佛常所行處，行是道得阿耨多羅三藐三菩提；得阿耨多羅三藐三菩提已，通達一切法相──若色相，若受、想、行、識相，乃至一切種智相。」#70.45
~1993
%58.15 （肆）佛述成
%58.16 一、正述成
佛言：「如是！如是！諸天子！
惱壞相是色相──佛得是無相；覺者受相，取者想相，起作者行相，了別者識相──佛得是無相。#70.46
能捨者檀波羅蜜相，無熱惱者尸羅波羅蜜相，不變異者羼提波羅蜜相，不可伏者@t25p548b毘梨耶波羅蜜相，攝心者禪波羅蜜相，捨離者般若波羅蜜相──佛得是無相。#70.47
心無所嬈惱者，是四禪、四無量心、四無色定相──佛得是無相。
出世間者，三十七品相──佛得是無相。
苦者，無作脫門相；離者，空脫門相；寂滅者，無相脫門相──佛得是無相。#70.48
勝者，十力相；不恐怖者，無所畏相；遍知者，四無礙智相；#70.49餘人無得者，十八不共法相──佛得是無相。
愍念眾生者，大慈大悲相；實者，無謬錯相；無所取者，常捨相；現了知者，一切種智相──佛得是無相。#70.50
~1994
%58.17 二、結：佛得一切諸法無相，名無礙智
如是，諸天子！佛得一切諸法無相，以是因緣故，佛名無礙智。」#70.51
^70.3
%58.52 貳、明佛知般若恩故報恩
%58.53 （壹）般若能生諸佛、能示世間實相，故為佛所尊重
%58.54 一、佛知般若恩故，依止尊重般若而住
爾時，佛告須菩提：「般若波羅蜜是諸佛母；般若波羅蜜能示世間相，是故佛依止是法住#70.71，供養、恭敬、尊重、讚歎是法。何等是法？所謂般若波羅蜜。諸佛依止般若波羅蜜住，恭敬、供養、尊重、讚歎是般若波羅蜜。何以故？是般若波羅蜜出生諸佛。#70.72
%58.55 二、知恩報恩中，佛最第一
%58.56 （一）標宗
~1999佛知作人。若人正問知作人者，正答無過於佛。#70.73
%58.57 （二）釋因由
何以故？
%58.58 1、乘如是乘，行如是道而得無上菩提故
須菩提！佛知作人故。佛所乘來法、佛所從來道，得阿耨多羅三藐三菩提。是乘、是道，佛還恭敬、供養、尊重、讚歎、受持、守護。須菩提！是名佛知作人。#70.74
%58.59 2、知一切法無作相故
復次，須菩提！佛知一切法無作相，作者無所有故；一切法無起，形事不可得故。須菩提！佛因般若波羅蜜知一切法無作相。亦以是因緣故，佛知作人。#70.75
　%58.60 三、般若能生諸佛、能示世間相
%58.61 （一）一切法無所得，無知者、無見者故，般若能生諸佛、能示世間相
%58.62 1、正說
復次，須菩提！佛因般若波羅蜜得一切法不生，以無所得故。以是因緣故，般若波羅蜜能生諸佛，亦能示世間相。」#70.76
%58.63 2、釋難
%58.64 （1）須菩提難：一切法無知者、見者，云何般若能生諸佛、能示世間相
須菩提言：「世尊！若一切法無知者、無見者，云何般若波羅蜜能生諸佛、能示世間相？」#70.77
%58.65 （2）佛答
%58.66 A、一切法空、虛誑、不堅固故無知者、無見者
~2000佛告須菩提：「如是！如是！一切法實無知者、無見者。#70.78
云何無知者、無見者？
一切法空、虛誑、不堅固，是故一切法無知者、無見者。#70.79
%58.67 B、諸法無依止、無繫故無知者、無見者
復次，須菩提！一切法云何無知者、無見者？一切法無依止、無所繫，以是故，一切法無@t25p549c知者、無見者。
%58.68 C、結
如是，須菩提！般若波羅蜜能生諸佛、能示世間相。#70.80
%58.69 （二）不緣境生識，不見諸法故，般若能示世間相
%58.70 1、佛說
不見色故示世間相，不見受、想、行、識故示世間相，乃至不見一切種智故，示世間相。
如是，須菩提！般若波羅蜜能生諸佛、能示世間相。」#70.81
%58.71 2、須菩提重難
須菩提言：「世尊！云何不見色故，般若波羅蜜示世間相？不見受、想、行、識乃至一切種智故，示世間相？」#70.82
%58.72 3、佛答：不緣境生識故不見色等諸法
佛告須菩提：「若不緣色生識，是名不見色相故示；不緣受、想、行、識生識，乃至不緣一切種智生識，是名不見一切種智相故示。
如是，須菩提！是深般若波羅蜜能生諸佛、能示世間相。#70.83
~2001
%58.73 （貳）正明般若能示佛世間空、不可思議等諸相
復次，須菩提！般若波羅蜜云何能生諸佛、能示世間相？
%58.74 一、明般若示世間空
須菩提！般若波羅蜜能示世間空。云何示世間空？
%58.75 （一）正說世間空
示五眾世間空，示十二入世間空，示十八界世間空，示十二因緣世間空，示我見根本六十二見世間空；
示十善道世間空，示四禪、四無量心、四無色定世間空；
示三十七品世間空，示六波羅蜜世間空；
示內空世間空，示外空世間空，示內外空世間空；
示無法空世間空，示有法空世間空，示無法有法空世間空；
示有為性世間空，示無為性世間空；
示佛十力世間空，示十八不共法世間空，乃至示一切種智世間空。
如是，須菩提！般若波羅蜜能生諸佛、能示世間相。#70.84
%58.76 （二）佛因般若示、知、覺、思惟、分別世間空
復次，須菩提！佛因般若波羅蜜示世間空、知世間空、覺世間空、思惟世間空、分別世間空。
如是，須菩提！般若波羅蜜能生諸佛、能示世間相。#70.85
%58.77 （三）結：般若示佛世間空──示五眾乃至一切種智世間空
復次，須菩提！般若波羅蜜示佛世間空。云何示佛世間空？示五眾世間空，乃@t25p550a至示一切種智世間空。
~2002如是，須菩提！般若波羅蜜能生諸佛、能示世間相。#70.86
%58.78 二、示佛世間不可思議
復次，須菩提！般若波羅蜜示佛世間不可思議。云何示世間不可思議？示五眾世間不可思議，乃至示一切種智世間不可思議。#70.87
%58.79 三、示佛世間離
復次，須菩提！般若波羅蜜示佛世間離。云何示世間離？示五眾世間離，乃至示一切種智世間離。如是，須菩提！般若波羅蜜示佛世間離。
%58.80 四、示佛世間寂滅
復次，須菩提！般若波羅蜜示佛世間寂滅。云何示世間寂滅？示五眾世間寂滅，乃至示一切種智世間寂滅。
%58.81 五、示佛世間畢竟空
復次，須菩提！般若波羅蜜示佛世間畢竟空。云何示世間畢竟空？示五眾世間畢竟空，乃至示一切種智世間畢竟空。
%58.82 六、示佛世間性空
復次，須菩提！般若波羅蜜示佛世間性空。云何示世間性空？示五眾世間性空，乃至示一切種智世間性空。#70.88
~2003
%58.83 七、示佛世間無法空
復次，須菩提！般若波羅蜜示佛世間無法空。云#70.89何示世間無法空，示五眾世間無法空，乃至示一切種智世間無法空。#70.90
%58.84 八、示佛世間無法有法空
復次#70.91，須菩提！般若波羅蜜示佛世間無法有法空。云何示世間無法有法空？示五眾世間無法有法空，乃至示一切種智世間無法有法空。#70.92
%58.85 九、示佛世間獨空
復次，須菩提！般若波羅蜜示佛世間獨空。云何示世間獨空？示五眾世間獨空，乃至示一切種智世間獨空。
如是，須菩提！般若波羅蜜能生諸佛、能示世間相。#70.93
%58.86 十、示世間非今世後世相
復次，須菩提！是深般若波羅蜜示世間相，所謂不生今世、後世相。何以故？諸法無可用生今世、後世相故。」#70.94
^70.4
%58.118 參、歎般若能成大事
%58.119 （壹）明般若依五事故起
%58.120 一、須菩提正歎
須菩提白佛言：「（1）世尊！是般若波羅蜜為大事故起。（2）世尊！是般若波羅蜜為不可思議事故起。（3）世尊！是般若波羅蜜為不可稱事故起。（4）世尊！是般若波羅蜜為無量事故起。（5）世尊！是般若波羅蜜為無等等事故起。」#70.99
%58.121 二、如來述歎
%58.122 （一）如來述成
佛言：「如是！如是！須菩提！般若波羅蜜為大事起，為不可思議事起，為不可稱事起，為無量事起，為無等等事起。
%58.123 （二）別釋五事
%58.124 1、約大事歎
須菩提！云何是般若波羅蜜為大事故起？
須菩提！諸佛大事者，所謂救一切眾生，不捨一切眾生。
%58.125 2、約不可思議事歎
須菩提！云何是般若波羅蜜為不可思議事起？
須菩提！不可思議事者，所謂諸佛法、如來法、自然人法、一切智人法。
以是故，須菩提！諸佛般若波羅蜜為不可思議事起。#70.100
%58.126 3、約不可稱事歎
~2008須菩提！云何般若波羅蜜為不可稱事起？
須菩提！一切眾@t25p551b生中無有能思惟稱#70.101佛法、如來法、自然人法、一切智人法。
以是故，須菩提！般若波羅蜜為不可稱事起。#70.102
%58.127 4、約無量事歎
須菩提！云何般若波羅蜜為無量事起？
須菩提！一切眾生中無有能量佛法、如來法、自然人法、一切智人法。
以是故，須菩提！般若波羅蜜為不可量事起。
%58.128 5、約無等等事歎
須菩提！云何般若波羅蜜為無等等事起？
須菩提！一切眾生中無有能與佛等者，何況過！
以是故，須菩提！般若波羅蜜為無等等事起。」#70.103
%58.129 （貳）依新學菩薩別辨諸法皆不可思議乃至無等等
%58.130 一、正明
%58.131 （一）須菩提問
須菩提白佛言：「世尊！但佛法、如來法、自然人法、一切智人法，不可思議、不可稱、無有量、無等等事起耶？」
%58.132 （二）佛答
%58.133 1、諸法皆不可思議乃至無等等
佛告須菩提：「如是！如是！佛法、如來法、自然人法、一切智人法，不可思議、不可稱、無有量、無等等。
色亦不可思議、不可稱、無有量、無等等，受、想、行、識亦不可思議、不可稱、無有量、無等等，乃至一切種智、法性、法相不可思議、不可稱、無有量、無等等。
是中，心、心數法不可得。#70.104
~2009
%58.134 2、諸法不可思議乃至無等等皆亦不可得
復次，須菩提！色不可思議，是亦不可得；乃至色無等等，是亦不可得。受、想、行、識乃至一切種智無等等，是亦不可得。」#70.105
須菩提白佛言：「世尊！何因緣色不可思議乃至無等等，是亦不可得？受、想、行、識乃至一切種智無等等，是亦不可得？」
佛告須菩提：「色量不可得故，受、想、行、識量不可得故，乃至一切種智量不可得故。」#70.106
須菩提白佛言：「世尊！何因緣色量不可得乃至一切種智量不可得？」
佛告須菩提：「色不可思議故乃至色無等等故，量不可得；乃至一切種智不@t25p551c可思議故，乃至一切種智無等等故，量不可得。#70.107
須菩提！於汝意云何？不可思議乃至無等等中，寧可得色、受、想、行、識乃至一切種智不？」
須菩提言：「世尊！不可得。」
「以是故，須菩提！一切法不可思議乃至無等等。
%58.135 3、結
如是，須菩提！諸佛法不可思議、不可稱、無有量、無等等。
須菩提！是名諸佛法不可思議乃至無等等。
須菩提！是諸佛法不可思議，過思議相故；不可稱，過稱故；無有量，過量故；無等等，過等等故。
須菩提！以是因緣故，一切法亦不可思議相乃至無等等。#70.108
~2010
%58.136 二、總列四事，依二諦明
%58.137 （一）不可思議、不可稱、無有量、無等等依四事辨
須菩提！不可思議名，是義不可思議；不可稱名，是義不可稱；無有量名，是義不可量；無等等名，是義無等等。須菩提！是諸佛法不可思議乃至無等等。#70.109
%58.138 （二）舉虛空喻四事
不可思議，如虛空不可思議；不可稱，如虛空不可稱；無有量，如虛空無有量；無等等，如虛空無等等。須菩提！是亦名諸佛法不可思議乃至無等等。
%58.139 （三）世間無能思議稱量者
佛法如是無量，一切世間天、人、阿修羅無能思議籌量者。」#70.110
%58.140 （參）與會者疑除悟道
說是諸佛法不可思議、不可稱、無有量、無等等品時，五百比丘一切法不受故，漏盡心得解脫，得阿羅漢；#70.111二十比丘尼亦不受一切法故，漏盡得阿羅漢；六萬優婆塞、三萬優婆夷諸法中遠塵離垢，諸法中法眼生；#70.112二十菩薩摩訶薩得無生法忍，於是賢劫中當受記。
^71.1
%59.0 壹、般若依五事說甚深
%59.1 （壹）須菩提重說般若為五事故起
爾時，須菩提白佛言：「世尊！是深般若波羅蜜為大事故起、不可思議事故起、不可稱事@t25p553a故起、無有量事故起。世尊！是深般若波羅蜜無等等事故起。」#71.3
%59.2 （貳）佛述成並釋理
%59.3 一、佛述成
佛告須菩提：「如是！如是！是深般若波羅蜜為大事故起，乃至無等等事故起。
%59.4 二、釋理：般若能含受五度乃至佛德
%59.5 （一）以含受義述成五事
%59.6 1、正明
何以故？般若波羅蜜中含受五波羅蜜，般若波羅蜜中含受內空乃至無法有法空，含受四念處乃至八聖道分，是深般若波羅蜜中含受佛十力乃至一切種智。#71.4
%59.7 2、舉喻明理
譬如灌頂王，國土中尊，諸有官事皆委大臣，國王安樂無事；如是，須菩提！所有聲聞辟支佛法、若菩薩法、若佛法，一切皆在般若波羅蜜中，#71.5般若波羅蜜能成辦其事。
以是故，須菩提！般若波羅蜜為大事故起，乃至無等等事故起。#71.6
~2016
%59.8 （二）舉不取不著諸法釋含受義
%59.9 1、佛正明：般若於諸法不取不著故得以成辦
復次，須菩提！是般若波羅蜜不取色、不著色故能成辦，受、想、行、識不取、不著故能成辦；#71.7乃至一切種智不取、不著故能成辦；須陀洹果乃至阿羅漢果、辟支佛道乃至阿耨多羅三藐三菩提不取、不著故能成辦。」
%59.10 2、須菩提問
須菩提白佛言：「云何色不取、不著故般若波羅蜜能成辦？云何受、想、行、識乃至阿耨多羅三藐三菩提不取、不著故般若波羅蜜能成辦？」
%59.11 3、佛反問答
佛告須菩提：「於汝意云何？頗見是色可取、可著不？」
須菩提言：「不也！世尊！」
「須菩提！於汝意云何？頗見受、想、行、識乃至阿耨多羅三藐三菩提可取、可著不？」
須菩提言：「不也！世尊！」
%59.12 4、佛結成
佛言：「善哉！善哉！須菩提！我亦不見是色可取、可著，不見故不取，不取故不著；我亦不見受、想、行、識乃至阿耨多羅三藐三菩提及一切種智可取、可著，不見故不取，不取故不著；須菩提！我亦不見佛法、如來法、自然人法、一切智人法@t25p553b可取、可著，不見故不取，不取故不著。#71.8
以是故，須菩提！諸菩薩摩訶薩，色亦不應取、亦不應著，受、想、行、識乃至佛法、如來法、自然人法、一切智人法#71.9亦不應取、亦不應著。」
%59.13 三、歎般若及行般若人
%59.14 （一）諸天歎
%59.15 1、歎般若甚深
爾時，欲、色界諸天子白佛言：「世尊！是般若波羅蜜，甚深、難見、難解、不可思惟比類知；微妙、善巧、智慧、寂滅者可知。
%59.16 2、明信解因緣
能信是般若波羅蜜者，當知是菩薩(1)多供養諸佛、(2)多種善根、(3)與善知識相隨，能信解深般若波羅蜜。#71.10
~2017
%59.17 3、菩薩行深般若超勝二乘
世尊！若三千大千世界中所有眾生皆作信行、法行人、八人、得須陀洹、斯陀含、阿那含、阿羅漢、辟支佛──若智、若斷，不如是u菩薩u一日行深般若波羅蜜，忍、欲、思惟、籌量。何以故？是信行、法行人、八人、須陀洹、斯陀含、阿那含、阿羅漢、辟支佛──若智、若斷，即是菩薩摩訶薩無生法忍。」#71.11
%59.18 （二）佛述歎
%59.19 1、重述成
佛告欲、色界諸天子：「如是！如是！諸天子！若信行、法行人、八人、須陀洹乃至阿羅漢、辟支佛，即是菩薩摩訶薩無生法忍。
%59.20 2、聞持乃至正憶念般若者勝求二乘行者
諸天子！若善男子、善女人聞是深般若波羅蜜，書、持受#71.12、讀、誦、說、正憶念，是善男子、善女人疾得涅槃，勝求聲聞、辟支佛乘善男子、善女人遠離深般若波羅蜜行餘經，若一劫、若減一劫。
何以故？是深般若波羅蜜中廣說上妙法，是信行、法行人、八人、須陀洹、斯陀含、阿那含、阿羅漢、辟支佛所應學；菩薩摩訶薩亦所應學，學已得阿耨多羅三藐三菩提。」#71.13
~2018
%59.21 （三）諸天結歎而歸
是時欲、色界諸天子俱發聲言：「世尊！是深般若波羅蜜名摩訶波羅蜜，世尊！是般若波羅蜜名不可思議、不可稱、無有量、無等等波羅蜜。信行、法行人、八人學是深般若@t25p553c波羅蜜，得成就；須陀洹、斯陀含、阿那含、阿羅漢、辟支佛學是深般若波羅蜜，得成；菩薩摩訶薩是深般若波羅蜜中學，得阿耨多羅三藐三菩提。是深般若波羅蜜亦不增、亦不減。」
是時諸欲、色界天子頂禮佛足，遶佛而去；去是不遠，忽然不現，各還本處。#71.14
%59.22 貳、明信解般若者之來處與得失
%59.23 （壹）明信解般若者之來處
%59.24 一、須菩提問
須菩提白佛言：「世尊！若菩薩摩訶薩聞是深般若波羅蜜即時信解者，從何處終來生是間？」
%59.25 二、佛答
%59.26 （一）上根者［聞、解、能行］：三處來生人間
%59.27 1、從人道來
佛告須菩提：「若菩薩摩訶薩聞是深般若波羅蜜即時信解，不沒、不却#71.15、不難、不疑、不悔，歡喜樂聽，聽已憶念，終不遠離是深般若波羅蜜，若行、若住、若坐、若臥，終不廢忘，常隨法師──譬如新生犢子不離其母；菩薩摩訶薩亦如是，為聞深般若波羅蜜故，終不遠離法師，乃至得是深般若波羅蜜，口誦、心解，正見通達。
須菩提！當知是菩薩從人道中終還生是間人中。#71.16
~2019何以故？是求佛道者前世時聞深般若波羅蜜，書、持#71.17、恭敬、尊重、讚歎、華香乃至幡蓋供養。以是因緣故，人中命終還生人中，聞是深般若波羅蜜，即時信解。」
%59.28 2、從他方國土來
須菩提白佛言：「世尊！頗有菩薩摩訶薩如是功德成就，他方世界供養諸佛，於彼命終，來生是間，聞深般若波羅蜜，即時信解，書、持、讀、誦、正憶念──有是者不？」
佛言：「有！菩薩如是功德成就，他方世界供養諸佛，於彼命終，來生是間，聞是深般若波羅蜜，即時信解，書、持、讀、誦、說、正憶念。
何以故？是菩薩摩訶薩從他方諸佛所聞是深般若波羅蜜，信解、書、持、讀、誦、說、正憶念，於彼間終，來生此間，當知是人是先世功德成就。@t25p554a
%59.29 3、從彌勒菩薩處來
復次，須菩提！有菩薩從彌勒菩薩摩訶薩聞是深般若波羅蜜，以是善根因緣故，來生此間。
%59.30 （二）下根者［雖聞而不問義，故多疑悔］：人中來
須菩提！復有菩薩摩訶薩前世時雖聞深般若波羅蜜，不問中事；來生人中，聞是深般若波羅蜜，心有疑悔，難悟。須菩提！如是菩薩，當知先世雖聞是深般若波羅蜜，不問故，今續生疑悔，難悟。
須菩提！若菩薩先世雖聞禪波羅蜜，不問中事；今世聞般若波羅蜜時，不問故，續生疑悔。
須菩提！若菩薩先世雖聞毘梨耶波羅蜜，不問中事；今世聞般若波羅蜜，不問故，續復疑悔。
須菩提！若菩薩先世聞#71.18羼提波羅蜜，不問中事；今世聞般若波羅蜜，不問故，續復疑悔。
須菩提！若菩薩先世雖聞尸羅波羅蜜，不問中事；今世聞般若波羅蜜，不問故，續復疑悔。
須菩提！若菩薩先世雖聞檀波羅蜜，不問中事；今世聞般若波羅蜜，不問故，續復疑悔。
復次，須菩提！菩薩摩訶薩先世雖聞內空、外空、內外空乃至無法有法空，不問中事；來生人中，聞是深般若波羅蜜，不問故，續復疑悔，難悟。
復次，須菩提！菩薩摩訶薩先世雖聞四念處乃至八聖道分、四禪、四無量心、四無色定、五神通、佛十力乃至一切種智，不問中事；來生人中，聞是深般若波羅蜜，不問故，續復疑悔，難悟。
~2020
%59.31 （三）中根者［雖問而不隨行］：人中來
復次，須菩提！菩薩摩訶薩先世聞深般若波羅蜜，問#71.19中事而不行；捨身生時，聞是深般若波羅蜜，若一日、二日、三日、四日、五日，其心堅固無能壞者，若離所聞時便退失。
何以故？先世聞是深般若波羅蜜時，雖問中@t25p554b事，不如說行。是人或時欲聞、或時不欲聞，心輕不固、志亂不定，譬如輕毛隨風東西。#71.20
須菩提！當知是菩薩(1)發意不久，(2)不與善知識相隨，(3)不多供養諸佛，(4)先世不書是深般若波羅蜜，(5)不讀、(6)不誦、(7)不正憶念，(8)不學般若波羅蜜、不學禪波羅蜜、不學毘梨耶波羅蜜、不學羼提波羅蜜、不學尸羅波羅蜜、不學檀波羅蜜，不學內空乃至無法有法空，不學四念處乃至八聖道分，不學四禪、四無量心、五神通、佛十力，乃至不學一切種智。
如是，須菩提！當知是菩薩摩訶薩新發大乘意，少信、少樂故，不能書是深般若波羅蜜，不能受持、讀、誦、說、正憶念。#71.21
%59.32 （貳）明中下根者無般若守護故，當墮二乘
%59.33 一、正說其意
須菩提！若求佛道善男子、善女人不書是深般若波羅蜜，不受持讀誦、不說、不正憶念，亦不為深般若波羅蜜所護，乃至不為一切種智所護；是人亦不如說行深般若波羅蜜，乃至不如說行一切種智，是人或墮二地──若聲聞地、若辟支佛地。
何以故？是善男子、善女人不書是深般若波羅蜜，不讀、不誦、不說、不正憶念，是人亦不為深般若波羅蜜所護、亦不如說行。以是故，是善男子、善女人於二地中當墮一地。
^71.2
$$（貳）明中下根者無般若守護故，當墮二乘（承上卷71〈50 大事起品〉）
$$一、正說其意（承上卷71〈50 大事起品〉）
%59.63 二、舉喻明理#71.43
%59.64 （一）海中船破喻
佛告須菩提：「譬如大海中船破壞，其中人若不取木、不取器物、不取浮囊、不取死屍，須菩提！當知是人不到彼岸，沒海中死。
須菩提！若船破時，其中人取木、取器物、浮囊、死屍者，當知是人終不沒死，安隱無礙，得到彼岸。
須菩提！求佛道善男子、善女人亦復如是，若但有信樂，不依深般若波羅蜜，不書、不讀、不誦、不正憶念；不依禪波羅蜜、毘梨耶波羅蜜、羼提波羅蜜、尸羅波羅蜜、檀波羅蜜，不書、不讀、不誦、不正憶念；乃至不依一切種智，不書、不讀、不誦、不正憶念。須菩提！當知是善男子中道衰耗，是人未到一切種智，於聲聞、辟支佛~2025地取證。#71.44
須菩提！若有求佛道善男子、善女人為阿耨多羅三藐三菩提故，(1)有信、(2)有忍、(3)有淨心、(4)有深心、(5)有欲、(6)有解、(7)有捨、(8)有精進，是人依深般若波羅蜜，書、持、讀、誦、說、正憶念；是善男子、善女人為阿耨多羅三藐三菩提故，有諸信、忍、淨心、深心、欲、解、捨、精進，為深般若波羅蜜所護乃至一切種智所護故，終不@t25p555c中道衰耗，過聲聞、辟支佛地，能淨佛世界、成就眾生，當得阿耨多羅三藐三菩提。#71.45
%59.65 （二）持瓶取水喻
須菩提！譬如男子、女人持坏#71.46瓶取水，當知是瓶不久爛壞。何以故？是瓶未熟故，還歸於地。
如是，須菩提！善男子、善女人雖有為阿耨多羅三藐三菩提心，有信、有忍、有淨心、有深心、有欲、有解、有捨、有精進，不為般若波羅蜜、方便力所守護，不為禪波羅蜜、毘梨耶波羅蜜、羼提波羅蜜、尸羅波羅蜜、檀波羅蜜所守護，不為內空乃至無法有法空、四念處乃至八聖道分、佛十力乃至一切種智所守護。須菩提！當知是人中道衰耗，墮聲聞、辟支佛地。
須菩提！譬如男子女人持熟瓶取水，若河、若井、若池、若泉，當知是瓶持水安隱。何以故？是瓶成熟故。
如是，須菩提！善男子、善女人求阿耨多羅三藐三菩提，有諸信、忍、淨心、深心、欲、解、捨、精進，為般若波羅蜜、方便力所護，為禪定、精進、忍、戒、施乃至一切種智所護故。須菩提！當知是人不中道衰耗，過聲聞、辟支佛地，能淨#71.47世界、成就眾生，得阿耨多羅三藐三菩提。
%59.66 （三）船寶航行喻
須菩提！譬如大海邊船未莊治，便持財物著上，須菩提！當知是船中道壞沒，船與財物各在一處；是估#71.48客#71.49無方便力故，亡其重寶。
~2026如是，須菩提！是求佛道善男子、善女人雖有為阿耨多羅三藐三菩提心，有信、忍、淨心、深心、欲、解、捨、精進，不為般若波羅蜜、方便力所守護，乃至不為一切種智所守護故，當知是人中道衰耗，失大珍寶。
大珍寶者，所謂一切種智。
衰耗者，墮聲聞、辟支佛地。#71.50
須菩提！譬如@t25p556a人#71.51有智、方便莊治海邊大船，然後推著水中，持財物著上而去，當知是船不中道沒壞，必得安隱到所至處。
如是，須菩提！善男子、善女人為阿耨多羅三藐三菩提，有信、忍、淨心、深心、欲、解、捨、精進，為般若波羅蜜、方便力所護，為禪、精進、忍、持#71.52戒、施乃至一切種智所護故，當知是菩薩得到阿耨多羅三藐三菩提，不中道墮聲聞、辟支佛地。
%59.67 （四）耆年起行喻
須菩提！譬如有人年百二十歲，年耆根熟，又有風、冷、熱病、若雜病。須菩提！於汝意云何：是人能從床起不？」
   須菩提言：「不能。」
佛言：「是人或#71.53能起者，云何？」
須菩提言：「是人雖能起，不能遠行若十里、若二十里，以其老病故。」
「如是，須菩提！善男子、善女人雖有為阿耨多羅三藐三菩提心，有信、忍、淨心、深心、欲、解、捨、精進，不為般若波羅蜜、方便力所守護，乃至不為一切種智所守護故，當知是人中道墮聲聞、辟支佛地。何以故？不為般若波羅蜜、方便力所守護故。
須菩提！如向老人百二十歲，年耆根熟，又有風、冷、熱病、若雜病，是人欲起行，有兩健人各扶一腋，語老人言：『莫有所難，隨所欲至，我等二人終不相捨。』
如是，須菩提！若善男子、善女人為阿耨多羅三藐三菩提，有信、忍、淨心、深心、欲、解、捨、精進，為般若波羅蜜、方便力所護，乃至為一切種智所護，當知是人不中道墮聲聞、辟支佛地，能到是處，所謂阿耨多羅三藐三菩提。」
^71.3
%59.76 （參）更明求佛道之無方便義與有方便義
%59.77 一、辨無方便
爾時，佛語須菩提言：「善哉！善哉！須菩提！汝為諸菩薩摩訶薩問佛是事。
須菩提！若有@t25p556c求佛道善男子、善女人，從初發意已來，以我、我所心布施、持戒、忍辱、精進、禪定、智慧；
是善男子、善女人布施時作是念：『我是施主，我施是人，我施是物#71.62。我持戒，我修忍，我精進，我入禪，我修智慧。』
是善男子、善女人念『有是施，是我施』，乃至念『有是慧，是我慧』。
何以故？檀波羅蜜中無如是分別，遠離此彼岸是檀波羅蜜相；尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜，般若波羅蜜中無如是分別。何以故？遠離此彼岸是般若波羅蜜相。
是人不知此岸、不知彼岸，是人不為檀波羅蜜乃至不為一切種智所護故，墮聲聞、辟支佛地，不能到薩婆若。#71.63
~2029須菩提！云何求佛道人無方便？
須菩提！求佛道人從初發心已來無方便行布施、持戒、忍辱、精進、禪定、修智慧。
是人作如是念：『我布施，施是人，以是物施；我持戒、修忍辱#71.64、勤精進、入禪定，修智慧──如是修智慧。』
是人念『有是施，是我施』，以是施自高；念『有是戒，是我戒』，以是戒自高；念『有是忍，是我忍』，以是忍自高；念『有是精進，是我精進』，以是精進自高；念『有是禪定，是我禪#71.65定#71.66』，以是禪定#71.67自高；念『有是慧，是我慧』，以是慧自高。
何以故？檀波羅蜜中無如是分別，遠離此彼岸是檀波羅蜜相；遠離此彼岸是尸羅波羅蜜相；遠離此彼岸是羼提波羅蜜相；遠離此彼岸是毘梨耶波羅蜜相；遠離此彼岸是禪波羅蜜相；遠離此彼岸是般若波羅蜜相。何以故？般若波羅蜜中無如是憶念分別。
是求佛道善男子、善女人不知此岸、不知彼岸，是人不為檀波羅蜜所護，@t25p557a不為尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜所護故，乃至不為一切種智所護故，或墮聲聞道中、或墮辟支佛道中，不能得到薩婆若。
如是，須菩提！菩薩摩訶薩不為般若波羅蜜、方便力所守護故，或墮聲聞地、或墮辟支佛道中。#71.68
%59.78 二、辨有方便
須菩提！云何菩薩摩訶薩為般若波羅蜜、方便力所守護故，不墮聲聞、辟支佛道中，疾得阿耨多羅三藐三菩提？
須菩提！菩薩從初已來，以方便力布施，無我、我所心布施，乃至無我、我所心修智慧。是人不作是念『我有是施，是我施』，不以是施自高；乃至般若波羅蜜亦如是。
~2030是菩薩不念『我布施』，不念『我施是人，用是物施』；不念『我持戒，有是戒』；不念『我忍辱，有是忍辱』；不念『我精進，有是精進』；不念『我禪定，有是禪定』；不念『我修智慧，有是智慧』。
何以故？是檀波羅蜜中無如是分別，遠離此彼岸是檀波羅蜜相；遠離此彼岸是尸羅波羅蜜相；遠離此彼岸是羼提波羅蜜相；遠離此彼岸是毘梨耶波羅蜜相；遠離此彼岸是禪波羅蜜相；遠離此彼岸是般若波羅蜜相。何以故？是般若波羅蜜中無如是憶想分別。
是菩薩摩訶薩知此岸、知彼岸，是人為檀波羅蜜所護、為尸羅波羅蜜所護、為羼提波羅蜜所護、為毘梨耶波羅蜜所護、為禪波羅蜜所護、為般若波羅蜜所護，乃至為一切種智所護故，不墮聲聞、辟支佛地，得到薩婆若。
如是，須菩提！菩薩摩訶薩為般若波羅蜜、方便力所護故，不墮聲聞、辟支佛地，疾得阿耨@t25p557b多羅三藐三菩提。」#71.69
^71.4
%60.0 壹、新學菩薩應依善知識學，觀法性空
%60.1 （壹）須菩提問
爾時，須菩提白佛言：「世尊！新學菩薩摩訶薩云何應學般若波羅蜜、禪波羅蜜、毘梨耶波羅蜜、羼提波羅蜜、尸羅波羅蜜、檀波羅蜜？」#71.77
%60.2 （貳）佛答
%60.3 一、當親近善士
佛告須菩提：「新學菩薩摩訶薩若欲學般若波羅蜜，禪、精進、忍、戒、檀波羅蜜，先當親近、供養善知識能說是深般若波羅蜜者。
%60.4 二、隨善士之教
%60.5 （一）所有善根迴向佛道
是人作是教：『汝善男子#71.78！所有布施，一切迴向阿耨多羅三藐三菩提；善男子！所有持戒、忍辱、精進、禪定、智慧，一切迴向阿耨多羅三藐三菩提。
%60.6 （二）不取，不貪，觀法性空
%60.7 1、不取
汝莫以色是阿耨多羅三藐三菩提，莫以受、想、行、識是阿耨多羅三藐三菩提；#71.79莫~2032以檀波羅蜜是阿耨多羅三藐三菩提，莫以尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜是阿耨多羅三藐三菩提；
莫以內空乃至無法有法空是阿耨多@t25p557c羅三藐三菩提；
莫以四念處、四正勤、四如意足、五根、五力、七覺分、八聖道分是阿耨多羅三藐三菩提；
莫以四禪、四無量心、四無色定、五神通是阿耨多羅三藐三菩提；
莫以佛十力乃至十八不共法是阿耨多羅三藐三菩提。
所以者何？不取色便得阿耨多羅三藐三菩提，不取受、想、行、識便得阿耨多羅三藐三菩提；不取檀波羅蜜乃至般若波羅蜜便得阿耨多羅三藐三菩提；不取內空乃至無法有法空；不取四念處乃至十八不共法便得阿耨多羅三藐三菩提。#71.80
%60.8 2、不貪
善男子！行是深般若波羅蜜時莫貪色。何以故？善男子！是色非可貪者。莫貪受、想、行、識。何以故？受、想、行、識非可貪者。#71.81
善男子！莫貪檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜，莫貪內空乃至無法有法空，莫貪四念處乃至八聖道分，莫貪四禪、四無量心、四無色定、五神通，莫貪佛十力乃至一切種智。何以故？一切種智非可貪者。
善男子！莫貪須陀洹果乃至阿羅漢果，莫貪辟支佛道，莫貪菩薩法位，莫貪阿耨多羅三藐三菩提。何以故？阿耨多羅三藐三菩提非可貪者。
%60.9 3、辨因：觀法性空
所以者何？諸法性#71.82空故。』」#71.83
^71.5
%60.14 貳、菩薩能為難事、安隱世間等故，發無上菩提心
%60.15 （壹）須菩提歎
須菩提白佛言：「世尊！諸菩薩摩訶薩能為難事──於一切性空法中求阿耨多羅三藐三菩提，欲得阿耨多羅三藐三菩提。」
%60.16 （貳）佛述成，更讚餘因緣
%60.17 一、佛述成
佛言：「如是！如是！須菩提！菩薩摩訶薩能為難事──於一切性空法中求阿耨多羅三藐三菩提，欲得阿耨多羅三藐三菩提。
%60.18 二、更讚餘希有因緣
%60.19 ※ 總說
須菩提！諸菩薩摩訶薩(1)為安隱世間故，發阿耨多羅三藐三菩提心；(2)為安樂世間故、(3)為救世間故、(4)為世間歸故、(5)為世間依處故、(7)為世間洲故、(8)為世間將導故、(6)為世間究竟道故、(9)為世間趣故，發阿耨多羅三藐三菩提心。#71.90
~2034
%60.20 ※ 別辨
%60.21 （一）為安隱世間故
須菩提！云何菩薩摩訶薩為安隱世間故發阿耨多羅三藐三菩提心？
須菩提！菩薩摩訶薩得阿耨多羅三藐三菩提時，拔出六道眾生，著無畏岸涅槃@t25p558b處。
須菩提！是為菩薩摩訶薩為安隱世間故發阿耨多羅三藐三菩提心。
%60.22 （二）為安樂世間故
云何菩薩摩訶薩為安樂世間故發阿耨多羅三藐三菩提心？
須菩提！菩薩摩訶薩得阿耨多羅三藐三菩提時，拔出眾生種種憂苦愁惱，著無畏岸涅槃處。
須菩提！是為菩薩摩訶薩為安樂世間故發阿耨多羅三藐三菩提心。
%60.23 （三）為救世間故
云何菩薩摩訶薩為救世間故發阿耨多羅三藐三菩提心？
須菩提！菩薩摩訶薩得阿耨多羅三藐三菩提時，救眾生生死中種種苦，亦為斷是苦故而為說法；眾生聞法，漸以三乘而得度脫。
須菩提！是為菩薩摩訶薩為救世間故發阿耨多羅三藐三菩提心。
%60.24 （四）為世間歸故
云何菩薩摩訶薩為世間歸故發阿耨多羅三藐三菩提心？
須菩提！菩薩摩訶薩得阿耨多羅三藐三菩提時，拔出眾生生老病死相、憂悲愁#71.91惱法，著無畏岸涅槃處。
須菩提！是為菩薩摩訶薩為世間歸故發阿耨多羅三藐三菩提心。#71.92
%60.25 （五）為世間依處故
云何菩薩摩訶薩為世間依處故發阿耨多羅三藐三菩提心？
   須菩提！菩薩摩訶薩得阿耨多羅三藐三菩提時，為眾生說一切法無依處。
   ~2035須菩提！是為菩薩摩訶薩為世間依處故發阿耨多羅三藐三菩提心。」
須菩提白佛言：「世尊！云何一切法無依處？」
佛言：「色不相續即是色無生，色無生即是色不滅，色不滅即是色無依處；受、想、行、識乃至一切種智亦如是。
   須菩提！是為菩薩摩訶薩為世間依處故發阿耨多羅三藐三菩提心。#71.93
%60.26 （六）為世間究竟道故
云何菩薩摩訶薩為世間究竟道故發阿耨多羅三藐三菩提心？@t25p558c
須菩提！若#71.94菩薩摩訶薩得阿耨多羅三藐三菩提時，為眾生說如是法──色究竟相非是色，#71.95受、想、行、識，乃至一切種智究竟相非是一切種智。
須菩提！如究竟相，一切法相亦如是。」#71.96
須菩提言：「世尊！若一切法如究竟相者，諸菩薩摩訶薩皆應得#71.97阿耨多羅三藐三菩提。何以故？世尊！色究竟相中無有分別，受、想、行、識究竟相中無有分別，乃至一切種智究竟相中無有分別──所謂是色，是受、想、行、識，乃至是一切種智。」
佛告須菩提：「如是！如是！色究竟相中無有分別，受、想、行、識乃至一切種智究竟相中無有分別──所謂是色乃至是一切種智。須菩提！是為菩薩摩訶薩難事。
如是觀諸法寂滅相，而心不沒不却#71.98。何以故？是菩薩摩訶薩作是念：『是諸深法，我應如是知，得阿耨多羅三藐三菩提；如是寂滅微妙法，當為眾生說。』
是為菩薩摩訶薩為世間究竟道故發阿耨多羅三藐三菩提心。#71.99
%60.27 （七）為世間洲故
~2036云何菩薩摩訶薩為世間洲故發阿耨多羅三藐三菩提心？
須菩提！若江河大海，四邊水斷，是名#71.100為洲。
須菩提！色亦如是前後際斷，受、想、行、識前後際斷，乃至一切種智前後際斷。以是前後際斷故，一切法亦斷。須菩提！是一切法前後際斷故，即是寂滅、即是妙寶──所謂空、無所得、愛盡無餘、離欲、涅槃。須菩提！菩薩摩訶薩得阿耨多羅三藐三菩提時，以寂滅微妙法為眾生說。
須菩提！是為菩薩摩訶薩為世間洲故發阿耨多羅三藐三菩提心。
%60.28 （八）為世間將導故
云何菩薩摩訶薩為世間將導故發阿耨多@t25p559a羅三藐三菩提心#71.101？
須菩提！菩薩摩訶薩得阿耨多羅三藐三菩提時，為眾生說色不生不滅、不垢不淨，說受想行識不生不滅、不垢不淨；說十二處、十八界、四念處乃至八聖道分、四禪、四無量心、四無色定、五神通不生不滅、不垢不淨；說須陀洹果乃至阿羅漢果、辟支佛道不生不滅、不垢不淨；說佛十力乃至一切種智不生不滅、不垢不淨。
須菩提！是為菩薩摩訶薩為世間將導故發阿耨多羅三藐三菩提心。#71.102
^71.6
%60.43 （九）為世間趣故
云何菩薩摩訶薩為世間趣故發阿耨多羅三藐三菩提心？
%60.44 1、依三解脫門辨
須菩提！菩薩摩訶薩得阿耨多羅三藐三菩提時，為眾生說色趣空，說受、想、行、識趣空，乃至說一切種智趣空。為眾生說色非趣非不趣。何以故？是色空相，非趣非不趣。說受、想、行、識非趣非不趣。何以故？是受、想、行、識空相，非趣非不趣。乃至一切種智非趣非不趣。何以故？是一切種智空相，@t25p559c非趣非不趣。
如是，須菩提！菩薩摩訶薩為世間趣故發阿耨多羅三藐三菩提心。#71.111
何以故？一切法趣空，是趣不過。何以故？空中，趣、非#71.112趣不可得故。
~2039須菩提！一切法趣無相，是趣不過。何以故？無相中，趣、非趣不可得故。
須菩提！一切法趣無作，是趣不過。何以故？無作中，趣、非趣不可得故。#71.113
%60.45 2、依無起等辨
須菩提！一切法趣無起#71.114，是趣不過。何以故？無起＊中，趣、非趣不可得故。#71.115
須菩提！一切法趣無所有、不生不滅、不垢不淨，是趣不過。何以故？無所有、不生不滅、不垢不淨中，趣、非趣不可得故。
%60.46 3、依夢等五喻辨
須菩提！一切法趣夢#71.116，是趣不過。何以故？夢中，趣、非趣不可得故。
須菩提！一切法趣幻、趣嚮#71.117、趣影、趣化，是#71.118趣不過。何以故？是化等中，趣、非趣不可得故。
%60.47 4、依無量、無邊辨
須菩提！一切法趣無量、無邊，是趣不過。何以故？無量、無邊中，趣、非趣不可得故。
%60.48 5、依不與不取等辨
須菩提！一切法趣不與不取，是趣不過。何以故？不與不取中，趣、非趣不可得故。
須菩提！一切法趣不舉不下，是趣不過。何以故？不舉不下中，趣、非趣不可得故。
須菩提！一切法趣不增不減，是趣不過。何以故？#71.119無增無減中，趣、非趣不可得故。
須菩提！一切法趣不來不去，是趣不過。何以故？不來不去中，趣、非趣不可得#71.120故。
須菩提！一切法趣不入不出、不合不散、不著不斷，是趣不過。何以故？不著不斷中，趣、非趣不可得故。
%60.49 6、依我見等辨
~2040須菩提！一切法趣我、眾生、壽命、人、起、使起#71.121、作、使作#71.122、知者、見者，#71.123是趣不過。何以故？我乃至知者、見者畢竟不可得，何況當#71.124有趣、非趣！
%60.50 7、依四倒、四正辨
須菩提！一切法@t25p560a趣有#71.125常，是趣不過。何以故？常#71.126畢竟不可得，云何當有趣、非趣？須菩提！一切法趣樂、淨、我，是趣不過。何以故？樂、淨、我畢竟不可得，云何當有趣、非趣？
須菩提！一切法趣無常、苦、不淨、無我，是趣不過。何以故？無常、苦、不淨、無我畢竟不可得，云何當有趣、非趣？
%60.51 8、依四惑事辨
須菩提！一切法趣欲事，是趣不過。何以故？欲事畢竟不可得，何況當有趣、非趣！
須菩提！一切法趣瞋事、癡事、見事，是趣不過。何以故？瞋事、癡事、見事畢竟不可得，何況當有趣、非趣！#71.127
%60.52 9、依如等理境辨
須菩提！一切法趣如，是趣不過。何以故？如中無來無去故。
須菩提！一切法趣法性、實際、不可思議性，是趣不過。何以故？法性、實際、不可思議性中無來無去故。
須菩提！一切法趣平等，是趣不過。何以故？平等中，趣、非趣不可得故。
須菩提！一切法趣不動相，是趣不過。何以故？不動相中，趣、非趣不可得故。
%60.53 10、依蘊、處、界辨
須菩提！一切法趣色，是趣不過。何以故？色畢竟不可得#71.128，云何當有趣、非趣？
須菩提！一切法趣受、想、行、識，是趣不過。何以故？受、想、行、識畢竟不可得，云何當有趣、非趣？十二處、十八界亦如是。
%60.54 11、依六度辨
須菩提！一切法趣檀波羅蜜，是趣不過。何以故？檀畢竟不可得故，云何當有趣、非趣？
須菩提！一切法趣尸羅波羅蜜，是趣不過。何以故？尸羅畢竟不可得故，云何當有趣、非趣？
~2041須菩提！一切法趣羼提波羅蜜，是趣不過。何以故？羼提畢竟不可得故，云何當有趣、非趣？
須菩提！一切法趣毘梨耶波羅蜜，是趣不過。何以故？毘梨耶畢竟不可得故，云何當有趣、非趣？@t25p560b
須菩提！一切法趣禪波羅蜜，是趣不過。何以故？禪畢竟不可得故，云何當有趣、非趣？須菩提！一切法趣般若波羅蜜，是趣不過。何以故？般若畢竟不可得故，云何當有趣、非趣？
%60.55 12、依十八空辨
須菩提！一切法趣內空，是趣不過。何以故？內空畢竟不可得故，云何當有趣、非趣？
須菩提！一切法趣外空，是趣不過。何以故？外空畢竟不可得故，云何當有趣、非趣？
須菩提！一切法趣內外空，是趣不過。何以故？內外空畢竟不可得故，云何當有趣、非趣？
乃至一切法趣無法有法空，是趣不過。何以故？無法有法空畢竟不可得故，云何當有趣、非趣？
%60.56 13、依菩提分法辨
須菩提！一切法趣四念處乃至八聖道分，是趣不過。何以故？四念處乃至八聖道分畢竟不可得故，云何當有趣、非趣？
%60.57 14、依佛功德辨
須菩提！一切法趣佛十力乃至一切種智，是趣不過。何以故？一切種智中，趣、非趣不可得故。
%60.58 15、依三乘道果辨
須菩提！一切法趣須陀洹果、斯陀含果、阿那含果、阿羅漢果、辟支佛道，是趣不過。何以故？須陀洹果乃至辟支佛道中，趣、非趣不可得故。
須菩提！一切法趣阿耨多羅三藐三菩提，是趣不過。何以故？阿耨多羅三藐三菩提中，趣、非趣不可得故。
%60.59 16、依三乘聖者辨
須菩提！一切法趣須陀洹乃至佛，是趣不過。何以故？須陀洹乃至佛中，趣、非趣不可得故。」
%60.60 參、明信解義
%60.61 （壹）明能信解者之條件
須菩提白佛言：「世尊！是深般若波羅蜜誰能信解者？」
佛告須菩提：「有菩薩摩訶薩(1)先於諸佛所久行六波羅蜜、(2)善根純#71.129熟、(3)供養無數百千萬億諸佛、(4)與善知識相隨，是輩人能信解深般若波羅蜜。」
~2042
%60.62 （貳）辨信解相
須菩提白佛言：「世尊！能信解是@t25p560c深般若波羅蜜者，有何等性、何等相、何等貌？」
佛言：「欲、瞋#71.130、癡斷離是性、相、貌，是菩薩摩訶薩則能信解深般若波羅蜜。」#71.131
^71.7
@t25p561a
%60.71 肆、能信解般若者，趣至一切種智，應當驗知
%60.72 （壹）能解般若故趣薩婆若果
%60.73 一、明自行趣果
須菩提白佛言：「世尊！是諸菩薩摩訶薩解#71.142深般若波羅蜜者，當趣何所？」
佛告須菩提：「是菩薩摩訶薩解深般若波羅蜜者#71.143，當趣一切種智。」#71.144
~2044
%60.74 二、明化他趣果
須菩提白佛言：「世尊！是菩薩摩訶薩能趣一切種智者，則#71.145為一切眾生所歸趣，修般若波羅蜜故。#71.146世尊！修般若波羅蜜即是修一切諸法。
%60.75 三、明無所修、不受修、壞修是修般若
世尊！無所修是修般若波羅蜜，不受修、壞修是修般若波羅蜜。」#71.147
佛告須菩提：「何等法壞故，般若#71.148波羅蜜為壞修？」
「世尊！色壞故，般若波羅蜜為壞修；#71.149受、想、行、識、十二處、十八界壞故，般若波羅蜜為壞修；我乃至知者、見者壞故，般若波羅蜜為壞修；世尊！檀波羅蜜壞故，般若波羅蜜為壞修；乃至般若波羅蜜壞故，般若波羅蜜為壞修；內空乃至無法有法空、四念處乃至十八不共法、須陀洹果乃至一切種智壞故，般若波羅蜜為壞修。」
佛言：「如是！如是！須菩提！色壞故，般若波羅蜜為壞修；乃至一切種智壞故，般若波羅蜜為壞修。」#71.150
%60.76 （貳）依五相#71.151驗知信般若者
爾時，佛告須菩提：「是深般若波羅蜜中，阿鞞跋致菩薩摩訶薩應#71.152當驗知！
%60.77 一、不著般若等
若菩薩摩訶薩是深般若波羅蜜中不著，當知是阿鞞跋致#71.153；#71.154禪波羅蜜乃至檀波羅蜜中不著，四念處乃至一切種智中不著，當知是阿鞞跋致。
^71.8
%60.85 二、自證不由他
若阿鞞跋致菩薩摩訶薩行深般若波羅蜜時，不以他人語為堅要，亦不隨他教行。#71.161
%60.86 三、不為諸惑牽
阿鞞跋致菩薩摩訶薩不為欲心、瞋心、癡心所牽。
%60.87 四、常不離六度
若阿鞞跋致菩薩摩訶薩不遠離六波羅蜜。
%60.88 五、歡喜樂深法
若阿鞞跋致菩薩摩訶薩聞說深般若波羅蜜時，心不驚、不沒、不怖、不畏、不悔，歡喜樂聞，受持、讀、誦、正憶念、如說行；須菩提！當知是菩薩先世已問#71.162是深般若波羅蜜中事已，受持、讀、誦、說、正憶念。
何以故？是菩薩摩訶薩@t25p561c有大威德故，聞是深般若波羅蜜，心不驚、不怖、不畏、不沒、不悔，歡喜樂聞，受持、讀、誦、正憶念。」
%60.89 （參）明行般若
%60.90 一、以空等相應，隨佛智心行
須菩提白佛言：「世尊！若菩薩摩訶薩聞深般若波羅蜜，不驚、不怖乃至正憶念，世尊！是菩薩摩訶薩云何行般若波羅蜜？」
佛言：「隨順一切種智心，是菩薩摩訶薩應如是行般若波羅蜜。」#71.163
「世尊！云何名隨順一切種智心，是菩薩摩訶薩應如是行般若波羅蜜？」
佛言：「以空隨順，是為菩薩摩訶薩行深般若波羅蜜；以無相、無作、無所有、不生不滅、不垢不淨隨順，是菩薩摩訶薩應如是行般若波羅蜜；以如夢、幻、炎、嚮#71.164、化隨順，是行般若波羅蜜。」#71.165
~2047
%60.91 二、順畢竟空心，不觀一切法
須菩提白佛言：「佛說以空隨順乃至如夢如幻隨順，是行般若波羅蜜。世尊！是菩薩摩訶薩行#71.166何法──若色，若受、想、行、識乃至一切種智？」
佛告須菩提：「菩薩摩訶薩不行色，不行受、想、行、識，乃至不行一切種智。何以故？是菩薩摩訶薩行#71.167處，(1)無作法、(2)無壞法、(3)無所從來、(4)亦無所去、(5)無住處，是法(6)不可數、(7)無有量；若無數、無量，(8)是法不可得──不可以色得，乃至不可以一切種智得。
何以故？色即是薩婆若，乃至一切種智即是薩婆若。色如相乃至一切種智如相皆是一如，無二無別。」#71.168
^72.1
%61.0 壹、歎佛菩提甚深
%61.1 （壹）諸天歎，佛述成
%61.2 一、甚深歎
%61.3 （一）諸天歎
%61.4 1、正歎：佛菩提甚深
爾時，欲界諸天子、色界諸天子以天末栴檀香，以天青蓮華、赤蓮花、紅蓮華、白蓮華遙散佛上，來至佛所，頂禮佛足，一面住，白佛言：「世尊！諸佛阿耨多羅三藐三菩提甚深、難見、難解、不可思惟#72.2知、微妙寂滅，智者能知，一切世間所不能信。#72.3
%61.5 2、釋歎：諸法與薩婆若如相無二無別
何以故？是深般若波羅蜜中，如是說：『色即是薩婆若，薩婆若即是色；乃至一切種智即是薩婆若，薩婆若即是一切種智。色如相、薩婆若如相，是一如，無二無別；乃至一切種智如相、薩婆若如相，一如，無二無別。』」#72.4
~2050
%61.6 （二）佛述成
%61.7 1、述歎
佛告欲、色界諸天子：「如是！如是！諸天子！色即是薩婆若，薩婆若即是色；乃至一切種智即是薩婆若，薩婆若即是一切種智。色如相乃至一切種智如相，一如，無二無別。
諸天子！以是義故，佛初成道時，心樂嘿#72.5然，不樂說法。
%61.8 2、釋歎
%61.9 （1）釋心樂默然
何以故？是諸佛阿耨多羅三藐三菩提法甚深、難見、難解、不可思惟知、微妙寂滅，智者能@t25p562c知，一切世間所不能信。何以故？阿耨多羅三藐三菩提，無得者、無得處、無得時，是名諸法甚深相──所謂無有二法。#72.6
%61.10 （2）廣舉法喻歎
諸天子！如虛空甚深故，是法甚深；如甚深故，是法甚深；法性甚深、實際甚深、不可思議、無邊甚深故，是法甚深；無來無去甚深故，是法甚深；不生不滅、無垢無淨、無知無得甚深故，是法甚深。
諸天子！我甚深乃至知者、見者甚深故，是法甚深。
諸天子！色甚深、受想行識甚深故，是法甚深；檀波羅蜜甚深乃至般若波羅蜜甚深故，是法甚深；內空乃至無法有法空甚深故，是法甚深；四念處甚深乃至一切種智甚深故，是法甚深。」
%61.11 二、無受無捨歎
%61.12 （一）諸天歎
爾時，欲、色界諸天子白佛言：「世尊！是所說法，一切世間所不能信。
世尊！是甚深法，不為受色故說，不為捨色故說；不為受受、想、行、識故說，不~2051為捨受、想、行、識故說；#72.7不為受須陀洹果故說，不為捨須陀洹果故說；乃至不為受一切種智故說，不為捨一切種智故說。
諸世間皆受著行，所謂色是我、是我所，受、想、行、識是我、是我所，乃至十八不共法是我、是我所；須陀洹果是我、是我所，乃至一切種智是我、是我所。」#72.8
%61.13 （二）佛述成，並顯取諸法而行之過失
佛告諸天子：「如是！如是！諸天子！是法非為受色故說，非為捨色故說；乃至非為受一切種智故說，非為捨一切種智故說。
諸天子！若有菩薩為受色故行，乃至為受一切種智故行，是菩薩不能修般若波羅蜜，不能修禪波羅蜜、毘梨耶波羅蜜、羼提波羅蜜、尸羅波羅蜜、不能修檀波羅蜜，乃至不能修一切種智者。」
%61.14 （貳）須菩提歎
%61.15 一、隨順歎
須菩提白佛言：「@t25p563a世尊！是法隨順一切法。云何是法隨順一切法？是法隨順般若波羅蜜，乃至隨順檀波羅蜜；#72.9是法隨順內空，乃至隨順無法有法空；是法隨順四念處，乃至隨順一切種智。
%61.16 二、無礙歎
是法無礙──不礙於色，不礙受、想、行、識，乃至不礙一切種智。
諸天子！是法名無礙相，如虛空等故，如、法性、法住、實際、不可思議性等故，空、無相、無作等故。#72.10
%61.17 三、不生歎
是法不生相──色不生，不可得故；受、想、行、識不生，不可得故；乃至一切種智不生，不可得故。
~2052
%61.18 四、無處歎
是法無處──色處不可得故；受、想、行、識處不可得故，乃至一切種智處不可得故。」#72.11
%61.19 貳、歎如甚深
%61.20 （壹）以「如」明隨生，復顯「如來」義
%61.21 一、諸天讚須菩提是佛子、隨佛生
是時欲、色界諸天子白佛言：「世尊！須菩提是佛子，隨佛生。何以故？須菩提所說皆與空合。」#72.12
%61.22 二、須菩提以「如」辨隨生義
%61.23 （一）略明
爾時，須菩提語諸天子：「汝等言：『須菩提是佛子，隨佛生。』云何為隨佛生？諸天子！如相故，須菩提隨佛生。#72.13
%61.24 （二）十門廣釋
%61.25 1、如相不來不去
何以故？如來如相不來不去，須菩提如相亦不來不去。是故須菩提隨佛生。#72.14
%61.26 2、如相畢竟空
復次，須菩提從本已#72.15來隨佛生。何以故？如來如相即是一切法如相，一切法如相即是如來如相；是如相中亦無如相。是故須菩提為隨佛生。#72.16
%61.27 3、如相常住無異
復次，如來如常住相，須菩提如亦常住相；如來如相無異無別，須菩提如相亦無異無別。是故須菩提為隨佛生。#72.17
%61.28 4、如相無有罣礙
如來如相無有礙處，一切法如相#72.18亦無礙處；是如來如相、一切法如相，一如，無~2053二無別。#72.19
%61.29 5、如相無造作者
是如相無作，終不不如，是故是如相一如#72.20，無二無別。是故須菩提為隨佛生。#72.21
%61.30 6、如相無念無分別
如來如相一切處無念無別，須菩提如相亦如是──一切處無念無@t25p563b別；如來如相不異不別、不可得，須菩提如相亦如是。以是故須菩提為隨佛生。#72.22
%61.31 7、如相不離一切法如
如來如相不遠離諸法如相，是如#72.23終不不如；是故須菩提如不有異，為隨佛生，亦無所隨。#72.24
%61.32 8、如相出過三世
復次，如來如相不過去、不未來、不現在，諸法如相亦不過去、不未來、不現在。是故須菩提為隨佛生。#72.25
%61.33 9、如相不在三世如中
復次，如來如不在過去如中，過去如亦不在如來如中；如來如不在未來如中，未來如不在如來如中；如來如不在現在如中，現在如不在如來如中。過去未來現在如、如來如，一如，無二無別。#72.26
%61.34 10、「諸法如」與「如來如」無二無別
色如、如來如，受想行識如、如來如──是色如、受想行識如、如來如，一如，無二無別；#72.27我如乃至知者見者如、如來如，一如，無二無別；檀波羅蜜如乃至般若~2054波羅蜜如、內空如乃至無法有法空如、四念處如乃至一切種智如、如來如，一如，無二無別。」
%61.35 三、佛示「如來」真義
「須菩提！菩薩摩訶薩得是如故，名為如來。」#72.28
%61.36 四、現瑞證說
說是〈如相品〉時，是三千大千世界大地六種振#72.29動──東踊#72.30西沒，西踊#72.31東沒；南踊北沒，北踊南沒；中央踊四邊沒，四邊踊中央沒。
^72.2
%61.82 （貳）明如體離相，破諸天著情#72.57
%61.83 一、諸天歎
是時，諸欲天子、諸色天子以天末栴檀香散佛上及散須菩提上，白佛言：「未曾有也！世尊！須菩提以如來如隨佛生。」#72.58
%61.84 二、破著#72.59
%61.85 （一）須菩提以四門破
%61.86 1、正破
%61.87 （1）約有為明
須菩提復為諸天子說言：「諸天子！須菩提不從色中隨佛生，亦不從色如中隨佛生；不離色隨佛生，亦不離色如#72.60隨佛生。#72.61須菩提不從受、想、行、識中隨佛生，亦不從受、想、行、識如中隨佛生；不離受、想、行、識隨佛生，亦不離受、想、行、識如隨佛生。
乃至不從一切種智中隨佛生，亦不從一切種智如中隨佛生；不離一切種智隨佛生，亦不離一切種智如隨佛生。
~2060
%61.88 （2）約無為明
須菩提不從無為中隨佛生，亦不從無為如中隨佛生；不離無為隨佛生，亦不離無為如隨佛生。
%61.89 2、釋因由
何以故？是一切法皆無所有、不可得，無隨生者，亦無隨生法。#72.62@t25p565a
%61.90 （二）舍利弗就因果門破
%61.91 1、歎如甚深
爾時，舍利弗白佛言：「世尊！是如實不虛，法相、法住、法位甚深；#72.63
%61.92 2、諸法、諸法如皆不可得
是中色不可得，色如不可得。何以故？色尚不可得，何況色如當#72.64可得！#72.65
受、想、行、識不可得，受、想、行、識如不可得。何以故？受、想、行、識尚不可得，何況受、想、行、識如當可得！
乃至一切種智不可得，一切種智如不可得。何以故？一切種智尚不可得，何況一切種智如當可得！」
%61.93 （三）佛述成舍利弗意
佛告舍利弗：「如是！如是！舍利弗！是如實不虛，法相、法住、法位甚深，是中色不可得，色如不可得。何以故？色尚不可得，何況色如當可得！乃至一切種智不可得，一切種智如不可得。何以故？一切種智尚不可得，何況一切種智如當可得！」#72.66
%61.94 三、時眾悟道
舍利弗說是如相時，二百比丘不受一切法故，漏盡，得阿羅漢；五百比丘尼遠塵離垢，諸法中得法眼淨#72.67，生天、人中；五千諸菩薩摩訶薩得無生忍法#72.68；六千#72.69菩薩諸法不受故，漏盡，心得解脫，成阿羅漢。#72.70
~2061
%61.95 （參）明得失
%61.96 一、佛正說，兼答舍利弗問
%61.97 （一）法說
%61.98 1、明失：若無般若、方便力，則捨菩薩道
「舍利弗！是六千菩薩先世值五百佛，親近供養，於五百佛法中，行布施、持戒、忍辱、精進、禪定，無般若波羅蜜、無方便力故，行別異相；作是念：『是施、是持戒、是忍辱、是精進、是禪定。』無般若波羅蜜、無方便力故，布施、持戒、忍辱、精進、禪定，行別異#72.71相；行別異相故，不得無異相；不得無異相故，不得入菩薩位；不得入菩薩位故，得須陀洹果乃至阿羅漢果。舍利弗！菩薩摩訶薩雖有道──若空、若無相、若無作法，遠離般若波羅蜜、無方便力故，便於實際作證，取聲聞乘。」#72.72
%61.99 2、明得：不遠離薩婆若心，有方便力故，能入菩薩位，得無上菩提
%61.100 （1）舍利弗問
舍利弗白佛言：「世尊！何因緣故，俱行空、無@t25p565b相、無作法，遠離方便力故，於實際作證，取聲聞乘？菩薩摩訶薩亦修空、無相、無作法，有方便力故，得阿耨多羅三藐三菩提？」
%61.101 （2）佛答
%61.102 A、料簡失
佛告舍利弗：「有菩薩遠離薩婆若心，修空、無相、無作法，無方便力故，取聲聞乘。
%61.103 B、正明得
舍利弗！復有菩薩摩訶薩不遠離薩婆若心，修空、無相、無作法，有方便力故，入菩薩位，得阿耨多羅三藐三菩提。#72.73
~2062
%61.104 （二）舉喻：大鳥無翅，欲飛必墜
舍利弗！譬如有鳥，身長百由旬，若二百、三百由旬，而無有翅，從三十三天，自投閻浮提。舍利弗！於汝意云何？是鳥中道作是念：『欲還上三十三天。』能得還不？」
「不得也！世尊！」
「舍利弗！是鳥復作是願：『到閻浮提，欲使身不痛不惱。』舍利弗！於汝意云何？是鳥得不痛不惱不？」
舍利弗言：「不得也！世尊！是鳥到地，若痛、若惱、若死、若死等苦。何以故？世尊！是鳥身大而無翅故。」
%61.105 （三）合法
%61.106 1、無方便失
「舍利弗！菩薩摩訶薩亦如是，雖如恒河沙等劫修布施、持戒、忍辱、精進、禪定，發大事、生大心，為得阿耨多羅三藐三菩提故受無量願；是菩薩遠離般若波羅蜜、方便力故，若墮阿羅漢、若墮辟支佛道。#72.74
何以故？是菩薩遠離薩婆若心，布施、持戒、忍辱、精進、禪定，無般若波羅蜜、無方便力故，墮聲聞地、若辟支佛道中。
舍利弗！菩薩摩訶薩雖念過去、未來、現在諸佛持戒、禪定、智慧、解脫、解脫知見，取相受持；是人不知不解諸佛戒、定、慧、解脫、解脫知見，但聞空、無相、無作名字聲，而取名字聲迴向阿耨多羅三藐三菩提。菩薩摩訶薩若如是迴向，住聲聞、辟支佛地中，不能@t25p565c得過。
何以故？遠離般若波羅蜜及方便力，持諸善根迴向阿耨多羅三藐三菩提故。#72.75
%61.107 2、有方便得
舍利弗！有菩薩摩訶薩從初發意已來，不遠離薩婆若心，行布施、持戒、忍辱、精進、禪定，不遠離般若波羅蜜及方便力故，不取相；於過去、未來、現在諸佛戒、定、慧、解脫、解脫知見，不取空解脫門相，不取無相、無作解脫門相。舍利弗！當知是菩薩摩訶薩不墮聲聞、辟支佛道，直至阿耨多羅三藐三菩提。
何以故？是菩薩摩訶薩從初發心已來行布施不取相，持戒、忍辱、精進、禪定不取相；過去、未來、現在諸佛戒、定、慧、解脫、解脫知見不取相。
舍利弗！是名菩薩方便力，以離相心行布施、持戒、忍辱、精進、禪定，乃至離相心行一切種智。」
~2063
%61.108 二、舍利弗領解，結勸
%61.109 （一）領解
舍利弗白佛言：「世尊！如我解佛所說義──若菩薩摩訶薩不遠離般若波羅蜜、方便力，當知是菩薩近阿耨多羅三藐三菩提。
何以故？是菩薩摩訶薩從初發心已來無法可知──若色，若受、想、行、識乃至一切種智。#72.76
世尊！有求菩薩道善男子、善女人遠離般若波羅蜜、方便力，當知是人於阿耨多羅三藐三菩提或得、或不得。
何以故？世尊！是求菩薩道善男子、善女人所有布施皆取相，所有持戒、忍辱、精進、禪定皆取相。以是故，是善男子、善女人於阿耨多羅三藐三菩提不定。#72.77
%61.110 （二）結勸
世尊！以是因緣故，菩薩摩訶薩欲得阿耨多羅三藐三菩提，不應遠離般若波羅蜜、方便力。是菩薩摩訶薩住般若波羅蜜、方便力中，以無得無相心，應修#72.78布施、持戒、忍辱、精進、禪定；乃至以@t25p566a無得無相心，應修一切種智。」#72.79
^72.3
%61.134 參、辨「佛菩提難得或易得」
%61.135 （壹）諸天明佛菩提難得
%61.136 一、諸天子說
爾#72.98時，欲、色界諸天子白佛言：「世尊！阿耨多羅三藐三菩提難得！何以故？是菩薩摩訶薩應知一切諸法已，得阿耨多羅三藐三菩提#72.99，是法亦不可得。」#72.100
%61.137 二、佛印可，舉自身得無上菩提亦無所得
佛言：「如是！如是！諸天子！阿耨多羅三藐三菩提難得！我亦得一切法、一切種智已，得阿耨多羅三藐三菩提，亦無所得，無能知、無可知、亦無知者。何以故？諸法畢竟淨故。」#72.101
~2067
%61.138 （貳）須菩提云易得：以無所得為方便故
須菩提白佛言：「世尊！如佛所說『阿耨多羅三藐三菩提難得』，如我解佛所說義，我心思惟：『是阿耨多羅三藐三菩提易得。』
何以故？無有得阿耨多羅三藐三菩提者，亦無可得法。一切法、一切法相空，無法可得、無能得者。何以故？一切法空故。亦無法可增，亦無法可減。所謂布施、持戒、忍辱、精進、禪定乃至一切種智，是法皆無可得者、無能得者。
世尊！以是因緣故，我意謂阿耨多羅三藐三菩提為易得。
何以故？世尊！色色相空，受想行識識相空，乃至一切種智一切種智相空。」#72.102
%61.139 （參）論「得佛菩提之難易」
%61.140 一、辨「有無退還」
%61.141 （一）舍利弗難：菩薩多有退還
舍利弗語須菩提：「若一切法空如虛空，虛空不作是念：『我當得阿耨多羅三藐三菩提。』若菩薩摩訶薩信解一切諸法空如虛空，是阿耨多羅三藐三菩提易得者，今恒河沙等諸菩薩摩訶薩求阿耨多羅三藐三菩提，何以故退還？須菩提！以是故，知阿耨多羅三藐三菩提不易得。」#72.103
~2068
%61.142 （二）須菩提反責──明實無退還
%61.143 1、反責
%61.144 （1）約「色等諸法及諸法如」破
%61.145 A、即色等諸法無退
須菩提語舍利弗：「於意@t25p567a云何？色於阿耨多羅三藐三菩提退還不？」#72.104
舍利弗言：「不。」
「受、想、行、識於阿耨多羅三藐三菩提退還不？」
舍利弗言：「不。」
「乃至一切種智於阿耨多羅三藐三菩提退還不？」
舍利弗言：「不。」
%61.146 B、離色等諸法無退
「離色，有法於阿耨多羅三藐三菩提退還不？」#72.105
舍利弗言：「不。」
「離受、想、行、識，有法於阿耨多羅三藐三菩提退還不？」
舍利弗言：「不。」
「乃至離一切種智，有法於阿耨多羅三藐三菩提退還不？」
舍利弗言：「不。」
%61.147 C、即色等諸法如無退
「舍利弗！於意云何？色如相於阿耨多羅三藐三菩提退還不？」
舍利弗言：「不。」
「受、想、行、識如相乃至一切種智如相於阿耨多羅三藐三菩提退還不？」
舍利弗言：「不。」
%61.148 D、離色等諸法如無退
「離色如相，有法於阿耨多羅三藐三菩提退還不？」
舍利弗言：「不。」
「離受、想、行、識如相，乃至離一切種智如相，有法於阿耨多羅三藐三菩提退還不？」
舍利弗言：「不。」
%61.149 （2）約「如乃至不可思議性」破
%61.150 A、即如等不退
「舍利弗！於意云何？如於阿耨多羅三藐三菩提退還不？」
~2069舍利弗言：「不。」
「法性、法住、法位、實際、不可思議性於阿耨多羅三藐三菩提退還不？」
舍利弗言：「不。」
%61.151 B、離如等不退
「舍利弗！於意云何？離如，有法於阿耨多羅三藐三菩提退還不？」
舍利弗言：「不。」
「離法性、法住、法位、實際、不可思議性，有法於阿耨多羅三藐三菩提退還不？」
舍利弗言：「不。」
%61.152 2、詰成
須菩提語舍利弗言：「若#72.106諸法畢竟不可得，何等法於阿耨多羅三藐三菩提退還？」#72.107
%61.153 二、辨「三乘之有無」
%61.154 （一）舍利弗難：若無退者盡當作佛，云何有三乘
舍利弗語須菩提：「如須菩提所說──是法忍中，無有菩薩於阿耨多羅三藐三菩提退還者。若不退還，佛說『求道者有三種：阿羅漢道、辟支佛道、佛道』──是三種為無分別。如須菩@t25p567b提說，獨有一菩薩求佛道！」#72.108
是時，富樓那彌多羅尼子語舍利弗：「應當問須菩提：『為有一菩薩乘不？』」#72.109
爾時，舍利弗問須菩提：「須菩提！為欲說有一菩薩乘？」#72.110
%61.155 （二）須菩提以如相責成
%61.156 1、反責
須菩提語舍利弗：「於諸法如中，欲使有三乘#72.111人──聲聞乘、辟支佛乘、佛乘耶？」#72.112
舍利弗言：「不也。」
~2070「舍利弗！三乘分別中，有如可得不？」
舍利弗言：「不也。」#72.113
「舍利弗！是如有若一相、若二相、若三相不？」#72.114
舍利弗言：「不也。」
「舍利弗！汝欲於如中乃至有一菩薩不？」#72.115
舍利弗言：「不也。」#72.116
「如是四種中，三乘人不可得。舍利弗！云何作是念『是求聲聞乘人，是求辟支佛乘人，是求佛乘人』？#72.117
%61.157 2、結義：聞如而心不怖，能得佛菩提
舍利弗！菩薩摩訶薩聞是諸法如相，心不驚、不沒、不悔、不疑，是名菩薩摩訶薩能成就阿耨多羅三藐三菩提。」#72.118
%61.158 （肆）佛歎，釋疑
%61.159 一、歎須菩提所說義
爾時，佛讚須菩提言：「善哉！善哉！須菩提！汝所說者，皆是佛力。#72.119
~2071須菩提！若菩薩摩訶薩聞說是如無有諸法別異，心不驚、不怖、不畏、不難、不沒、不悔，當知是菩薩能成就阿耨多羅三藐三菩提。」
%61.160 二、釋舍利弗疑
舍利弗白佛言：「世尊！成就何等菩提？」
佛言：「成就佛阿耨多羅三藐三菩提。」
^72.4
~2073
%61.186 肆、明修菩提行
%61.187 （壹）明菩提行
%61.188 一、示無礙因#72.124
%61.189 （一）明七心行
%61.190 1、須菩提問
須菩提白佛言：「世尊！若菩薩摩訶薩欲成就阿耨多羅三藐三菩提，應云何行？」#72.125
%61.191 2、佛答
%61.192 （1）等心
佛言：「應起等心──於一切眾生亦以等心與語，無有偏黨；#72.126
%61.193 （2）大慈心
於一切眾生中起大慈心，亦以大慈心與語；
%61.194 （3）下意心
於一切眾生中下意#72.127，亦以下意與語；#72.128
%61.195 （4）安隱心
於一切眾生中應生安隱心，亦以安隱心與語；
%61.196 （5）無礙心
於一切眾生中應生無礙心，亦以無礙心與語；
%61.197 （6）無惱心
於一切眾生中應生無惱心，亦以無惱心與語；
%61.198 （7）愛敬心
於一切眾生中應生愛敬心，如父、如母、如兄、如弟、如姊、如妹、如兒子、如親族、知識，亦以愛敬心與語。
%61.199 （二）依四種正行#72.129，廣修諸道法
%61.200 1、十善
~2074是菩薩摩訶薩亦#72.130應自不殺生，亦教人不殺生，讚不殺生法，歡喜讚歎諸不殺生者；乃至自行不邪見，亦教他人不行邪見，讚不邪見法，歡喜讚歎不邪見者。如是，須菩提！菩薩摩訶薩欲成就阿耨多羅三藐三菩提，當如是行。
%61.201 2、十二甘露門#72.131
%61.202 （1）四禪
復次，須菩提！菩薩摩訶薩欲成就阿耨多羅三藐三菩提，應自行初禪，亦教他人行初禪，讚歎行初禪法，歡喜讚歎行初禪者；二禪、三禪、四禪亦如是。
%61.203 （2）四無量心
復次，須菩提！菩薩摩訶薩欲成就阿耨多羅三藐三菩提，應自行慈心，亦教人行慈心，讚歎行慈心法，歡喜讚歎行慈心者；悲、喜、捨心亦如是。
%61.204 （3）四無色定
自行虛空處，亦教人行虛空處，讚歎行虛空處法，歡喜讚歎行虛空處者；識處、無所有處、非有想非無想處亦如是。
%61.205 3、六度、十八空、三十七道品
自具足檀波羅蜜，亦教人具足檀波羅蜜#72.132，讚歎具足檀波羅蜜法，歡喜讚歎具足檀波@t25p568b羅蜜者；尸羅、羼提、毘梨耶、禪、般若波羅蜜亦如是。
復次，菩薩摩訶薩欲成就阿耨多羅三藐三菩提，自行內空，亦教人行內空，讚歎行內空法，歡喜讚歎行內空者；乃至無法有法空亦如是。
自行四念處，亦教人行四念處，讚歎行四念處法，歡喜讚歎行四念處者；乃至八聖道分亦如是。
%61.206 4、出世禪等
自修空三昧、無相、無作三昧，亦教人修空、無相、無作三昧，讚歎修空、無相、無作三昧法，歡喜讚歎修空、無相、無作三昧者。
自行八背捨，亦教人行八背捨，讚歎行八背捨法，歡喜讚歎行八背捨者。
自行九次第定，亦教人行九次第定，讚歎行九次第定法，歡喜讚歎行九次第定者。
%61.207 5、諸佛功德
自具足佛十力，亦教人具足佛十力，讚歎具足佛十力法，歡喜讚歎具足佛十力者；自行四無所畏、四無礙智、十八不共法、大慈大悲，亦教人行四無所畏乃至大慈大悲，讚歎行四無所畏乃至大慈大悲法，歡喜讚歎行四無所畏乃至大慈大悲者。
~2075
%61.208 6、十二因緣觀
自逆順觀十二因緣，亦教人逆順觀十二因緣，讚歎逆順觀十二因緣法，歡喜讚歎逆順觀十二因緣者。
須菩提！菩薩摩訶薩欲成就阿耨多羅三藐三菩提應如是行！
%61.209 7、四諦觀
復次，須菩提！菩薩摩訶薩欲成就阿耨多羅三藐三菩提，自應知苦、斷集、滅證#72.133、修道，亦教人知苦、斷集、滅證、修道，讚歎知苦、斷集、滅證、修道法，歡喜讚歎知苦、斷集、滅證、修道者。
%61.210 8、二乘道果智
自生須陀洹果證智#72.134而不證實際，亦教人著須陀洹果中，讚歎須陀洹果法，歡喜讚歎得須陀洹果者；斯陀含果、@t25p568c阿那含果、阿羅漢果亦如是。
自生辟支佛道證知而不證辟支佛道，亦教人著辟支佛道中，讚歎辟支佛道法，歡喜讚歎得辟支佛道者。#72.135
%61.211 9、大乘道果
自入菩薩位，亦教人入菩薩位，讚歎入菩薩位法，歡喜讚歎入菩薩位者。
自淨佛世界、成就眾生，亦教人淨佛世界、成就眾生，讚歎淨佛世界、成就眾生法，歡喜讚歎淨佛世界、成就眾生者。
自起菩薩神通，亦教人起菩薩神通，讚歎起菩薩神通法，歡喜讚歎起菩薩神通者。
自生#72.136一切種智，亦教人生一切種智，讚歎生一切種智法，歡喜讚歎生一切種智者。
自斷一切結使習，亦教人斷一切結使習，讚歎斷一切結使習法，歡喜讚歎斷一切結使習者。
須菩提！菩薩摩訶薩欲成就阿耨多羅三藐三菩提應如是行！
%61.212 10、壽命成就及成就法住
復次，須菩提！菩薩摩訶薩欲成就阿耨多羅三藐三菩提，
自取壽命成就，亦教人取壽命成就，讚歎取壽命成就法，歡喜讚歎取壽命成就者。#72.137
~2076自成就法住，亦教人成就法住，讚歎成就法住法#72.138，歡喜讚歎成就法住者。#72.139
%61.213 ※ 結成：依般若方便力而行
須菩提！菩薩摩訶薩欲成就阿耨多羅三藐三菩提應如是行，亦應如是學般若波羅蜜方便力！#72.140
%61.214 二、明得無礙果
是菩薩如是學、如是行時，當得無礙色，得無礙受、想、行、識，乃至得無礙法住。#72.141
何以故？是菩薩摩訶薩從本已來，不受色，不受受、想、行、識，乃至不受一切種智。何以故？色不受者為非色，乃至一切種智不受者為非一切種智。」
%61.215 （貳）時會得道
說是菩薩行品時，二千菩薩得無生法忍。
^73.1
#73.2
%62.0 壹、阿鞞跋致菩薩之相貌#73.3
%62.1 （壹）阿鞞跋致菩薩之正體#73.4
%62.2 一、須菩提問
須菩提白佛言：「世尊！以何等行、何等類、何等相#73.5貌知是阿鞞跋致菩薩摩訶薩？」#73.6
%62.3 二、佛述：入諸法如相，如實知諸地，無二無別
佛告須菩提：「若菩薩摩訶薩能知凡夫地、聲聞地、辟支佛地、佛地；是諸地，如相中無二無別，亦不念，亦不分別。入是如中，聞是事，直過無疑。何以故？是如中無一無二相故。#73.7
%62.4 （貳）阿鞞跋致菩薩之行果相#73.8
~2082
%62.5 一、略述行門、轉不轉門
%62.6 （一）行門
%62.7 1、略述
是菩薩摩訶薩亦不作無益語，但說利益相應語，不視他人長短。須菩提！以是行、類、相貌，知是阿鞞跋致菩薩摩訶薩。」#73.9
%62.8 2、重明阿鞞跋致相──觀一切法無行、無類、無相貌
須菩提言：「世尊！復以何等#73.10行、類、相貌知#73.11是阿鞞跋致菩薩摩訶薩？」
佛告須菩提：「若菩薩摩訶薩能觀#73.12一@t25p570b切法無行、無類、無相貌，當知是名阿鞞跋致菩薩摩訶薩。」#73.13
%62.9 （二）轉不轉門
%62.10 1、須菩提問
須菩提白佛言：「世尊！若一切法無行、無類、無相貌，菩薩於#73.14何等法轉名『不轉』？」#73.15
%62.11 2、佛答
佛言：「若菩薩摩訶薩色中轉，受、想、行、識中轉，是名菩薩不轉。
復次，須菩提！菩薩摩訶薩，檀波羅蜜中轉乃至般若波羅蜜中轉，內空中乃至無法有法空中轉，四念處中乃至十八不共法中轉，聲聞、辟支佛地中轉乃至阿耨多羅三藐三菩提中轉，當知是菩薩摩訶薩不轉。
何以故？須菩提！色性無，是菩薩何所住？乃至阿耨多羅三藐三菩提性無，是菩薩何所住？#73.16
~2083
%62.12 二、廣說行門、轉不轉門
%62.13 （一）廣說行門
%62.14 1、明離內過為阿鞞跋致行相#73.17
%62.15 （1）不念外道有實智，不生疑、戒取、邪見等
復次，須菩提！菩薩摩訶薩不觀外道沙門、婆羅門面類言語，不作是念：『是諸外道──若沙門、若婆羅門，實知實見。』若說正見，無有是事！#73.18
復次，菩薩不生疑，不著戒取，不墮邪見，亦不求世俗吉事以為清淨，不以華香、瓔珞、幡蓋、伎樂禮拜供養餘#73.19天。須菩提！以是行、類、相貌，當知是名阿鞞跋致菩薩摩訶薩。#73.20
%62.16 （2）不生下賤家、八難等處
復次，須菩提！阿鞞跋致菩薩摩訶薩常不生下#73.21賤家乃至不生八難之處，常不受女人身。須菩提！以是行、類、相貌，當知是名阿鞞跋致菩薩摩訶薩。
%62.17 （3）具足四行、常行十善道
復次，須菩提！菩薩摩訶薩常行十善道──自不殺生，不教人殺生，讚歎不殺生法，歡喜讚歎不殺生者；乃至自不邪見，不教人邪見，不#73.22讚歎邪見法，不歡喜讚歎行邪見者。須菩提！以是行、類、相貌，當知是名阿鞞跋致菩薩摩訶薩。
%62.18 （4）乃至夢中不行十惡
復次，須菩提！菩薩摩訶薩乃至夢中亦不行十不善道。以是行、類、相貌，當知是名阿鞞跋@t25p570c致菩薩摩訶薩。#73.23
~2084
%62.19 （5）為益眾生行六度
復次，須菩提！菩薩摩訶薩為利益一切眾生故行檀波羅蜜，乃至為利益一切眾生故行般若波羅蜜。須菩提！以是行、類、相貌，當知是名阿鞞跋致菩薩摩訶薩。#73.24
%62.20 （6）為益眾生行法施
復次，須菩提！菩薩摩訶薩所有諸法，受#73.25、讀、誦#73.26、說、正憶念，所謂修姤#73.27路乃至優波提舍。是菩薩法施時，作是念：『是法施因緣故，滿一切眾生願。以是法施功德，與一切眾生共之，迴向阿耨多羅三藐三菩提。』#73.28
須菩提！以是行、類、相貌，當知是名阿鞞跋致菩薩摩訶薩。
%62.21 （7）於甚深法不疑悔
復次，須菩提！菩薩摩訶薩於甚深法中，不疑、不悔。」
須菩提言：「世尊！菩薩於甚深法中何因緣故不疑、不悔？」
佛言：「是阿鞞跋致菩薩都不見有法可生疑處──若色、受、想、行、識乃至阿耨多羅三藐三菩提──不見是#73.29法可生疑處、悔處。
須菩提！以是行、類、相貌，當知是名阿鞞跋致菩薩摩訶薩。#73.30
%62.22 （8）身口意三業柔軟
復次，須菩提！菩薩摩訶薩身、口、意業柔軟#73.31。須菩提！以是行、類、相貌，當知是名阿鞞跋致菩薩摩訶薩。
%62.23 （9）慈身口意三業成就
復次，須菩提！菩薩摩訶薩以慈身、口、意業成就。須菩提！以是行、類、相貌，當知是名阿鞞跋致菩薩摩訶薩。
~2085
%62.24 （10）不與五蓋俱
復次，須菩提！菩薩摩訶薩不與五蓋俱──婬欲、瞋恚、睡眠、掉悔、疑。須菩提！以是行、類、相貌，當知是名阿鞞跋致菩薩摩訶薩。
%62.25 （11）於一切處無所愛著
復次，須菩提！菩薩摩訶薩一切處無所愛著。須菩提！以是行、類、相貌，當知是名阿鞞跋致菩薩摩訶薩。
%62.26 （12）常念一心，舉止安詳
復次，須菩提！菩薩摩訶薩出入去來、坐臥行住常念一心；出入去來、坐臥行住、舉足下足，安隱庠序#73.32，常念一心，視地而行。須菩@t25p571a提！以是行、類、相貌，當知是名阿鞞跋致菩薩摩訶薩。#73.33
%62.27 （13）好樂淨潔，少於疾病
復次，須菩提！菩薩摩訶薩所著#73.34衣服及諸臥具，人不惡穢，好樂淨潔，少於疾病。須菩提！以是行、類、相貌，當知是名阿鞞跋致菩薩摩訶薩。#73.35
%62.28 （14）身無八萬戶虫
復次，須菩提！常人身中有八萬戶虫侵食其身，是阿鞞跋致菩薩摩訶薩身無是虫。何以故？是菩薩功德過出#73.36世間，以是故，是菩薩無是戶虫#73.37。是菩薩功德增益，隨其功德，得身清淨、得心清淨。須菩提！以是行、類、相貌，當知是名阿鞞跋致菩薩摩訶薩。」#73.38
%62.29 （15）身心清淨，過二乘地
須菩提白佛言：「世尊！云何菩薩摩訶薩得身清淨、得心清淨？」
~2086佛言：「菩薩摩訶薩隨其所得，增益善根，滅除心曲、心邪。須菩提！是名菩薩摩訶薩身清淨、心清淨。以是身、心清淨故，能過聲聞、辟支佛地，入菩薩位中。須菩提！以是行、類、相貌，當知是名阿鞞跋致菩薩摩訶薩。#73.39
%62.30 （16）不貴利養，雖修頭陀行而不貴其法
復次，須菩提！菩薩摩訶薩不貴利養，雖行十二頭陀#73.40，不貴阿蘭若法，乃至不貴但三衣法。須菩提！以是行、類、相貌，當知是名阿鞞跋致菩薩摩訶薩。
%62.31 （17）不生煩惱惡心
復次，須菩提！菩薩摩訶薩常不生慳貪心，不生破戒心、瞋動心、懈怠心、散亂心，不生愚癡心，不生嫉妬心。須菩提！以是行、類、相貌，當知是名阿鞞跋致菩薩摩訶薩。#73.41
%62.32 （18）心住不動，智慧深入，所見聞事皆與般若合
復次，須菩提！菩薩摩訶薩心住不動，智慧深入，一心聽受，所從聞法及世間事皆與般若波羅蜜合。是菩薩摩訶薩不見產業之事不入法性者；是事一切皆見與般若波羅蜜合。#73.42以是因緣故，須菩提！是名阿鞞跋致菩薩阿鞞跋致相。#73.43@t25p571b
^73.2
#73.82
%62.82 2、離外惡為阿鞞跋致行相
%62.83 （1）惡魔化作八大地獄，言行善者受地獄記，而菩薩心堅不驚疑
%62.84 A、出魔難事
復次，須菩提！若#73.83惡魔於阿鞞跋致菩薩前化作八大地獄#73.84，一一地獄中，有千萬億菩薩皆被燒煮，受諸辛酸苦毒，語菩薩言：『是諸菩薩皆是阿鞞跋致，佛所授#73.85記，墮大地獄中。汝若為佛授阿鞞跋致記者，當入是大地獄中；佛為授汝地獄記，汝不如#73.86還捨菩薩心，可得不墮地獄，得生天上。』
~2093
%62.85 B、明不退行
須菩提！若是菩薩見是事、聞是事，心不動、不疑、不驚，作是念：『阿鞞@t25p573a跋致菩薩若墮地獄、畜生、餓鬼中，終無是處！』
須菩提！以是行、類、相貌，當知是名阿鞞跋致菩薩摩訶薩。#73.87
%62.86 （2）惡魔勸捨昔所修行願事，菩薩自知不隨他語
%62.87 A、出魔難事：魔化比丘形，勸捨昔所修行願事
復次，須菩提！惡魔化作比丘被服，來至菩薩所，語菩薩言：『汝先聞應如是淨修六波羅蜜乃至應如是修行#73.88得阿耨多羅三藐三菩提，是事汝疾悔捨！汝先於過去、未來、現在諸佛所，從初發心乃至法住，於其中間所作善根，隨喜、迴向阿耨多羅三藐三菩提，是事汝亦疾放捨！若汝疾捨，我當語汝真佛法。汝先所聞，皆非佛法、非佛教，皆是文飾合集作耳！我所說是真佛法。』#73.89
%62.88 B、明有退行：未受記不退，聞說心驚疑
若是菩薩聞作是說心驚、疑、悔，當知是菩薩未得諸佛授記、未定住阿鞞跋致性中。#73.90
%62.89 C、明不退行：菩薩隨順無生，自知不隨他語
%62.90 （A）標宗
若是菩薩心不動、不驚、不疑、不悔，隨順依止無作無生法，不信他語、不隨他行──行六波羅蜜時，不隨他語；乃至行阿耨多羅三藐三菩提時，亦不隨他語。
~2094
%62.91 （B）舉喻
須菩提！譬如漏盡阿羅漢，不信他語、不隨他行，現見諸法實相，惡魔不能轉。#73.91
%62.92 （C）合法
如是，須菩提！阿鞞跋致菩薩摩訶薩亦如是，求聲聞道、辟支佛道人不能破壞、不能折伏其心。須菩提！是菩薩摩訶薩必定住阿鞞跋致地中，不隨他語；乃至佛語不直信取，何況求聲聞、辟支佛人及惡魔、外道梵志語！終無是處！
%62.93 （D）釋因由
何以故？是菩薩不見有法可隨信者，所謂色，若受、想、行、識，若色如乃至識如，乃至不見阿耨多羅三藐三菩提，何況#73.92阿耨多羅三藐三菩提如！
%62.94 （E）結成
須菩提！以是行、類、相貌，當知是名阿鞞跋致菩薩摩訶薩。#73.93
%62.95 （3）惡魔說似道法，菩薩知真道，心不動轉
%62.96 A、惡魔化比丘身說不淨觀等三界繫法令捨行願，而菩薩不為所惑
%62.97 （A）出魔難事
復次，須菩提！惡#73.94魔作比丘身來到菩薩所，語菩薩言：『汝所行者，是@t25p573b生死法，非薩婆若道，汝今身取苦盡證！』是時惡魔為菩薩用世間行說似道法，是#73.95似道法三#73.96界繫#73.97──所謂骨相、若初禪乃至非有想非無想，語善男子：『用是道、用是行，當得須陀洹果，乃至當得阿羅漢果。汝行是道，今世苦盡；汝用受生死中種種苦惱為？今是四大身，尚不用受，何況當更受未#73.98來身！』#73.99
~2095
%62.98 （B）明不退行
須菩提！若是菩薩摩訶薩心不驚、不疑、不悔，作是念：『是比丘益我不少，為我說似道法。行是似道法，不得至須陀洹果證，不得至阿羅漢、辟支佛道證，何況得至阿耨多羅三藐三菩提！』是菩薩摩訶薩益復歡喜，作是念：『是比丘益我不少，為我說障道法。我知是障道法，不障學三乘道。』#73.100
%62.99 B、菩薩知魔說似道法，深信行六度不退，定能得無上菩提
%62.100 （A）魔化無量菩薩久行而不證無上菩提
%62.101 a、出魔難事
是時惡魔知菩薩歡喜，作是言：『善男子！汝欲見是菩薩摩訶薩供養如恒河沙等諸佛衣被、飲食、臥具、醫藥、資生所須；亦於如恒河沙等諸佛所行檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜#73.101；亦親近如恒河沙等諸佛，諮問#73.102菩薩摩訶薩道：「世尊！菩薩摩訶薩云何住菩薩摩訶薩乘？云何行檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜、四念處乃至大慈大悲？」是菩薩摩訶薩如佛所教，如是住、如是行、如是修。是菩薩摩訶薩如是教、如是學，尚不得阿耨多羅三藐三菩提、不得薩婆若，何況汝當得阿耨多羅三藐三菩提！』
%62.102 b、明不退行
若菩薩摩訶薩聞是事，心不異、不驚，益復歡喜，作是念：『是比丘益我不少，為我說障道法；是障道法，不得須陀洹道，乃至不@t25p573c得阿羅漢、辟支佛道，何況得阿耨多羅三藐三菩提！』
%62.103 （B）魔化作多比丘，久行佛道而取證阿羅漢
%62.104 a、出魔難事
是時惡魔知是菩薩心不沒、不驚，即於是處化作多比丘，語菩薩言：『此皆是發意求佛道菩薩，今皆住阿羅漢地；是輩尚不能#73.103得阿耨多羅三藐三菩提，汝云何能得？』
~2096
%62.105 b、明不退行
若菩薩摩訶薩即作是念：『此是惡魔說相似道行#73.104，菩薩摩訶薩行般若波羅蜜，不應轉阿耨多羅三藐三菩提心#73.105，亦不應墮聲聞、辟支佛道中。』復作是念：『行檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜乃至一切種智，不得阿耨多羅三藐三菩提#73.106，無有是處！』
須菩提！以是行、類、相貌，當知是名阿鞞跋致菩薩摩訶薩。#73.107
%62.106 3、能如佛所說心常不離六度，覺知魔事而不隨，是名阿鞞跋致相
復次，須菩提！菩#73.108薩摩訶薩作#73.109是念#73.110：『若菩薩能如佛所說，不遠離般若波羅蜜心乃至一切種智，是菩薩終不退阿耨多羅三藐三菩提。#73.111若菩薩覺知魔事，亦不失阿耨多羅三藐三菩提。』以是行、類、相貌，當知是名阿鞞跋致菩薩摩訶薩相。」#73.112
%62.107 （二）廣說轉不轉門
%62.108 1、須菩提問
須菩提白佛言：「世尊！於何法轉名為不轉？」#73.113
~2097
%62.109 2、佛答
%62.110 （1）正明轉不轉
佛言：「於色相轉，於受想行識相轉，於十二入相、十八界相、婬欲瞋恚愚癡相、邪見相、四念處相乃至聲聞辟支佛相，乃至佛相轉，以是故，名為不退轉菩薩摩訶薩相。何以故？是阿鞞跋致菩薩摩訶薩以是自相空法入菩薩位，得無生法忍#73.114，乃至少許法不可得，不可得故不作，不作故不生，是名無生法忍。菩薩摩訶薩以是行、類、相貌，當知是名阿鞞跋致菩薩摩訶薩。」#73.115
^73.3
#73.140
%62.141 （2）明外惡緣不能壞
%62.142 A、正明
%62.143 （A）出魔難事
復次，須菩提！惡魔到菩薩所，壞其心，作是言：『薩婆若與虛空等#73.141，無所有相；諸法亦與虛空等，空無#73.142有相。虛#73.143空等諸法，空無所有相中，無有得阿耨多羅三藐三菩提者，亦無有不得者。是諸法皆如虛空無所有相，汝唐受勤苦！
汝所聞阿耨多羅三藐三菩提皆是魔事，非佛所說；汝當放捨是願，汝莫長夜受是不安隱、憂苦、墮惡道！』#73.144
%62.144 （B）明不退行
%62.145 a、覺知魔難事，更修自相空莊嚴得一切種智，說法度眾生令得解脫
是諸善男子、善女人聞是呵時，應如是念：『是惡魔事，壞我阿耨多羅三藐三菩提心。諸法雖如虛空，無所有、自相空，而眾生不知、不見、不解；我亦以是#73.145如虛空等無所有、自相空大誓莊嚴得一切種智，為眾生說此法，令得解脫，得須陀洹果、斯陀含果、阿那含果、阿羅漢果、辟支佛道、阿耨多羅三藐三菩提。』#73.146
%62.146 b、以堅固心、不動心、不轉心行六度，得入菩薩位
須菩提！菩薩摩訶薩從初發意已來，聞是#73.147法，應堅固其心，不動、不轉。菩~2102薩摩訶薩以是堅固心、不轉、不動#73.148心行六波羅蜜，當入菩薩位中。」#73.149
%62.147 B、釋轉不轉疑
須菩提白佛言：「世尊！不轉故名阿鞞跋致？轉故亦名阿鞞跋致？」
佛言：「不轉故名阿鞞跋致，轉故亦名阿鞞跋致。」
須菩提白佛言：「世尊！云何不@t25p575a轉故名阿鞞跋致，轉故亦名阿鞞跋致？」
佛告#73.150須菩提：「若菩薩摩訶薩於聲聞地、辟支佛地不轉，是故名不轉。若菩薩摩訶薩於聲聞地、辟支佛地轉，是故亦名不轉。#73.151
須菩提！以是行、類、相貌，當知是名阿鞞跋致菩薩摩訶薩相。以是行、類、相貌故，惡魔不能壞其意，令離阿耨多羅三藐三菩提。
%62.148 （3）明於善法得自在
%62.149 A、於諸禪定、道法行果自在
復次，須菩提！阿鞞跋致菩薩摩訶薩若欲入初禪，第二、第三、第四禪，乃至滅#73.152定禪，即得入。
復次，須菩提！阿鞞跋致菩薩摩訶薩若欲修四念處乃至#73.153八聖道分，空、無相、無作三昧乃至五神通，即能修。
是菩薩雖修四念處乃至五神通，是人不受四念處果；雖修諸禪，不受諸禪果，乃至不受滅定禪果：不證須陀洹果，乃至不證辟支佛道。是菩薩故為眾生受身，隨其所應而利益之。
須菩提！以是行、類、相貌，當知是名阿鞞跋致菩薩摩訶薩。#73.154
~2103
%62.150 B、於諸功德自在
%62.151 （A）心行：觀一切法自相空，不貴諸法
復次，須菩提！是#73.155阿鞞跋致菩薩摩訶薩常憶念阿耨多羅三藐三菩提，終不#73.156離薩婆若心#73.157故，不貴色、不貴相，#73.158不貴聲聞、辟支佛，不貴檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜，不貴四禪、四無量心、四無色定，不貴五神通，不貴四念處乃至八聖道分，不貴佛十力乃至十八不共法，不貴淨佛世#73.159界、不貴成就眾生，不貴見佛，不貴種善根。
何以故？一切法自相空，不見可貴法、能生貴心者。
何以故？是一切法與虛空等，無所有、自相空。#73.160
%62.152 （B）身行：於四威儀中，一心不亂無違失
須菩提！是阿鞞跋致菩薩摩訶薩成就是心，於四種身#73.161儀中，出入來去、坐@t25p575b臥行住，一心不亂。#73.162
%62.153 （C）結
須菩提！以是行、類、相貌，當知是阿鞞跋致菩薩摩訶薩。
%62.154 C、為利益眾生故方便受五欲，而自不生染著
復次，須菩提！阿鞞跋致菩薩摩訶薩若在#73.163居家，以方便力為利益眾生故受五欲；布施眾生，須食與食，須飲與飲，衣服、臥具乃至資生所須盡給與之。
是菩薩自行檀波羅蜜，教人行檀波羅蜜#73.164，讚歎行檀波羅蜜法，歡喜讚歎#73.165行檀波羅蜜者；尸羅波羅蜜乃至般若波羅蜜亦如是。
須菩提！阿鞞跋致菩薩摩訶薩在家時，能以滿閻浮提珍寶施#73.166與眾生，乃至三千大千世界滿中珍寶給施眾生。亦不自為，常修梵行，不凌#73.167易虜掠他人令其憂惱。
~2104須菩提！以是行、類、相貌，當知是名阿鞞跋致菩薩摩訶薩。#73.168
%62.155 D、執金剛神王常隨護
復次，須菩提！阿鞞跋致菩#73.169薩摩訶薩，執金剛神王常隨逐，作是願：『是菩薩摩訶薩當得阿耨多羅三藐三菩提，我常隨逐。』乃至五姓#73.170執金剛神常隨守#73.171護。以是故，若天、若魔、若梵、若餘世間大力者不能破壞是菩薩摩訶薩薩婆若心，乃至得阿耨多羅三藐三菩提。須菩提！是名菩薩摩訶薩阿鞞跋致相。#73.172
%62.156 E、常具足菩薩信等五根
復次，須菩提！菩薩摩訶薩常具足菩薩五根──信根、精進根、念根、定根、慧根，是名阿鞞跋致相。#73.173
%62.157 F、一心行無上佛道
復次，須菩提！阿鞞跋致菩薩摩訶薩為上人，不為下人。」
須菩提白佛言：「世尊！云何為上人？」
佛告須菩提：「若菩薩摩訶薩一心行阿耨多羅三藐三菩提心，不散亂，是名上人。
~2105以是行、類、相貌，當知是名阿鞞跋致相。#73.174
%62.158 G、常念佛道不行邪命
復次，須菩提！阿鞞跋致菩薩一心常念佛道#73.175，不作呪術、合和#73.176諸藥，不呪鬼神令著男女問@t25p575c其吉凶、男女祿相、壽命長短。
何以故？須菩提！是菩薩摩訶薩知諸法自相空，不見諸法相，故#73.177行淨命。
須菩提！以是行、類、相貌，當知是名阿鞞跋致菩薩摩訶薩相。」#73.178
^74.1
 %62.204 （參）重詳阿鞞跋致相
%62.205 一、誡聽
「復次，須菩提！今當更說阿鞞跋致菩薩摩訶薩行、類、相貌，一心諦聽！」
%62.206 二、正說
%62.207 （一）無諸戲論
%62.208 1、不說蘊、處、界事
佛告須菩提：「菩@t25p577b薩摩訶薩行般若波羅蜜，常不離#74.2阿耨多羅三藐三菩提心故，不說五眾事，不說十二入事，不說十八界事。何以故？常念觀五眾空相、十二入、十八界空相故。#74.3
%62.209 2、不說種種世間事
是菩薩摩訶薩不好說官事#74.4，何以故？是菩薩諸法空相中住，不見法若貴、若賤。#74.5
不好說賊事，何以故？諸法自相空故，不見若得、若失。
不好說軍事，何以故？諸法自相空故，不見若多、若少。#74.6
不好說鬪事，何以故？是菩薩摩訶薩住諸法如中，不見法若憎、若愛。
不好說婦女事，何以故？住諸法空中，不見好、醜故。
不好說聚落事，何以故？諸法自相空故，不見法若合、若散。#74.7
不好說城邑事，何以故？住諸法實相#74.8中，不見有勝、有負。#74.9
~2112不好說國事，何以故？住實際中，不見法有所屬、有不屬。#74.10
不好說我事，何以故？法性中住，不見法是我、是無我，乃至不見知者、見者。
如是等，不說種種世間事，但好說般若波羅蜜，#74.11不遠離薩婆若心。#74.12
%62.210 （二）正行六度，不為六蔽
若行檀波羅蜜時，不為慳貪事；行尸#74.13波羅蜜時，不為破戒事；行羼提波羅蜜時，不為瞋諍事；行毘梨耶波羅蜜時，不為懈怠事；行禪波羅蜜時，不為散亂事；行般若波羅蜜時，不為愚癡事。
%62.211 （三）雖行一切法空而樂法，雖行法性亦常讚不壞法，愛樂善知識
是菩薩雖行一切法空，而樂法#74.14、愛#74.15法。
是菩薩雖行法性，常讚不壞法，而愛樂善知識──所謂諸佛及菩薩、聲聞、辟支佛諸能教化令樂住阿耨多羅三藐三菩提者。#74.16
%62.212 （四）為眾生生於欲界，隨願受生於現在有佛處
是人常願欲見諸佛，聞在所處國土中有現在佛，隨願往生。如是心常晝夜行，所謂念佛心。
如是，須菩提！阿鞞跋致菩薩摩訶薩行初禪乃至非有想非無想處，@t25p577c以方便力故起欲界心，若#74.17眾生能行十善道者及現在有佛處在中生。
如是行、類、相貌，當知是為阿鞞跋致菩薩摩訶薩。#74.18
~2113
%62.213 （五）於自所證，心不疑
%62.214 1、法說
復次，須菩提！阿鞞跋致菩薩摩訶薩行般若波羅蜜時，住內空、外空乃至無法有法空，住四念處乃至空、無相、無作解脫門；於自地中了了#74.19，不疑：『我是阿鞞跋致，非阿鞞跋致。』
何以故？乃至不見少許法於阿耨多羅三藐三菩提中若轉、若不轉。#74.20
%62.215 2、法喻合說
%62.216 （1）舉初果喻
須菩提！譬如人得須陀洹果，住須陀洹地中，自了#74.21知，終不疑不悔；阿鞞跋致菩薩摩訶薩亦如是，住阿鞞跋致地中，終不疑。
住是地中，淨佛世界#74.22、成就眾生。種種魔事起，即時覺知；亦不隨魔事，破壞魔事。#74.23
%62.217 （2）舉五逆罪喻
須菩提！譬如有人作五逆罪，五逆罪心乃至死時常逐不捨，雖有異心不能障隔。
須菩提！阿鞞跋致菩薩摩訶薩亦如是，自住其地，心常不動，一切世間天、人、阿修羅不能動轉。#74.24
~2114
%62.218 貳、阿鞞跋致菩薩所行之事
%62.219 （壹）嚴土熟生，親近諸佛請問法要
何以故？是菩薩摩訶薩出一切世間天、人、阿修羅上，入正法位中，自證地中住。
具足諸菩薩神通，能淨佛世界、成就眾生；從一佛界至一佛界，於十方佛所，殖#74.25諸善根，親近、諮問諸佛。#74.26
%62.220 （貳）諸魔事起，覺而不隨
是菩薩如是住，種種魔事起，覺而不隨；以方便力處魔事著實際中；自證地中，不疑、不悔。何以故？實際中無疑相故，知是實際非一非二。#74.27
%62.221 （參）即使轉受生，終不向二乘地
以是因緣故，是人乃至轉身終不向聲聞、辟支佛地。
是菩薩摩訶薩諸法自相空中不見法若生若滅、若垢若淨。
須菩提！是菩薩摩訶薩乃至轉身亦不疑：『我當得阿耨多羅三藐三菩提？若不得？』
何以故？@t25p578a須菩提！諸法自相空即是阿耨多羅三藐三菩提。#74.28
%62.222 （肆）成就不動慧，世無能壞
%62.223 一、正說
須菩提！是菩薩摩訶薩住自證地中，不隨他語，無能壞者。何以故？是阿鞞跋致菩薩摩訶薩成就不動智慧故。#74.29
須菩提！以是行、類、相貌，當知是名#74.30阿鞞跋致菩薩摩訶薩。
%62.224 二、舉證
%62.225 （一）魔勸取證阿羅漢，不為所擾
復次，須菩提！是菩薩摩訶薩若惡魔作佛身來，語菩薩言：『汝今於是間#74.31取阿羅漢~2115道。汝亦無阿耨多羅三藐三菩提記，汝亦未得無生法忍#74.32，汝亦無是阿鞞跋致行、類、相貌，亦無是相得受阿耨多羅三藐三菩提記。』
須菩提！若菩薩摩訶薩聞是語，心不異、不沒、不驚#74.33、不畏；是菩薩#74.34應自知：『我必從諸佛受阿耨多羅三藐三菩提記。何以故？諸菩薩以是法受#74.35記，我亦有是法得受記。』
%62.226 （二）魔化佛身授二乘記，不為所擾
須菩提！若惡魔、若為魔所使作佛形像來，與菩薩受#74.36聲聞、辟支佛記。
須菩提！是菩薩作是念：『是惡魔、若為#74.37魔所使作佛形像來語#74.38。佛不應教菩薩遠離阿耨多羅三藐三菩提，教住聲聞、辟支佛道。』
須菩提！以是行、類、相貌，當知是名阿鞞跋致相。
%62.227 （三）魔謗所學非佛說，不為所擾
復次，須菩提！惡魔作#74.39佛身來到菩薩所，作是言：『汝所學經書非佛所說、亦非聲聞#74.40說，是魔所說。』
須菩提！是菩薩摩訶薩當作是知：『是惡魔、若魔所使，教我遠離阿耨多羅三藐三菩提。』須菩提！當知是菩薩已為過去佛所受記，住阿鞞跋致地。
何以故？諸菩薩所有阿鞞跋致行、類、相貌，是菩薩亦有是行、類、相貌，是名阿鞞跋致菩薩相。#74.41
%62.228 （伍）護持佛法，不惜身命
復次，須菩提！阿鞞跋致菩薩摩訶薩行般若波羅蜜時，為護持諸#74.42法故，不惜身命，何況餘@t25p578b物！
是菩薩護持法故，作是念：『我不為護持一佛法故#74.43，我為護持三世十方諸佛法故。』#74.44
~2116須菩提！云何菩薩摩訶薩護持佛#74.45法故不惜身命？
須菩提！如佛說：『一切諸法真空。』是時，有愚癡人破壞、不受，作是言：『是非法，非善，非世尊教！』須菩提！菩薩護持如是法故，不惜身命。#74.46
菩薩亦應作是念：『未來世諸佛，我亦在是數中，在中受記，是法亦是我法，以是故不惜身命。』
 須菩提！菩薩見是利益故，護持是#74.47法，不惜身命。
 須菩提！以是行、類、相貌，知是阿鞞跋致相。#74.48
%62.229 （陸）得陀羅尼，聞法不失
復次，須菩提！阿鞞跋致菩薩摩訶薩聞佛說法，不疑、不悔，聞已受持，終不忘失。何以故？得陀羅尼故。」
須菩提言：「世尊！得何等陀羅尼，聞佛所說諸經而不忘失？」
佛告須菩提：「菩薩得聞持等陀羅尼故，聞#74.49佛說諸經，不忘、不失，不疑、不悔。」#74.50
~2117須菩提白佛言：「世尊！但聞佛說法不忘、不失，不疑、不悔；聲#74.51聞、辟支佛說，天、龍、鬼神、阿修羅、緊那羅、摩睺羅伽說，亦復不忘、不失，不疑、不悔耶？」
 佛告須菩提：「所有言說眾事，得陀羅尼菩薩皆不忘、不失，不疑、不悔。
 須菩提！如是行、類、相貌成就故，當知是阿鞞跋致菩薩摩訶薩。」#74.52
^74.2
%63.0 壹、不退轉菩薩自行功德無邊
%63.1 （壹）明因行
%63.2 一、正歎菩薩
%63.3 （一）舉無邊智慧義
%63.4 1、須菩提歎
須菩提白佛言：「世尊！是阿鞞跋致菩薩摩訶薩大功德成就！世尊！是#74.112阿鞞跋致菩薩摩訶薩無量功德成就、無邊功德成就！」
%63.5 2、佛述成，更顯大功德因緣
佛告須菩提：「如是！如是！是阿鞞跋致菩薩摩訶薩大功德成就！是阿鞞跋致菩薩摩訶薩無量、無邊功德成就！何以故？是#74.113菩薩摩訶薩得無量無邊智慧，不與一切聲聞、辟支佛共故。
阿鞞跋致菩薩住是智慧中，生四無礙智；得是#74.114無礙智故，一切世間天及人無能窮盡。」
%63.6 3、須菩提讚佛善說不退轉相
須菩提白佛言：「世尊！佛能以如恒河沙等劫歎說阿鞞跋致菩薩摩訶薩行、類、相貌。」
%63.7 （二）舉深奧義
%63.8 1、正明
%63.9 （1）約「空、涅槃」等明深奧義
%63.10 A、須菩提問
須菩提言：「世尊！何等是#74.115深奧處，阿鞞跋致菩薩摩訶薩住是中行六波羅蜜時，具足四念處，乃至具足一切種智？」#74.116
~2126
%63.11 B、佛答
佛讚須菩提#74.117：「善哉！善哉！須菩提！汝能#74.118為阿鞞跋致菩薩摩訶薩問是深奧處。
須菩提！深奧處者，空是其義，無相、無作、無起、無生、無染、離、寂滅、如、法性、實際、涅槃。須菩提！如是等法，是為深奧義。」#74.119
%63.12 （2）約「正觀一切法如」明深奧義
%63.13 A、正觀諸法如深奧故一切法深奧
須菩提白佛言：「世尊！但空乃至涅槃是深奧，非一切法深奧耶？」
佛言：「一切法亦是深奧義。須菩提！色亦深奧，受、想、行、識亦深奧；眼亦深奧乃至意，色乃至法，眼界乃至意識界，檀波羅蜜乃至般若波羅蜜，四念處乃至阿耨多羅三藐三菩提亦深奧。」
「世尊！云何色深奧乃至阿耨多羅三藐三菩提亦深奧？」
佛言：「色如深奧故#74.120，色深奧；受、想、行、識如──乃至阿耨多羅三藐三菩提如深奧故，阿耨多羅三@t25p580c藐三菩提深奧。」
%63.14 B、釋因由：如不即不離一切法故
「世尊！云何色如深奧乃至阿耨多羅三藐三菩提如深奧？」
「須菩提！是色如，非是色、非離色；乃至識如，非是識、非離識；乃至阿耨多羅三藐三菩提如，非是阿耨多羅三藐三菩提、非離阿耨多羅三藐三菩提。」#74.121
~2127
%63.15 2、顯益
%63.16 （1）須菩提歎佛微妙方便力
須菩提白佛言：「希有！世尊微妙方便力故，令阿鞞跋致菩薩離色處涅槃，亦令離受、想、行、識處涅槃；亦令離一切法──若世間若出世間、若有諍若無諍、若有漏若無漏法處涅槃#74.122。」#74.123
%63.17 （2）佛述成，明菩薩行與般若相應，得無量福德
%63.18 A、佛述成，顯相應般若行，功德廣無邊
佛言：「如是！如是！須菩提！佛以微妙方便力故，令阿鞞跋致菩薩離色處涅槃，乃至離有漏、無漏法處涅槃。
須菩提！若菩薩摩訶薩如是甚深法與般若波羅蜜相應，觀察、籌量、思惟，作是念：『我應如是行，如般若波羅蜜中教；我應如是學，如般若波羅蜜中說。』
須菩提！若是菩薩摩訶薩能如說行、如說學、如般若波羅蜜中觀，具足勤精進，一念生時，當得無量無邊阿僧祇福德，是菩薩摩訶薩超越無量劫，近阿耨多羅三藐三菩提；何況常行般若波羅蜜，應#74.124阿耨多羅三藐三菩提念！#74.125
%63.19 B、舉喻
須菩提！譬如多婬欲人與端正淨潔女人共期；此女人限礙，不得時往。於須菩提意云何？是人所念為在何處？」#74.126
「世尊！是人念念常在彼女人所，恒作是念，憶想當來與共坐臥歡樂。」
「須菩提！是人一日一夜為有幾念生？」
須菩提言：「世尊！是人一日一夜其念甚多！」
%63.20 C、結成
佛告須菩提：「菩薩摩訶薩念般若波羅蜜，如般若波羅蜜中說行是道，一念頃超越劫數，亦如彼人一日一夜心念之數。是菩薩摩訶薩@t25p581a行般若波羅蜜，遠離眾罪──所謂離阿耨多羅三藐三菩提罪。#74.127
~2128
%63.21 二、校德顯勝
%63.22 （一）「行般若一日所得善根功德」勝「滿恆沙三千世界之餘德」
是菩薩摩訶薩行般若波羅蜜，一日所得善根功德，假令滿如恒河沙等三千大千世界中餘#74.128功德，猶亦不減；於餘殘功德，百分不及一分，千分千億萬分，乃至算數譬喻所不能及。#74.129
^74.3
%63.65 （二）「深般若中一日如說修行所得福德」勝「離般若供養三寶、聖眾」
%63.66 1、離般若供養三寶
復次，須菩提！若菩薩摩訶薩遠離般若波羅蜜，如恒河沙等劫布施三寶──佛寶、法寶、比丘僧寶。須菩提！於#74.160意云何？是菩薩摩訶薩以是因緣故，得福多不？」
須菩提言：「世尊！甚多！無量無邊阿僧祇。」
佛告須菩提：「不如菩薩摩訶薩深般若波羅蜜中一日如說修行得福多。何以故？般若波羅蜜是諸菩薩摩訶薩道，乘是道，疾得阿耨多羅三藐三菩提。
%63.67 2、離般若供養眾聖
須菩提！若菩薩遠離般若波羅蜜，如恒河沙劫供養須陀洹、斯陀含、阿那含、阿羅漢、辟支佛及諸佛。須菩@t25p582b提！於意云何？是菩薩摩訶薩以是因緣故，得福多不？」
須菩提言：「世尊！甚多！」
佛言：「不如是菩薩摩訶薩深般若波羅蜜如說修行一日得福多。何以故？菩薩摩訶薩行是般若波羅蜜，過一切聲聞、辟支佛地，入菩薩位，漸漸得阿耨多羅三藐三菩提。
%63.68 （三）「一日如所說住般若中行布施等六法所得福德」勝「離般若行布施等六法
須菩提！菩薩摩訶薩遠離般若波羅蜜，如恒河沙劫，行#74.161布施、持戒、忍辱、精進、禪定、智慧。於意云何？是人以是因緣故，得福多不？」
須菩提言：「世尊！甚多！」
~2134佛言：「不如是菩薩摩訶薩行般若波羅蜜如說修行，一日布施、持戒、忍辱、精進、禪定、智慧得福多。何以故？須菩提！般若波羅蜜是菩薩摩訶薩母故，是般若波羅蜜能生諸菩薩摩訶薩。諸菩薩摩訶薩住般若波羅蜜中，能具足一切佛法。
%63.69 （四）「一日住般若中行法施所得福德」勝「離般若行法施」
須菩提！若菩薩摩訶薩遠離般若波羅蜜，如恒河沙劫壽行法施。須菩提！於汝意云何？是人得福多不？」
須菩提言：「甚多！世尊！」
佛言：「不如是善男子、善女人深般若波羅蜜如說修行乃至一日法施得福多。何以故？須菩提！是菩薩摩訶薩不遠離般若波羅蜜，則不遠離一切種智；不遠離一切種智，則不遠離般若波羅蜜。以是故，須菩提！菩薩摩訶薩欲得阿耨多羅三藐三菩提，不當遠離般若波羅蜜。
%63.70 （五）「一日如所說住般若中行三乘道法所得福德」勝「離般若行三乘道法」
須菩提！若菩薩摩訶薩如恒河沙劫遠離般若波羅蜜，修行四念處乃至八聖道分、內空乃至一切種智。須菩提！於汝意云何？是善男子、善女人得福多不？」
須菩提言：「世尊！甚多！」
佛言：「不如是善男子、善女人深般若波羅蜜如說一日修行四念處乃至一切種智@t25p582c得福多。
何以故？須菩提！若菩薩摩訶薩不遠離般若波羅蜜，於薩婆若轉者，無有是處！
須菩提！若菩薩摩訶薩遠離般若波羅蜜，於薩婆若轉，則有是處。
須菩提！以是故，菩薩摩訶薩常不應遠離般若波羅蜜行。#74.162
%63.71 （六）「一日相應般若行施定福德迴向所得福德」勝「離般若行施定福德迴向」
須菩提！若菩薩摩訶薩遠離般若波羅蜜，如恒河沙劫壽財施、法施及禪定福德，迴向阿耨多羅三藐三菩提。於汝意云何？是人得福多不？」
須菩提言：「世尊！甚多！甚多！」
佛言：「不如是善男子、善女人深般若波羅蜜如說修行乃至一日財施、法施、禪定福德，迴向阿耨多羅三藐三菩提得福多。何以故？是第一迴向，所謂般若波羅蜜迴向。
若遠離般若波羅蜜迴向，是不名迴向。#74.163
須菩提！以是故，菩薩摩訶薩欲得阿耨多羅三藐三菩提，應方便學般若波羅蜜迴向。
%63.72 （七）「一日相應般若隨喜迴向所得福德」勝「離般若行隨喜迴向」
須菩提！若善男子、善女人遠離般若波羅蜜，如恒河沙劫壽過去、未來、現在諸佛及弟子善根和合，隨喜迴向阿耨多羅三藐三菩提。須菩提！於汝意云何？是人得福多不？」
~2135須菩提言：「世尊！甚多！」
佛言：「不如是善男子、善女人深般若波羅蜜如說修行乃至一日隨喜善根迴向阿#74.164耨多羅三藐三菩提得福多。須菩提！以是故，菩薩摩訶薩欲得阿耨多羅三藐三菩提，應學般若波羅蜜中方便迴向阿耨多羅三藐三菩提。」
%63.73 三、釋成福德殊勝義
%63.74 （一）須菩提問
須菩提白佛言：「世尊！如佛所說：『因緣起法從妄想生，非實。』云何善男子、善女人得大福德？世尊！用是因緣起法，不應得正見、入法位，不應得須陀洹果，乃至不應得阿耨多羅三藐三菩提果。」#74.165
%63.75 （二）佛答
%63.76 1、佛印可，有為虛誑，心不著福德
佛@t25p583a告須菩提：「如是！如是！須菩提！用是因緣起法，不應得正見、入法位，乃至不應得阿耨多羅三藐三菩提。
%63.77 2、善學十八空，憐愍眾生故，不離般若而修集福德
須菩提！行般若波羅蜜菩薩摩訶薩，知因緣起法亦空#74.166、無堅固、虛誑不實。
何以故？須菩提！是菩薩摩訶薩善學內空乃至善學無法有法空故。
是菩薩摩訶薩住是十八空，種種觀作法空，即不遠離般若波羅蜜。#74.167
%63.78 3、常不離般若，漸得無數、無量、無邊福德
%63.79 （1）正說
若菩薩摩訶薩如是漸漸不#74.168離般若波羅蜜，漸漸得無數、無量、無邊福德。」#74.169
%63.80 （2）釋「無數、無量、無邊」
須菩提白佛言：「世尊！無數、無量、無邊，有何等異？」
「須菩提！無數者，名不墮數中──若有為性中、若無為性中。無量者，量不可得──若過去、若未來、若現在。無邊者，諸法邊不可得。」#74.170
~2136
%63.81 四、佛以方便力種種異名說諸法實相
%63.82 （一）五蘊空故無數、無量、無邊
須菩提言：「世尊！頗有色亦無數、無量、無邊？頗有受、想、行、識亦無數、無量、無邊？」
「須菩提！有因緣，色亦無數、無量、無邊，受、想、行、識亦無數、無量、無邊。」
「世尊！何等因緣故，色亦無數、無量、無邊，受、想、行、識亦無數、無量、無邊？」
佛告須菩提：「色空故，無數、無量、無邊；受、想、行、識空故，無數、無量、無邊。」#74.171
%63.83 （二）一切法皆空
%63.84 1、正明一切法空
「世尊！但色空、受想行識空，非一切法空耶？」
「須菩提！我不說一切法空耶？」
須菩提言：「世尊說一切法空。#74.172
%63.85 2、辨空之異名
%63.86 （1）須菩提說
世尊！諸法空，即是不可盡、無有數、無量、無邊。
世尊！空中數不可得、量不可得、邊不可得。以是故，世尊！是不可盡、無數、無量、無邊義，無有異。」#74.173
%63.87 （2）佛言：空不可說，而佛以方便力種種異名說
佛告須菩提：「如是！如是！是法義無別異。須菩提！是法不可說，佛以方便力故分別說──所謂不可盡、無數、無量、無邊、無著、空、無想#74.174、無作、無起、無生、無滅、無染、涅槃。佛種種因緣，以方便力說。」#74.175
~2137
%63.88 （貳）明得菩提果
%63.89 一、就不增不減義明得菩提果
%63.90 （一）一切法空不可說，即是不增不減義
須菩提白佛言@t25p583b：「希有！世尊！諸法實相不可說，而佛以方便力說。世尊！如我解佛所說義，一切法亦不可說。」
佛言：「如是！如是！須菩提！一切法不可說。一切法不可說相即是空，是空不可說。」#74.176
「世尊！不可說義有增有減不？」
佛言：「不也！須菩提！不可說義無增無減。」
%63.91 （二）法雖無增減，而菩薩以方便力能得無上菩提
%63.92 1、須菩提難
「世尊！若不可說義無增無減，檀波羅蜜亦當無增無減，乃至般若波羅蜜亦當無增無減；四念處乃至八聖道分亦當無增無減；四禪、四無量心、四無色定、五神通、八背捨、八勝處、九次第定、佛十力、四無所畏、四無礙智、十八不共法亦當無增無減。世尊！若菩薩摩訶薩六波羅蜜不增乃至十八不共法不增者，云何菩薩摩訶薩得阿耨多羅三藐三菩提？」
%63.93 2、佛答
%63.94 （1）佛印可
佛言：「如是！如是！須菩提！不可說義無增無減。
%63.95 （2）闡義
%63.96 A、不取法相行六度，如無上道正迴向
菩薩摩訶薩習行般若波羅蜜，有方便力故，不作是念：『我增般若波羅蜜乃至增檀波羅蜜。』當作是念：『但名字故，名檀波羅蜜。』
是菩薩摩訶薩行檀波羅蜜時，是心及善根，如阿耨多羅三藐三菩提相迴向；乃至行般若波羅蜜時，是心及善根，如阿耨多羅三藐三菩提相迴向。」#74.177
~2138
%63.97 B、不離般若，常觀諸法如無增無減得無上菩提
須菩提白佛言：「世尊！何等是阿耨多羅三藐三菩提？」
佛言：「一切#74.178法如相是名阿耨多羅三藐三菩提。」#74.179
須菩提白佛言：「世尊！何等是一切法如相是阿耨多羅三藐三菩提？」
佛告須菩提：「色如相，受、想、行、識如相，乃至涅槃如相，是阿耨多羅三藐三菩提。
是如相亦不增不減。
須菩提！是菩薩摩訶薩不離般若波羅蜜，常觀是如法，不見有增有減。以是因緣故，須菩提！@t25p583c不可說義無增無減，檀波羅蜜亦不增不減，乃至十八不共法亦不增不減。
須菩提！菩薩摩訶薩以是不增不減法故，應般若波羅蜜行。」#74.180
^75.1
#75.2
$$壹、不退轉菩薩自行功德無邊（承上卷74）
$$（壹）明因行（承上卷74）
$$（貳）明得菩提果（承上卷74）
$$一、就不增不減義明得菩提果（承上卷74）
%63.137 二、就不即不離諸法明得菩提果
%63.138 （一）須菩提難
%63.139 1、正難
須菩提白佛言：「世尊！菩薩摩訶薩用初心得阿耨多羅三藐三菩提？用後心得阿耨多羅三藐三菩提？#75.3
%63.140 2、明因由
世尊！是初心不至#75.4後心，後心不在初心。世尊！如是心心數法不俱，云何善根增益？若善根不增#75.5，云何當得阿耨多羅三藐三菩提？」#75.6
%63.141 （二）佛答
%63.142 1、正答：非即初心後心，非離初心後心而得
%63.143 （1）舉燋焰喻釋
佛告須菩提：「我當為汝說譬喻，智者得譬喻，則於義易解。須菩提！譬如燃燈，為用初焰燋#75.7炷#75.8？為用後焰燋炷？」
~2144須菩提言：「世尊！非初焰燋炷，亦非離初焰。世尊！非後焰燋炷，亦非#75.9離後焰。」
「須菩提！於汝意云何？炷為燋不？」
「世尊！炷實燋。」
%63.144 （2）合法釋
佛告須菩提：「菩薩摩訶薩亦#75.10如是，不用初心得阿耨多羅三藐三菩提，亦不離初心得阿耨多羅三藐三菩提；不用後心得阿耨多羅三藐三菩提，亦不離後心得阿耨多羅三藐三菩提──而得阿耨多羅三藐三菩提。#75.11
%63.145 2、更說：初心乃至十地因緣具足而得菩提
%63.146 （1）略標
須菩提！是中菩薩摩訶薩從初發意行般若波羅蜜，@t25p585a具足十地，得阿耨多羅三藐三菩提。」
%63.147 （2）明具足十地得
須菩提白佛言：「世尊！何等是十地，菩薩具足已，得阿耨多羅三藐三菩提？」
佛言：「菩薩摩訶薩具足乾慧地、性地、八人地、見地、薄地、離欲地、已作地、辟支佛地、菩薩地、佛地──具足是#75.12地，得阿耨多羅三藐三菩提。#75.13
%63.148 （3）結：非即初心後心，非離初心後心而得菩提
須菩提！菩薩摩訶薩學是十地已，非初心得阿耨多羅三藐三菩提，亦不離初心得阿耨多羅三藐三菩提；非後心得阿耨多羅三藐三菩提，亦非離後心得阿耨多羅三藐三菩提──而得阿耨多羅三藐三菩提。」
%63.149 （參）明離二邊中道行
%63.150 一、釋聲聞人生滅疑
%63.151 （一）須菩提歎緣起甚深而生疑
須菩提言：「世尊！是因緣法甚深，所謂非初心、非離初心，非後心、非離後心得阿~2145耨多羅三藐三菩提，而得阿耨多羅三藐三菩提。」#75.14
%63.152 （二）佛反問答釋
%63.153 1、釋生滅疑
%63.154 （1）心滅不更生
佛告須菩提：「於汝意云何？若心滅已，是心更生不？」#75.15
「不也！世尊！」
%63.155 （2）心生是滅相
「須菩提！於汝意云何？心生，是滅相不？」
「世尊！是滅相。」#75.16
%63.156 （3）心滅相非滅
「須菩提！於汝意云何？以#75.17心滅相，是#75.18滅不？」#75.19
「不也！世尊！」
%63.157 2、釋住疑
%63.158 （1）心如如住
佛告須菩提：「於汝意云何？亦如是住不？」
須菩提言：「世尊！亦如是住，如『如』住。」#75.20
%63.159 （2）不證實際
佛告須菩提：「於汝意云何？若是心如『如』住，當作#75.21實際不？」#75.22
「不也！世尊！」
%63.160 3、歎如甚深
~2146佛告須菩提：「於汝意云何？是『如』#75.23深不？」
「世尊！甚深#75.24！」#75.25
%63.161 4、釋「心」、「如」不即不離#75.26
%63.162 （1）即「如」不是心
「須菩提！於汝意云何？但『如』是心不？」#75.27
「不也！世尊！」
%63.163 （2）離「如」無有心
「離『如』是心不？」#75.28
「不也！世尊！」
%63.164 5、釋「如」無分別
「須菩提！於汝意云何？『如』見『如』不？」#75.29
「不也！世尊！」
%63.165 6、結：能如是行，為行深般若
「須菩提！於汝意云何？若菩薩能如是行，為行深般若波羅蜜不？」
須菩提言：「世尊！若菩薩摩訶薩能如是行，為行深般若波羅蜜。」
%63.166 二、破始行菩薩有見無見執
%63.167 （一）正明
%63.168 1、住如中行，實無所行──破有見
「須菩提！於汝意云何？菩薩摩訶薩如是行，是何處行？」
須菩提言：「世尊！若菩薩摩訶薩如是行，為無處所行。@t25p585b何以故？若菩薩摩訶薩行般若波羅蜜，住諸法如中，無如是念、無念處、無念者。」#75.30
%63.169 2、能行般若，勝義中行──破無見
~2147佛告須菩提：「若菩薩摩訶薩如是行，為何處行？」
須菩提言：「世尊！是菩薩摩訶薩如是行，為第一義中行，二行#75.31不可得故。」#75.32
%63.170 （二）責破
%63.171 1、破有見
「須菩提！於汝意云何？若菩薩第一義無念中行，為行相不？」#75.33
「不也！世尊！」
%63.172 2、破無見
佛告須菩提#75.34：「於汝意云何？是菩薩摩訶薩壞相不？」#75.35
「不也！世尊！」
佛告須菩提：「云何名不壞相？」
須菩提言：「世尊！是菩薩摩訶薩行般若波羅蜜，不作是念：『我當壞諸法相。』#75.36
%63.173 （三）結中道行：以自相空方便不著有無
世尊！菩薩摩訶薩行般若波羅蜜，未具足佛十力、四無所畏、四無礙智、大慈大悲、十八不共法，不得阿耨多羅三藐三菩提。
世尊！菩薩摩訶薩以方便力故，於諸法亦不取相，亦不壞相。何以故？世尊！是菩薩摩訶薩知一切諸法自相空故。#75.37
%63.174 貳、明化他功德無邊
%63.175 （壹）菩薩住自相空為成就眾生故入三三昧
~2148菩薩摩訶薩住是自相空中，為眾生故入三三昧，#75.38用三三昧成就眾生。」#75.39
%63.176 （貳）須菩提問
須菩提言：「世尊！云何菩薩摩訶薩入三三昧成就眾生？」
%63.177 （參）佛答
佛言：「菩薩住是三三昧，
%63.178 一、無作三昧
見眾生作法中行──菩薩以方便力故#75.40，教令得無作；#75.41
%63.179 二、空三昧
見眾生我相中行──以方便力故，教令行空；#75.42
%63.180 三、無相三昧
見眾生一切相中行──以方便力故，教令行無相。#75.43
%63.181 四、結
如是，須菩提！菩薩摩訶薩行般若波羅蜜，入三三昧，以三三昧成就眾生。」
^75.2
%64.0 壹、論夢中起行義
%64.1 （壹）論夢中行三三昧有益、無益
%64.2 一、舍利弗問
爾時，舍利弗#75.96問須菩提：「若菩薩摩訶薩夢中入三三昧──空、無相、無作三昧，寧有益於般若波羅蜜不？」
%64.3 二、須菩提以般若正觀離二邊義答
須菩提報#75.97舍利弗：「若菩薩晝日入三三昧有益於般若波羅蜜，夜夢中亦當有益。何以故？晝、夜夢中等無異故#75.98。舍利弗！若菩薩摩訶薩晝日行般若波羅蜜有益，是菩薩夢中行般若波羅蜜亦應有益。」#75.99
%64.4 （貳）論夢中業集不集成
%64.5 一、破如夢難
%64.6 （一）舍利弗難
%64.7 1、正難
舍利弗問須菩提：「菩薩摩訶薩若夢中所作@t25p587c業#75.100，是#75.101業有集成不？
~2159
%64.8 2、釋難
如佛說：『一切法如夢。』以是故不應集成。何以故？夢中無有法集成。若覺時憶想#75.102分別，應有集成！」#75.103
%64.9 （二）須菩提反詰
須菩提語舍利弗：「若人夢中殺眾生，覺已憶念，取相分別：『我殺是快耶？』舍利弗！是事云何？」#75.104
%64.10 （三）舍利弗答
舍利弗#75.105言：「無緣業不生，無緣思不生；有緣業生，有緣思生。」#75.106
%64.11 （四）須菩提述成明理
%64.12 1、印成
「舍利弗！如是！如是！#75.107無緣業不生，無緣思不生；有緣業生，有緣思生。
%64.13 2、述義：由具四緣故夢中業成
於見聞覺知法中心生，不從不見聞覺知法中心生，是中心有淨有垢。#75.108以是故，舍利弗！有緣故業生，不從無緣生；有緣故#75.109思生，不從無緣生。」#75.110
~2160
%64.14 二、破空義難
%64.15 （一）舍利弗難
舍利弗語須菩提：「如佛說：『一切諸業、諸思自相離#75.111。』云何言『有緣故業生，無緣不生；有緣故思生，無緣不#75.112生』？」#75.113
%64.16 （二）須菩提答
須菩提語舍利弗：「取相故，有緣業生#75.114，不從無緣生；取相故，有緣思生，不從無緣生。」#75.115
%64.17 （參）論夢中成不成迴向
%64.18 一、舍利弗難
舍利弗語須菩提：「若菩薩摩訶薩夢中布施、持戒#75.116、忍辱、精進、禪定、修智慧，是善根福德迴向阿耨多羅三藐三菩提，是實迴向不？」
%64.19 二、須菩提仰推應問彌勒
須菩提語舍利弗：「彌勒菩薩今現在#75.117前，佛授不退轉記，當作佛；當問彌勒，彌勒當答。」
%64.20 三、舍利弗請彌勒答
舍利弗白彌勒菩薩：「須菩提言：『彌勒菩薩今現在#75.118前，佛受#75.119不退轉記，當作佛；~2161彌勒當答！』」
%64.21 四、彌勒答：諸法性空無別，不見有法可答
彌勒菩薩語舍利弗：「當以彌勒名答耶？若色、受、想、行、識答耶？若色空答耶？若受、想、行、識空答#75.120？是色不能答，受、想、行、識不能答；色空不能答，受、想、行、識空不能答。我不見是法可答，不見#75.121能答者；我不見是人授#75.122記，亦不見法可授記者，亦不見授記處。是一切法皆無二無別。」#75.123
%64.22 （肆）論所證甚深
%64.23 一、所證亦空無所得
%64.24 （一）舍利弗問
舍利弗語彌勒菩薩：「如仁者#75.124所@t25p588a說#75.125，如是為得法作證不？」#75.126
%64.25 （二）彌勒答
彌勒答舍利弗：「如我所說法，如是不證#75.127。」#75.128
~2162
%64.26 二、舍利弗心歎彌勒智深
爾時，舍利弗作是念：「彌勒菩薩智慧甚深，久行#75.129檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜，用無所得故，能如是說。」
%64.27 三、佛反責，示雖不見所證法而不生疑
%64.28 （一）佛反責
爾時，佛告舍利弗：「於汝意云何？汝用是法得阿羅漢，見是法不？」#75.130
%64.29 （二）舍利弗答
舍利弗言：「不見也。」
%64.30 （三）佛結義
「舍利弗！菩薩摩訶薩行般若波羅蜜亦如是，不作是念：『是法當得授記，是法已授記，是法當得阿耨多羅三藐三菩提。』如是，舍利弗！菩薩摩訶薩行般若波羅蜜，不疑我若得、若不得，自知實得阿耨多羅三藐三菩提。」#75.131
^75.3
%64.65 貳、為眾生起淨佛土願
%64.66 （壹）別行六度之願
%64.67 一、布施願
佛告須菩提#75.157：「有菩薩摩訶薩行檀波羅蜜時，若見眾生飢寒凍餓、衣服弊壞，菩薩當作@t25p589a是願：『我隨爾所時行檀波羅蜜，我得阿耨多羅三藐三菩提時，令我國土眾生無如是事。衣服、飲食、資生之具，當如四天王天、三十三天、夜摩天、兜率陀天、化樂天、他化自在天。』須菩提！菩薩摩訶薩作如是行，能具足檀波羅蜜、近阿耨多羅三藐三菩提。
%64.68 二、持戒願
復次，須菩提！菩薩摩訶薩行尸羅波羅蜜時，見眾生殺生乃至邪見，短壽、多病、顏色不好、無有威德、貧乏財物、生下賤家、形殘醜陋，當作是願：『我隨爾所時#75.158行尸羅波羅蜜，如我得佛時，令我國土眾生無如是事。』須菩提！菩薩摩訶薩作如是行，能具足尸羅波羅蜜、近阿耨多羅三藐三菩提。
%64.69 三、忍辱願
復次，須菩提！菩薩摩訶薩行羼提波羅蜜時，見諸眾生互相瞋恚罵詈、刀杖瓦石共相殘害奪命，當作是願：『我隨爾所時行羼提波羅蜜，我作佛時#75.159，令我國土眾生無如是事。相視如父、如母、如兄、如弟、如姊、如妹、如善知識，皆行慈悲。』須菩提！菩薩摩訶薩作如是行，能具足羼提波羅蜜、近阿耨多羅三藐三菩提。
%64.70 四、精進願
復次，須菩提！菩薩摩訶薩行毘梨耶波羅蜜時，見眾生懈怠、不勤精進#75.160、棄捨三乘──聲聞、辟支佛、佛乘，當作是願：『我隨爾所時行毘梨耶波羅蜜，如我得阿耨多~2167羅三藐三菩提時，令我國土眾生無如是事。一切眾生勤修精進，於三乘道各得度脫。』須菩提！菩薩摩訶薩作如是行，能具足毘梨耶波羅蜜、近阿耨多羅三藐三菩提。
%64.71 五、禪定願
復次，須菩提！菩薩摩訶薩行禪波羅蜜時，見眾生為五蓋所覆──婬欲、瞋恚、睡眠、掉悔、疑，失於初禪乃至第@t25p589b四禪，失慈、悲、喜、捨、虛空處、識處、無所有處、非有想非無想處，當作是願：『我隨爾所時行禪波羅蜜，如我得阿耨多羅三藐三菩提時，令我國土#75.161眾生無如是事。』須菩提！菩薩摩訶薩作如是行，能具足禪波羅蜜、近阿耨多羅三藐三菩提。
%64.72 六、般若願
復次，須菩提！菩薩摩訶薩行般若波羅蜜時，見眾生愚癡，失世間、出世間正見──或說無業#75.162、無業因緣，或說神常、或說斷滅，或說無所有，當作是願：『我隨爾所時#75.163行般若波羅蜜，淨佛世界#75.164、成就眾生，如我得阿耨多羅三藐三菩提時，令我國土眾生無如是事。』須菩提！菩薩摩訶薩作如是行，能具足般若波羅蜜、近一切種智。#75.165
%64.73 （貳）總行六度之願
%64.74 一、無邪聚願
復次，須菩提！菩薩摩訶薩行六波羅蜜時，見眾生住於三聚#75.166：一者、必正聚，二者、必邪#75.167聚，三者、不定聚，#75.168當作是願：『我隨爾所時行六波羅蜜，淨佛世界、成就~2168眾生，我得佛時，令我國土眾生無#75.169邪聚，乃至無其名。』須菩提！菩薩摩訶薩作如是行，能具足六波羅蜜、近一切種智。#75.170
%64.75 二、無惡道願
復次，須菩提！菩薩摩訶薩行六波羅蜜時，見地獄中眾生，畜生、餓鬼中眾生，當作是願：『我隨爾所時行六波羅蜜，淨佛世界、成就眾生，我得佛時，令我國土中乃至無三惡道名！』須菩提！菩薩摩訶薩作如是行，能具足六波羅蜜#75.171、近一切種智。
%64.76 三、國土平正願
復次，須菩提！菩薩摩訶薩行六波羅蜜時，見是大地株#75.172杌#75.173、荊棘、山陵、溝坑、穢惡之處，當作是願：『我隨爾所時行六波羅蜜，淨佛世界、成就眾生，我作佛時，令我國土無如是惡，地@t25p589c平如掌。』須菩提！菩薩摩訶薩作如是行，能具足六波羅蜜、近一切種智。
%64.77 四、金沙布地願
復次，須菩提！菩薩摩訶薩行六波羅蜜時，見是大地純土，無有金銀珍寶，當作是願：『我隨爾所時行六波羅蜜，淨佛世界、成就眾生，我作佛時，令我國土以金沙布地。』須菩提！菩薩摩訶薩作如是行，能具足六波羅蜜、近一切種智。
%64.78 五、眾生無著願
復次，須菩提！菩薩摩訶薩行六波羅蜜時，見眾生有所戀著，當作是願：『我隨爾所時行六波羅蜜，淨佛世界、成就眾生，我作佛時，令我國土眾生無所戀著。』須菩提！菩薩摩訶薩作如是行，能具足六波羅蜜、近阿耨多羅三藐三菩提。
%64.79 六、四姓無別願
復次，須菩提！菩薩摩訶薩行六波羅蜜時，見四姓眾生──剎帝利、婆羅門、鞞舍、首#75.174陀羅，當作是願：『我隨爾所時行六波羅蜜，淨佛世界、成就眾生，我作佛時，令我國土眾生無四姓之名。』須菩提！菩薩摩訶薩作如是行，能具足六波羅蜜、近阿耨多羅三藐三菩提。
%64.80 七、家無優劣願
~2169復次，須菩提！菩薩摩訶薩行六波羅蜜時，見眾生有下、中、上，生#75.175下、中、上家，當作是願：『我隨爾所時行六波羅蜜，淨佛世界、成就眾生，我作佛時，令我國土眾生無如是優劣。』須菩提！菩薩摩訶薩作如是行，能具足六波羅蜜，近@t25p590a一切種智。#75.176
%64.81 八、妙色成就願
復次，須菩提！菩薩摩訶薩行六波羅蜜時，見眾生種種別異色#75.177，當作是願：『我隨爾所時行六波羅蜜，淨佛世界、成就眾生，我作佛時，令我國土眾生無種種別異色，一切眾生皆端政#75.178淨潔，妙色成就。』#75.179須菩提！菩薩摩訶薩作如是行，能具足六波羅蜜，近一切種智。
%64.82 九、眾生無主願
復次，須菩提！菩薩摩訶薩行六波羅蜜時，見眾生有主，當作是願：『我隨爾所時行六波羅蜜，淨佛世界、成就眾生，我作佛時，令我國土眾生無有主名，乃至無其#75.180形像──除佛法王。』#75.181須菩提！菩薩摩訶薩作如是行，能具足六波羅蜜，近一切種智。
%64.83 十、同修聖道願
復次，須菩提！菩薩摩訶薩行六波羅蜜時，見眾生有六#75.182道別異，當作是願：『我隨爾所時行六波羅蜜，淨佛世界、成就眾生，我作佛時，令我國土眾生無六道之名──~2170是地獄，是畜生，是餓鬼，是神，是天，是人；一切眾生皆同一業──修四念處乃至八聖道分。』須菩提！菩薩摩訶薩作如是行，能具足六波羅蜜#75.183，近一切種智。#75.184
%64.84 十一、等一化生願
復次，須菩提！菩薩摩訶薩行六波羅蜜時，見眾生有四生──卵生、胎生、濕生、化生，當作是願：『我隨爾所時行六波羅蜜，淨佛世界、成就眾生，我作佛時，令我國土眾生無三種生，等一化生。』#75.185須菩提！菩薩摩訶薩作如是行，能具足六波羅蜜，近一切種智。
%64.85 十二、皆得五通願
復次，須菩提！菩薩摩訶薩行六波羅蜜時，見眾生無五神通，當作是願：『我隨爾所時行六波羅蜜，淨佛世界、成就眾生，我作佛時，令我國土眾生一切#75.186皆得五神#75.187通。』#75.188──乃至近一切種智。
%64.86 十三、無便利患願
復次，須菩提！菩薩摩訶薩行六波羅蜜時，見眾生有大小便患，當作是願：『我作佛時，令我國土眾生皆以法#75.189喜為食，無有便利之患。』#75.190──乃至近一切種智。
~2171
%64.87 十四、身具光明願
復次，須菩提！菩薩摩訶薩行六波羅蜜時，見眾生無有光明#75.191，當作是願：『我作佛時#75.192，令我@t25p590b國土眾生皆有光明。』#75.193──乃至近一切種智。
%64.88 十五、無有歲節願
復次，須菩提！菩薩摩訶薩行六波羅蜜時，見有日月#75.194、時節#75.195、歲數，當作是願：『我作佛時，令我國土中無有日月、時節、歲數之名。』#75.196──乃至近一切種智。
%64.89 十六、壽命無量願
復次，須菩提！菩薩摩訶薩行六波羅蜜時，見眾生短命，當作是願：『我作佛時，令我國土中眾生壽命無量劫。』──乃至近一切種智。
%64.90 十七、相好成就願
復次，須菩提！菩薩摩訶薩行六波羅蜜時，見眾生無有相好，當作是願：『我作佛時，令我國土中眾生皆有三十二相成就。』──乃至近一切種智。
%64.91 十八、善根成就願
復次，須菩提！菩薩摩訶薩行六波羅蜜時，見眾生離諸善根#75.197，當作是願#75.198：『我作佛時，令我國土中眾生諸善根成就，以是福德#75.199，供養諸佛。』#75.200──乃至近一切種~2172智。
%64.92 十九、無惑業苦願
復次，須菩提！菩薩摩訶薩行六波羅蜜時，見眾生有三毒#75.201、四病，當作是願：『我作佛時，令我國土中#75.202眾生無四種病──冷、熱、風病、三種雜病，及三毒病。』#75.203──乃至近一切種智。
%64.93 二十、純一大乘願
復次，須菩提！菩薩摩訶薩行六波羅蜜時，見眾生有三乘，當作是願：『我作佛時，令我國土中眾生無二乘之名，純一大乘#75.204。』#75.205──乃至近一切種智。
%64.94 二一、無增上慢願
復次，須菩提！菩薩摩訶薩行六波羅蜜時，見眾生有增上慢，當作是願：『我作佛時，令我國土中眾生無增上慢之名。』──乃至近一切種智。
%64.95 二二、光明、壽命、僧數無量願
~2173復次，須菩提！菩薩摩訶薩行六波羅蜜時，應作是願：『若我光明、壽命有量，僧數有限，當作是願：「我行六波羅蜜，淨佛世界、成就眾生，我作佛時，令我光明、壽命無量，僧數無限。」』──乃至近一切種智。
%64.96 二三、國土無量願
復次，須菩提！菩薩摩訶薩行六波羅蜜時，應作@t25p590c是願：『若我國土有量，當作是願：「我隨爾所時行六波羅蜜，淨佛世界、成就眾生，我作佛時，令我一國土如恒河沙等諸佛世界。」』須菩提！菩薩摩訶薩作如是行，能具足六波羅蜜，近一切種智。
%64.97 （參）教菩薩正觀，不生疲厭
復次，須菩提！菩薩摩訶薩行六波羅蜜時，當作是念：『雖生死道長#75.206、眾生性多，爾時應如是正#75.207憶念──生死#75.208邊如虛空，眾生性#75.209邊亦如虛空，是中實無生死往來，亦無解脫者。』#75.210菩薩摩訶薩作如是行，能具足六波羅蜜，近一切種智。」#75.211
^75.4
%65.0 壹、恒伽提婆女，興淨土行願
爾時，有一#75.236女人#75.237，字恒伽提婆，在眾中坐。是女人從坐起，偏袒右肩，右膝著地，合掌#75.238白佛言：「世尊！我當行六波羅蜜，取淨佛世界，如#75.239般若波羅蜜中所說#75.240，我盡當行。」#75.241
%65.1 貳、至誠供養，正迴向
是時，女人#75.242以金銀華及水陸生華、種種莊嚴供養之具、金縷#75.243織成疊#75.244兩張，以散佛上；#75.245散已，於佛頂上虛空中化成四柱寶臺，端正#75.246嚴好。
是女人持是功德#75.247，與一切眾生共之，迴向阿耨多羅三藐三菩提。
~2177
%65.2 參、釋尊現神瑞，授無上道記
%65.3 （壹）如來現瑞為授記
爾時，世尊知是女人深心@t25p591b因緣，即時微笑。如諸佛法種種色光從口中出，青、黃、赤、白、紅、縹#75.248，遍照十方無量無邊佛國，還遶佛三匝，從頂上入。
爾時，阿難從座起，右膝著地，合掌白佛：「佛何因緣微笑？諸佛法不以無因緣而笑。」
佛告阿難#75.249：「是恒伽提婆姊未來世中當作佛#75.250，劫名星宿，佛號金花。
阿難！是女人畢女身，受男子形，當生阿閦佛阿毘羅提國土，於彼淨修梵行。阿難！是菩薩在彼國土，亦號金花。是金華菩薩於彼壽終，復至他方佛國；從一佛國#75.251至一佛國，不離諸佛。譬如轉輪聖王，從一觀至一觀，從生至終，足不蹈地。阿難！是金花菩薩摩訶薩亦如是，從一佛國至一佛國，乃至阿耨多羅三藐三菩提，未甞不見佛。」
%65.4 （貳）阿難歎妙，佛印成
時，阿難作是念言：「是金華菩薩摩訶薩後作佛時，諸菩薩摩訶薩會，當知為如佛會#75.252。」
佛知阿難意所念，告阿難言：「如是！如是！是#75.253金花佛時菩薩摩訶薩會，當知為如佛會。阿難！是金花佛比丘僧無量無邊、不可數不可數，若干百千萬億那由他。阿難！是金花菩薩作佛時，其國土無有是諸眾惡，如上#75.254所說。」
%65.5 肆、出往昔因行，釋得授記因由
阿難白佛言：「世尊！是女人從何處殖#75.255德本#75.256、種善根？」
佛告阿難：「是女人#75.257從然燈佛所#75.258種善根，初發阿耨多羅三藐三菩提心，以是功德，~2178迴向阿耨多羅三藐三菩提；亦以金華散然燈佛上，求阿耨多羅三藐三菩提。阿難！如我爾時以五華散然燈佛上，求阿耨多羅三藐三菩提。然燈佛知我善根成就，與我受#75.259阿耨多羅三藐三菩提記。是女人聞我受記，發心言：『我當來世亦如是菩薩，得受@t25p591c阿耨多羅三藐三菩提記。』阿難！當知是女人於然燈佛所初發心。」#75.260
阿難白佛言：「世尊！是女人久習行阿耨多羅三藐三菩提。」#75.261
佛言：「如是！如是！是女人久習行阿耨多羅三藐三菩提。」
^76.1
%66.0 壹、菩薩學空而不證
%66.1 （壹）觀空不取證#76.2
%66.2 一、善學自相空，不見證法、證者
%66.3 （一）須菩提問：云何菩薩行涅槃道而不取證
須菩提白佛言#76.3：「世尊！若菩薩摩訶薩欲行般若波羅蜜，云何u學u空三昧？云何入空三昧？云何學無相、無作三昧？云何入無相、無作三昧？云何學四念處？云何修四念處？乃至云何學八聖道分？云何修八聖道分？」#76.4
%66.4 （二）佛答：菩薩善學自相空而無所見
佛告須菩提：「菩薩摩訶薩行般若波羅蜜時，應觀色空、受想行識空，十二入、十八界#76.5，乃至應觀欲、色、無色界空。作是觀時，不令心亂。是菩薩摩訶薩若心不亂，則不見是法；若不見是法，則不作證。#76.6何以故？是菩薩摩訶薩善學自相@t25p592b空故，不有餘、不有分，#76.7證法、證者皆不可見。」#76.8
~2182
%66.5 二、具足深觀空，自知是學時，非是證時
%66.6 （一）須菩提問：云何菩薩住空法中而不作證
須菩提白佛言#76.9：「世尊！如佛所說，菩薩摩訶薩不應空法作證。世尊！云何菩薩住空法中而不作證？」
%66.7 （二）佛答
%66.8 1、明理
%66.9 （1）具足觀空，先作願：今是學時，非是證時
佛告須菩提：「若菩薩摩訶薩具足觀空，先作是願：『我今不應空法作證；我今學時，非是證時。』#76.10
%66.10 （2）於初入時，不專攝心繫於空緣中
菩薩摩訶薩不專攝心繫#76.11在緣中，是故#76.12菩薩摩訶薩於阿耨多羅三藐三菩提中不退，亦不取漏盡證。須菩提！菩薩摩訶薩如是大善妙法成就。何以故？住是空中，作是念：『我今是學時，非是證時。』#76.13
%66.11 （3）未圓滿具足佛功德前不應取證
須菩提！菩薩摩訶薩應如是念：『我是學檀波羅蜜時，非是證時；學尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜時，修四念處時乃至修八聖道分時，非是證時；修空三昧、無相三昧、無作三昧時，非是證時；修佛十力、四無所畏、四無礙智、十八不共法、大慈大悲時，非是證時。我今學一切種智時，非是得須陀洹果證乃至阿羅漢#76.14、辟支佛道證時。』
~2183如是，須菩提！菩薩摩訶薩行般若波羅蜜，學空觀，住空中#76.15；學無相、無作觀，住無相、無作中；修四念處不證四念處，乃至修八聖道分不證八聖道分。是菩薩雖學三十七品、雖行三十七品，而不作須陀洹果證乃至辟支佛道。#76.16
%66.12 2、舉喻
%66.13 （1）壯夫喻
須菩提！譬如壯夫，勁勇猛健，善於兵法、六十四能，堅持器仗，安立不動，巧諸伎術，端正淨潔，人所愛敬；少修事業，得報利多。以是因緣故，眾所恭敬、尊重、讚歎；見人敬重，倍復歡喜。少有因緣，當至他處，扶將#76.17老弱，過諸險難恐怖之處；安慰父母，曉喻#76.18妻子：『莫有恐懅#76.19！我能過@t25p592c此，必無所苦。』嶮難道中，多有怨賊潛伏劫害，其人智力具足故，能度惡道，還歸本處，不遇賊害，歡喜安樂。
須菩提！菩薩摩訶薩亦如是，於一切眾生中，慈、悲、喜、捨心遍滿足。
爾時，菩薩摩訶薩住四無量心，具足六波羅蜜，不取漏盡證；學一切種智，入空、無相、無作解脫門。是時菩薩不隨一切諸相，亦不證無相三昧；以不證無相三昧故，不墮聲聞、辟支佛地。
%66.14 （2）鳥翼喻
須菩提！譬如有翼之鳥，飛騰虛空而不墮墜，雖在空中，亦不住空。
須菩提！菩薩摩訶薩亦如是，學空解脫門，學無相、無作解脫門，亦不作證；以不作#76.20證故，不墮聲聞、辟支佛地；未具足佛十力、大慈大悲、無量諸佛法、一切種智，亦不證空、無相、無作解脫門。
%66.15 （3）善射喻
須菩提！譬如健人，學諸射法，善於射術，仰射空中#76.21，復以後箭射於前箭，箭#76.22箭#76.23相拄#76.24，不令箭墮，隨意自在；若欲令墮，便止後箭，爾乃墮地。
~2184須菩提！菩薩摩訶薩亦如是，行般若波羅蜜，以方便力故，為阿耨多羅三藐三菩提，諸善根未具足，不於實際作證；若善根成就，是時便於實際作證。
%66.16 3、結成
以是故，須菩提！菩薩摩訶薩行般若波羅蜜時，應如是觀諸法法#76.25相！」#76.26
%66.17 三、菩薩有悲願、方便力，雖行三解脫門而不捨眾生
%66.18 （一）須菩提歎
須菩提白佛言：「世尊！菩薩摩訶薩所為甚難！何以故？雖學是諸法相、學實際、學如、學法性、學畢竟@t25p593a空，乃至學自相空及三解脫門，終不中道墮落。世尊！是甚希有！」
%66.19 （二）佛說
%66.20 1、本願大悲心所持，不捨眾生
佛告須菩提：「是菩薩摩訶薩不捨一切眾生故，作如是願。#76.27
%66.21 2、心念眾生為顛倒所縛，菩薩雖入三解脫門而不中道證實際
須菩提！若#76.28菩薩摩訶薩作是念：『我不應捨一切眾生#76.29！眾生沒在無所有法中，我應當度！』爾時，即入空解脫門、無相解脫門、無作解脫門。須菩提！當知是菩薩摩訶薩成就方便力，未得一切種智，行是解脫門，亦不中道取實際證。#76.30
%66.22 3、欲觀深法，先發悲願斷眾生顛倒執，常增益善法不失諸功德
復次，須菩提！菩薩摩訶薩欲觀是諸甚深法，所謂內空乃至無法有法空，四念處乃至三解脫門，爾時菩薩摩訶薩應生如是心：『是諸眾生長夜行我相乃至知者、見者相，著於得法；為眾生斷是諸相故，得阿耨多羅三藐三菩提#76.31，當說法。』#76.32
~2185爾時，菩薩行空解脫門，無相、無作解脫門，亦不取實際證；以不證故，不墮須陀洹果，乃至辟支佛道。
須菩提！是菩薩摩訶薩以是心欲成就善根故，不中道實際作證，不失四禪、四無量心、四無色定，四念處乃至八聖道分，空、無相、無作，佛十力、四無所畏、四無礙智、大慈大悲、十八不共法。
是時，菩薩摩訶薩成就一切助道法，乃至阿耨多羅三藐三菩提，終不耗減#76.33。是菩薩有方便力故，常增益善法，諸根通利，勝於阿羅漢、辟支佛根。#76.34
%66.23 （貳）別明三解脫門各有所益，各有所治#76.35
%66.24 一、無作解脫門
復次，須菩提！若菩薩摩訶薩作是念：『眾生長夜著四顛倒#76.36──常想、樂想、我想、淨#76.37想；為是眾生故，求薩婆若。我得阿耨多羅三藐三菩提時，為說無常法、苦、不淨、無我法。』
是菩薩成就是心，以方便力行般若波羅蜜，不得佛三昧，未具足佛十力、四無所畏、四無礙智、大慈大悲、@t25p593b十八不共法，亦不實際作證。爾時，菩薩修無作解脫門，雖未得阿耨多羅三藐三菩提，亦不實際作證。
%66.25 二、空解脫門
復次，須菩提！若菩薩摩訶薩作是念：『眾生長夜著得法──所謂我、眾生乃至知者、見者，是色、是受想行識、是入、是界，是四禪、四無量心、四無色定；我如是行，如我得阿耨多羅三藐三菩提時，令眾生無是得法。』
菩薩是心成就，以方便力行般若波羅蜜，未具足佛十力、四無所畏、四無礙智、大慈大悲、十八不共法，不於實際作證。爾時，菩薩具足修空三昧。#76.38
~2186
%66.26 三、無相解脫門
復次，須菩提！若菩薩摩訶薩作是念：『眾生長夜行諸相──所謂男相、女相、色相、無色相；我如是行，如我得阿耨多羅三藐三菩提時，令眾生無是諸相過失！』
是心成就以方便力行般若波羅蜜，未具足佛十力乃至十八不共法，不於實際作證。爾時，菩薩摩訶薩具足修無相三昧。
%66.27 （參）智慧成就者，必不執著三界
須菩提！若菩薩摩訶薩學六波羅蜜，學內空乃至無法有法空，學四念處乃至空、無相、無作解脫門，學佛十力、四無所畏、四無礙智、大慈大悲，學十八不共法；如是智慧成就，若著作法、若住三界，無有是處！#76.39
%66.28 貳、明不退菩薩應當驗知
%66.29 （壹）行助道法應先試問
是菩薩摩訶薩學助道法、行助道法#76.40時，應當試問：『諸菩薩摩訶薩欲得阿耨多羅三藐三菩提，云何學是法，觀空，不證實際？以不證故，不墮須陀洹果乃至辟支佛道；觀無相、無作、無起、無生、無所有，亦不取證，而修行般若波羅蜜。』應如是問。#76.41
%66.30 （貳）辨正答、非正答
%66.31 一、非正答者，未得諸佛授記
須菩提！若諸菩薩摩訶薩若試問時，是菩薩若如是答：『菩薩摩訶薩但應觀空，但應觀#76.42無相、無作、無起、無生、無@t25p593c所有；是菩薩摩訶薩不應學空、無相、無作、無起、無生、無所有，不應學是助道法。』#76.43須菩提！當知是菩薩諸佛未授阿耨多羅三藐三菩提記。何以故？是人不能說阿鞞跋致菩薩所學相，不能示、不能答。#76.44
~2187
%66.32 二、能正答者
%66.33 （一）明二種能正答者
%66.34 1、已得不退轉之薄地菩薩
若是菩薩摩訶薩能說、能示、能答阿鞞跋致所學相，當知是菩薩摩訶薩已習學菩薩道、入薄地#76.45，如餘阿鞞跋致菩薩摩訶薩阿鞞跋致相#76.46。」#76.47
%66.35 2、未得不退轉而能如法回答之菩薩
須菩提白佛言：「世尊！頗有未得阿鞞跋致菩薩能如是答不？」
佛言：「有。須菩提！是菩薩摩訶薩，六波羅蜜若聞、若不聞，能如是答如阿鞞跋致菩薩摩訶薩。」#76.48
%66.36 （二）歎人希有
須菩提言：「世尊！多有菩薩求佛道，少有菩薩能如是答如阿鞞跋致菩薩摩訶薩學道、無學道#76.49中。」#76.50
佛語須菩提：「如是！如是！是菩薩甚少！何以故？菩薩摩訶薩少有如是得授記行#76.51阿鞞跋致慧#76.52地；若有得授記，是人能如是答。是人善根明了，諸天世人所不能壞。」
^76.2
%67.0 壹、辨「不退轉相」
%67.1 （壹）乃至夢中亦不貪二乘地及三界
佛告須菩提#76.79：「若菩薩摩訶薩乃至夢中不貪聲聞、辟支佛地，亦不貪三界，觀諸法如夢、如幻、如嚮#76.80、如焰、如化，亦不作證。
須菩提！當知是阿鞞跋致菩薩摩訶薩阿鞞跋致相。#76.81
%67.2 （貳）夢中聞佛說法，即善解義趣能隨法行
復次，須菩提！菩薩摩訶薩夢中見佛與無數@t25p595a百千萬億比丘、比丘尼、優婆塞、優婆夷、天、龍、鬼神、甄陀羅#76.82等說法；從佛聞法，即解中義、隨法行。
須菩提！當知是阿鞞跋致菩薩摩訶薩阿鞞跋致相。
%67.3 （參）於夢中見佛神力施作佛事
復次，須菩提！菩薩摩訶薩夢中見佛三十二相、八十隨形好、大光明，踊在虛空，於大比丘僧中說法；現大神力，化作化人，到他#76.83國土施作佛事。
須菩提！當知是阿鞞跋致菩薩摩訶薩阿鞞跋致相。
~2193
%67.4 （肆）夢見愁苦事而無畏，知三界虛妄，亦為眾生說三界如夢
復次，須菩提！若菩薩摩訶薩夢中見兵起若#76.84破聚落、若破城邑，若失火時，若見虎、狼、師子猛害之獸，若見欲來級#76.85其頭者，若見父母喪亡，兄弟、姊妹及諸親友、知識死者──見如是等種種愁苦之事，不驚、不怖，亦不憂惱；從夢覺已，即時思惟：『三界虛妄，皆如夢耳！我得阿耨多羅三藐三菩提時，亦當為眾生說三界如夢。』
須菩提！當知是阿鞞跋致菩薩摩訶薩阿鞞跋致相。#76.86
%67.5 （伍）夢中見三惡道，願成佛時國中無三惡道
復次，須菩提！云何當知是阿鞞跋致菩薩摩訶薩得阿耨多羅三藐三菩提時，國中無三惡道？
須菩提！菩薩摩訶薩若夢中見地獄、畜生、餓鬼，作是念：『我當勤精進，得阿耨多羅三藐三菩提時，令我國中無一切三惡道。』何以故？是夢及諸法，無二無別。
須菩提！當知是阿鞞跋致菩薩摩訶薩阿鞞跋致相。#76.87
%67.6 （陸）夢見地獄火，發誓願火即滅
復次，須菩提！菩薩摩訶薩夢中見地獄火燒眾生，作是誓：『若我實是阿鞞跋致者，是火當滅！』是火即滅。若地獄火滅，即#76.88是阿鞞跋致相。
%67.7 （柒）晝見火燒城郭，作願令火滅
復次，若菩薩晝日見城郭火起，作是念：『我夢中見阿鞞跋致行、類、相貌，我今實有是者，自立誓言：是火當滅！』若火滅者，當知是菩薩得受阿耨@t25p595b多羅三藐三菩提記，住阿鞞跋致地。
若火不滅，燒一家、置#76.89一家，燒一里、置一里。須菩提！當知被燒家破法業因緣厚集，以是故，燒一家、置一家，是諸眾生今世受破法餘殃故被燒。#76.90
~2194須菩提！以是因緣故，當知是阿鞞跋致菩薩摩訶薩阿鞞跋致相。」
%67.8 （捌）非人惱眾生，作誓令遠離
佛告須菩提：「今當更為汝說阿鞞跋致行、類、相貌。
須菩提！若男子、若女人為非人所持#76.91；是時，菩薩摩訶薩作是念：『若我為過去諸佛所授記，我心清淨求阿耨多羅三藐三菩提，行清淨正道，遠離聲聞、辟支佛心，遠離聲聞、辟支佛念，應當成阿耨多羅三藐三菩提。我必得阿耨多羅三藐三菩提，非不得；十方國土中現在無量諸佛無所不知、無所不見、無所不解、無所不證。諸佛知我深心，審#76.92定必當得阿耨多羅三藐三菩提。』以是至誠誓故，是男子、女人為非人所持、為非人所惱，是非人當遠去！
須菩提！是菩薩摩訶薩如是誓，若非人不去者，當知是菩薩摩訶薩未從過去諸佛受阿耨多羅三藐三菩提記。
須菩提！若菩薩摩訶薩如是誓，若非人去者，當知是菩薩摩訶薩已從過去諸佛受阿耨多羅三藐三菩提記。
須菩提！以是行、類、相貌，當知是阿鞞跋致菩薩摩訶薩阿鞞跋致相。
%67.9 貳、當知微細魔事
%67.10 （壹）魔令非人去，自恃謂是己力而輕慢餘菩薩
復次，須菩提！菩薩摩訶薩遠離六波羅蜜及方便力#76.93，不久行四念處，乃至不久行空、無相、無作三昧，未入菩薩位，是菩薩為惡魔所嬈#76.94。
菩薩作是誓：『若我實從諸佛受記者，是非人當去。』
是時惡魔即作方便，勅非人令去。惡魔有威力，勝諸非人故，@t25p595c非人即去。
是時，菩薩作是念：『以我誓力故，非人去。』不知是惡魔力；恃#76.95是證#76.96故，輕弄毀蔑~2195#76.97諸餘菩薩，作是言：『我已從諸佛受記，汝等未得。』用是空誓，無方便力故，生增上慢。
以是事故，遠離薩婆若，遠離阿耨多羅三藐三菩提。
須菩提！當知是人墮於二地──若聲聞地，若辟支佛地。#76.98
以是誓因緣故，起於魔事。是人以不親近依止善知識，不問阿鞞跋致相故，為魔所縛益復堅固。所以者何？是菩薩不久行六波羅蜜，無方便力故。
須菩提！當知是為菩薩魔事。
%67.11 （貳）魔化種種形，隨行者先所經事而妄授記，菩薩不覺而生憍慢心輕蔑餘人
須菩提！云何菩薩摩訶薩不久行六波羅蜜，乃至未入菩薩位，為惡魔所嬈？
須菩提！惡魔變化作種種身，語菩薩言：『汝於諸佛所得受阿耨多羅三藐三菩提記：汝字某，汝父字某，汝母字某，汝兄弟、姊妹字某，汝七世父母名字如是；汝在某方、某國、某城、某聚落中生。』
若見菩薩性行和柔，語菩薩言：『汝先世亦復柔和。』
若見急性卒暴#76.99，便言：『汝先世亦爾。』
若見菩薩修阿蘭若行，語言：『汝先世亦修阿蘭若行。』
若見菩薩乞食、納衣、中後不飲漿、一坐食、一鉢他#76.100食、死屍間住、露地住、樹下住、常坐不臥、如敷坐、但受三衣、若少欲、若知足、若遠離住、若不塗腳#76.101、若少言語，便語菩薩言：『汝先世亦有是行。何以故？汝今有此頭陀功德，汝先世亦必有是功德。』
是菩薩聞是先世事及名姓#76.102，聞今讚頭陀功德，即歡喜生慢憍#76.103心。
是時惡魔語菩薩言：『汝有如是功德、如是相，汝實從諸佛受阿耨多羅三藐三菩提記。』
~2196須菩提！惡魔或作比丘@t25p596a被服#76.104、或作居士形、或作父母身，來到菩薩所，如是言：『汝已得受阿耨多羅三藐三菩提記。何以故？是阿鞞跋致功德相，汝盡具足有之。』
須菩提！我所說實阿鞞跋致行、類、相貌，是人永無！須菩提！當知是菩薩摩訶薩為惡#76.105魔所持。何以故？是阿鞞跋致行、類、相貌，是人永無，以聞是名字故，生憍慢心，輕弄毀蔑餘人。#76.106
須菩提！是名菩薩摩訶薩為魔#76.107所持，當知是為菩薩魔事。
%67.12 （參）魔隨行者本念為授記，說其名號，菩薩著空名字，輕蔑餘人得重罪
%67.13 一、不覺魔事，輕蔑餘人，遠離無上道
復次，須菩提！菩薩摩訶薩不久行六波羅蜜，不知名字相，不知色相，不知受、想、行、識相。
惡魔來語言：『汝當來世得阿耨多羅三藐三菩提時#76.108，有如是名字。』隨其本念，說其名號。#76.109
是無智、無方便菩薩作是念：『我先亦有是成佛名號念，是人如我所念說，是人所說合我本念，我必為諸佛所授記。』#76.110
須菩提！我所說阿鞞跋致行、類、相貌，是人永無，但以空名字輕弄毀蔑餘人；以是事故，遠離阿耨多羅三藐三菩提。#76.111
~2197是菩薩摩訶薩遠離般若波羅蜜、無方便力、遠離善知識、與惡知識相得，故墮二地──若#76.112聲聞、辟支佛地；若#76.113久久往來生死中，然後還依止般若波羅蜜，若值善知識，常隨逐親近故，得阿耨多羅三藐三菩提。#76.114
是人於是身，若不即悔，當墮二地──若阿羅漢地，若辟支佛地。#76.115
%67.14 二、法喻合說：輕蔑餘人，罪重於四禁、五逆
須菩提！譬如比丘於四重禁法，若犯一事，非沙門、非釋子，是人現身不得四沙門果。
須菩提！是著空名字菩薩，心亦如是，輕弄毀蔑餘人故，當知是罪重於比丘四禁。
須菩提！置是重罪，其罪過於五逆。以受是名@t25p596b字故，生高心，輕弄毀蔑餘人；若生是心，當知其罪甚重！
%67.15 三、勸誡應覺知微細魔事
如是名字等微細魔事，菩薩當覺知！
%67.16 （肆）魔讚遠離法，而菩薩不知佛真遠離行
%67.17 一、魔所稱譽之遠離法：身處空閑曠遠處
復次，須菩提！菩薩在空閑山澤#76.116曠遠#76.117之處，魔來到菩薩所，讚歎遠離法，作是言：『善男子！汝所行，是佛所稱譽遠離法。』
%67.18 二、顯佛真遠離行：心離二乘、三界念
%67.19 （一）不讚魔所稱譽之遠離法
須菩提！我不讚是遠離──所謂但在空閑山澤曠遠之處。」
%67.20 （二）說正義
須菩提言：「世尊！若空閑山澤曠遠之處非遠離法者，云何更有異遠離？」
~2198佛言#76.118：「須菩提！若菩薩摩訶薩遠離聲聞、辟支佛心，住空閑山澤曠遠之處，是佛所許遠離法。須菩提！如是遠離法，菩薩摩訶薩應所修行，晝夜行是遠離法，是名遠離行菩薩。#76.119
%67.21 三、論行過失
須菩提！若惡魔所說遠離法──空閑山澤曠遠之處；是菩薩心在憒閙#76.120，所謂不遠離聲聞、辟支佛心，不勤修般若波羅蜜，是菩薩摩訶薩不能具足一切種智。#76.121
是菩薩行惡魔所說遠離法，心不清淨，而輕餘菩薩城傍心清#76.122淨，無聲聞、辟支佛憒閙心#76.123，亦無諸餘雜惡心，具足禪定、解脫、智慧、神通者。
是遠#76.124離般若波羅蜜、無方便菩薩摩訶薩，雖在絕曠#76.125百由旬外，禽獸、鬼神、羅剎所住之處，若一歲、百千萬億歲，若過萬億歲，不知是菩薩遠離法──所謂諸菩薩以是遠離法，深心發阿耨多羅三藐三菩提不雜行。是菩薩憒閙行，而依受著是遠離法#76.126。是人所行，佛所不許！#76.127
須菩提！我所說實遠離法，是菩薩不在是中，亦不見是遠離相。何以故？但行是空遠離故。#76.128
~2199爾時，惡魔來在虛空中住，讚言：『善哉！善哉！善男子！此是佛所說真遠離法，汝行是遠離，疾得阿耨多羅三藐三菩@t25p596c提。』
是菩薩摩訶薩念著是遠離，而輕易#76.129諸餘求佛道清淨比丘以為憒閙，以憒閙為不憒閙，以不憒閙為憒閙，應恭敬而不恭敬，不應恭敬而恭敬。
是菩薩作是言：『非人念我、來稱讚我，我所行者是真遠離；住城傍者，誰當稱美汝？』以是因緣故，輕餘菩薩摩訶薩。
須菩提！當知是名菩薩旃陀羅#76.130，污染諸菩薩；是人似像菩薩，實是天上人中之大賊，亦是沙門被服中賊！如是人，諸求佛道者所不應親近、不應供養恭敬。何以故？須菩提！當知是人墮增上慢。以是故，若菩薩摩訶薩欲不捨一切智，欲得阿耨多羅三藐三菩提，一心欲求阿耨多羅三藐三菩提，欲利益一切眾生，不應親近是人恭敬、供養。#76.131
%67.22 四、結勸當善覺魔事而遠離
菩薩摩訶薩法──常應勤求自利，厭患世間，心常遠離三界；於是人當起慈、悲、喜、捨心：『我行菩薩道，不應生如是過罪；若生，當疾滅！』須菩提！菩薩摩訶薩當善覺是事，是事中善自免#76.132出#76.133！#76.134
%67.23 參、明親近善知識
%67.24 （壹）欲得無上菩提，當親近善知善
復次，須菩提！菩薩摩訶薩深心，欲得阿耨多羅三藐三菩提者，當親近恭敬供養善知識#76.135。」
~2200
%67.25 （貳）辨兩種善知識：人善知識、法善知識
%67.26 一、須菩提問
須菩提白佛言：「世尊！何等是菩薩摩訶薩善知識？」
%67.27 二、佛答
%67.28 （一）人善知識
佛告須菩提：「諸佛是菩薩摩訶薩善知識，諸菩薩摩訶薩亦是菩薩善知識。須菩提！阿羅漢亦是菩薩善知識──是為菩薩摩訶薩善知識。#76.136
%67.29 （二）法善知識
%67.30 1、通明六度等法是善知識
%67.31 （1）正明
復次，須菩提！六波羅蜜亦是菩薩善知識，四念處乃至十八不共法亦是菩薩善知識。須菩提！如、實際、法性亦是菩薩善知識。
%67.32 （2）稱歎
須菩提！六波羅蜜是世尊，六波羅蜜是道，六波羅蜜是大明，六波羅蜜是炬，六波羅蜜@t25p597a是智，六波羅蜜是慧，六波羅蜜是救，六波羅蜜是歸，六波羅蜜是洲，六波羅蜜是究竟道，六波羅蜜是父是母。#76.137四念處乃至一切種智，亦如是。
%67.33 （3）釋因由
何以故？六波羅蜜#76.138、三十七道法亦是過去諸佛父母，六波羅蜜、三十七道法亦是未來、現在十方諸佛父母。
何以故？須菩提！六波羅蜜、三十七道法中生過去、未來、現在十方諸佛故。
%67.34 （4）勸親近
以是故，須菩提！菩薩摩訶薩欲得阿耨多羅三藐三菩提，淨佛世界、成就眾生，當學六波羅蜜、三十七道法，及四攝法攝取眾生。何等四？布施、愛語、利益、同事。
須菩提！以是利益故，我言：『六波羅蜜及三十七道法是諸菩薩摩訶薩世尊，是道，是大明，是炬，是智，是慧，是救，是歸，是洲，是究竟道，是父，是母。』
%67.35 2、別明般若是善知識，廣攝諸善，應當學
須菩提！以是故，菩薩摩訶薩欲不隨他人教住，欲斷一切眾生疑，欲淨佛世界、成就眾生，當學是般若波羅蜜！所以者何？是般若波羅蜜中廣說諸法，是菩薩摩訶薩~2201所應學處。」#76.139
^77.1
#77.1
%67.84 肆、明「般若相」
%67.85 （壹）正明般若相
%67.86 一、如虛空相是般若相
%67.87 （一）須菩提問
爾時，須菩提#77.2白佛言：「世尊！何等是般若波羅蜜相？」
%67.88 （二）佛答
佛告須菩提：「如虛空相是般若波羅蜜相。須菩提！般若波羅蜜無所有相。」#77.3
%67.89 二、一切法相亦如般若相
%67.90 （一）正明
須菩提白佛言：「世尊！頗有因緣，如般若波羅蜜相，諸法相亦如是耶#77.4？」
佛告須菩提：「如是！如是！如#77.5般若波羅蜜相，@t25p599a諸法相亦如是。何以故？須菩提！一切法離相、空相。
以是因緣故，須菩提！如般若波羅蜜相，諸法相亦如是，所謂離相、空相故。」#77.6
%67.91 （二）釋難
%67.92 1、須菩提難：一切法空中，豈有垢淨及無上菩提可得
須菩提白佛言：「世尊！若一切法一切法離，一切法#77.7一切法空，云何知眾生若垢、~2209若淨？世尊！離相法無垢、無淨，空相法無垢、無淨；#77.8離相、空相法不能得阿耨多羅三藐三菩提，離相、空相無法可得。世尊！離相中，空相中，無有菩薩得阿耨多羅三藐三菩提者。世尊！我云何當知佛所說義？」#77.9
%67.93 2、佛答
%67.94 （1）論諸法垢淨
%67.95 A、有垢
佛告#77.10須菩提：「於汝意云何？是眾生長夜行我、我所心不？」
「如是！世尊！眾生長夜行我#77.11、我所心。」#77.12
「於汝意云何？是我、我所心離相不？空相不？」
須菩提言：「世尊！我、我所心離相、空相。」#77.13
「於汝意云何？以此我、我所心，眾生往來生死中不？」
「如是！世尊！以此我、我所心，眾生往來生死中。」#77.14
「如是！須菩提！眾生往來生死中故，知有垢惱。#77.15
%67.96 B、有淨
須菩提！若眾生無我我所心、無著心，是眾生不復往來生死中；若不往來生死中，則無垢惱。如是，須菩提！眾生有淨。」#77.16
~2210
%67.97 （2）論菩薩行果
%67.98 A、明自利利他行果
%67.99 （A）自利行果
%67.100 a、辨所行
須菩提白佛言：「世尊！若菩薩摩訶薩如是行，為不行色，不行受、想、行、識，為不行四念處乃至八聖道分，為不行內空乃至無法有法空，為不行佛十力乃至一切種智。何以故？是法不可得，亦無行者，亦無行處，亦無行法。#77.17
%67.101 b、辨所得
%67.102 （a）世無能降伏
世尊！菩薩摩訶薩如是行，一切世間諸天、人、阿修羅不能降伏。#77.18
%67.103 （b）二乘不能及
是菩薩摩訶薩，一切聲聞、辟支佛所不能及。何以故？所住處無能及故，所謂菩薩位。世尊！是菩薩摩訶薩行應薩婆若心，無能及者！」#77.19
%67.104 （c）疾近薩婆若
「須菩提！菩薩摩訶薩@t25p599b如是行#77.20，疾近薩婆若。#77.21
%67.105 （B）利他行果
須菩提#77.22！於汝意云何？若閻浮提眾生#77.23盡得人身，得人身已，皆得阿耨多羅三藐三菩提；若有善男子、善女人盡其形壽供養、恭敬、尊重、讚歎，持是善根迴向阿耨多羅三藐三菩提--是人以是因緣得福多不？」#77.24
~2211須菩提言：「甚多！世尊！」
佛言：「不如是善男子、善女人於大眾中說是般若波羅蜜，出示、分別，照明、開演，亦應般若波羅蜜行正憶念，其福多。#77.25
乃至三千大千世界中眾生，亦如是。
須菩提！於汝意云何？閻浮提中眾生一時皆得人身#77.26，得人身已，若善男子、善女人教行十善道、四禪、四無量心、四無色定，教令得須陀洹道乃至阿羅漢、辟支佛道，教令得阿耨多羅三藐三菩提；持是善根迴向阿耨多羅三藐三菩提。須菩提！於汝意云何？是善男子、善女人得福多不？」
須菩提言：「甚多！世尊！」
佛言：「不如#77.27是善男子、善女人以是甚深般若波羅蜜為眾生說#77.28，出示、分別，照明、開演，亦不離薩婆若，得福多。
乃至三千大千世界，亦如是。
%67.106 B、釋得大福因緣：相應般若起四無量心，能為一切眾生作福田
是菩薩摩訶薩不遠離應薩婆若心，則到一切福田邊。何以故？除諸佛，無有餘法如菩薩摩訶薩勢力。何以故？諸菩薩摩訶薩行般若波羅蜜時，於一切眾生中起大慈#77.29心；見諸眾生趣死地故，而起大悲；行是道時歡悅而生大喜；不與想俱#77.30，便得大捨。須菩提！是為菩薩摩訶薩大智光明。大智#77.31明者，所謂六波羅蜜。#77.32
~2212須菩提！是諸善男子雖未作佛，能為一切眾生作大福田，於阿耨多羅三藐三菩提亦不轉；所受供養--衣服、飲食、臥具#77.33、床@t25p599c敷#77.34、疾藥、資生所須，行應般若波羅蜜，念能畢#77.35報施主之恩#77.36，疾近薩婆若。#77.37
%67.107 （貳）結勸修行
%67.108 一、正勸
%67.109 （一）標宗
%67.110 1、若欲不空食國中施乃至欲令眾生得五眼等，應常學般若
以是故，須菩提！若菩薩摩訶薩（1）欲不虛#77.38食國中施、（2）欲示眾生三乘道、（3）欲為眾生作大明、（4）欲拔出三界牢獄、（5）欲與一切眾生眼，應常#77.39行般若#77.40波羅蜜。
%67.111 2、常行二事：聖默然，說般若
行般若波羅蜜時，若欲有說，但說般若波羅蜜；說般若波羅蜜已，常憶念般若波羅蜜；常憶念般若波羅蜜已，常行般若波羅蜜，不令餘念得生，晝夜勤行般若波羅蜜相應念，不息不休。
%67.112 （二）舉喻
須菩提！譬如士夫未#77.41曾得摩尼珠，後時得，得已，大歡喜踊躍；後復失之，便大憂愁，常憶念是摩尼珠，作是念：『我奈#77.42何忽亡#77.43失#77.44此大寶！』
%67.113 （三）合法
須菩提！菩薩摩訶薩亦如是，常憶念般若波羅蜜，不離薩婆若心。」
%67.114 二、明修行
%67.115 （一）明「應薩婆若念之般若行」
~2213
%67.116 1、須菩提問
須菩提白佛言：「世尊！一切念性自離、一切念性自空，云何菩薩摩訶薩行般若波羅蜜不離應薩婆若念？是遠離空法中無菩薩，亦無念、無應薩婆若。」#77.45
%67.117 2、佛答
佛告須菩提：「若菩薩摩訶薩如是知：『一切法性自離、一切法性自空，非聲聞、辟支佛作，亦非佛作；諸法相常住、法相、法住、法位、如、實際。』是名菩薩行般若波羅蜜不離薩婆若念。#77.46何以故？般若波羅蜜性自離、性自空，不增不減故。」#77.47
%67.118 （二）明「正行般若不增不減，得無上道」
%67.119 1、須菩提問
須菩提白佛言：「世尊！若般若波羅蜜性自離、性自空，云何菩薩摩訶薩與般若波羅蜜等#77.48，得阿耨多羅三藐三菩提？」#77.49
%67.120 2、佛答
%67.121 （1）明理
佛告須菩提：「菩薩摩訶薩與般若波羅蜜等，不增不減。何以故？如、法性、實際不增不減故。
%67.122 （2）釋因由
所以者何？般若波羅蜜非一非異故。#77.50
%67.123 （3）得益
若菩薩#77.51聞如是般若波羅蜜相，不#77.52驚、不沒、不畏@t25p600a不怖、不疑。須菩提！~2214當知是菩薩摩訶薩行般若波羅蜜，當知是菩薩摩訶薩必住阿鞞跋致地中。」
%67.124 （三）明無所行是為行般若
%67.125 1、略就四門明無行
%67.126 （1）即空不行
須菩提白佛言：「世尊！般若波羅蜜空、無所有、不堅固#77.53，是行般若波羅蜜不？」#77.54
「不也！須菩提！」
%67.127 （2）離空不行
「世尊！離空，更有法行般若波羅蜜不？」#77.55
「不也！須菩提！」
%67.128 （3）即般若不行
「世尊！是般若波羅蜜，行般若波羅蜜不？」#77.56
「不也！須菩提！」
%67.129 （4）離般若不行
「世尊#77.57！離般若波羅蜜，行般若波羅蜜不？」#77.58
「不也！須菩提！」
%67.130 2、別歷諸法明無行
%67.131 （1）有為法不行
%67.132 A、五陰不行
「世尊！色是行般若波羅蜜不？」
「不也！須菩提！」
「世尊！受、想、行、識是行般若波羅蜜不？」
「不也！須菩提！」#77.59
~2215
%67.133 B、助道法不行
「世尊！六波羅蜜是行般若波羅蜜不？」
「不也！須菩提！」
「世尊！四念處乃至十八不共法是行般若波羅蜜不？」
「不也！須菩提！」
%67.134 （2）無為法不行
「世尊！色空相、虛誑不實、無所有、不堅固相，色如相、法相、法住、法位、實際，是行般若波羅蜜不？」
「不也！須菩提！」#77.60
「世尊！受、想、行、識乃至十八不共法空相、虛誑不實、無所有、不堅固相、如、法相、法住、法位、實際是行般若波羅蜜不？」
「不也！須菩提！」
%67.135 3、顯義：諸法不可得故無行
%67.136 （1）須菩提問
「世尊！若是諸法皆不行#77.61般若波羅蜜，云何行名菩薩摩訶薩行般若波羅蜜？」
%67.137 （2）佛答
%67.138 A、不見行般若者
佛告須菩提：「於汝意云何？汝見有法行般若波羅蜜者不？」
「不也！世尊！」
%67.139 B、不見行般若處
「須菩提！汝見般若波羅蜜菩薩摩訶薩可行處不？」
「不也！世尊！」
~2216
%67.140 C、不見法亦不可得
「須菩提！汝所不見法，是法可得不？」#77.62
「不也！世尊！」
%67.141 D、不可得法亦無生
「須菩提！若法不可得，是法當生不？」#77.63
「不也！世尊！」
%67.142 （四）悟無生忍得受記而受記不可得
%67.143 1、得無生法忍，受無上道記
「須菩提！是名#77.64菩薩摩訶薩無生法忍。菩薩摩訶薩成就是忍，得受阿耨多羅三藐三菩提記。須菩提！是名諸佛無所畏#77.65、無礙智。
菩薩摩訶薩行是法忍#77.66，勤精進，若不得大智、一切種智--所謂阿耨多羅三@t25p600b藐三菩提智者#77.67，無有是處！何以故？是菩薩摩訶薩得無生法忍故，乃至阿耨多羅三藐三菩提不減不退。」#77.68
%67.144 2、明受記不可得
%67.145 （1）正明
%67.146 A、無生法不得記
須菩提白佛言：「世尊！諸法無生相，此中#77.69得阿耨多羅三藐三菩提記不？」
「不也！須菩提！」
~2217
%67.147 B、生法不得記
「世尊！諸法生相，此中得阿耨多羅三藐三菩提記不？」
「不也！須菩提！」
%67.148 C、非生非不生法不得記
「世尊！諸法非生非不生#77.70相，得阿耨多羅三藐三菩提記不？」
「不也！須菩提！」#77.71
%67.149 （2）般若中無憶想分別故，不見得受記者、受記法
%67.150 A、須菩提問
「世尊！諸菩薩摩訶薩云何知諸法得阿耨多羅三藐三菩提記？」
%67.151 B、佛反詰顯義
%67.152 （A）標宗：無得者、無得處
佛告須菩提：「汝見有法得阿耨多羅三藐三菩提記不？」
「不也！世尊！我不見有法得阿耨多羅三藐三菩提記，我亦不見法有得者、得處。」
%67.153 （B）釋因由：般若無憶想分別故
佛言：「如是！如是！須菩提！若菩薩摩訶薩於一切法無所得時，不作是念：『我當得阿耨多羅三藐三菩提，用#77.72是事得阿耨多羅三藐三菩提，是阿#77.73耨多羅三藐三菩提處。』何以故？諸菩薩摩訶薩行般若波羅蜜，無諸憶想分別。所以者何？般若波羅蜜中無諸分別憶想故。」#77.74
^77.2
%68.0 壹、明行般若得無量功德#77.143
%68.1 （壹）不雜餘心心數法，如說行般若得大功德
%68.2 一、天主歎不雜餘心心數法修般若得大功德，佛述成
%68.3 （一）天主歎
爾時，釋提桓因#77.144白佛言：「世尊！是般若波羅蜜無諸憶想分別，畢竟離故。世尊！是眾生聞是般若波羅蜜能受#77.145持、讀、誦、說、正憶念、@t25p602c親近、如說行，乃至阿耨多羅三藐三菩提，不雜#77.146餘心心數法者，不從小功德來。」
%68.4 （二）佛述成，校德顯勝
%68.5 1、佛述成
佛言：「如是！如是！聞是深般若波羅蜜，乃至不雜餘心心數法者，不從小功德來。
%68.6 2、校德顯勝
憍尸迦！於汝意云何？若閻浮提眾生成就十善道、四禪、四無量心、四無色定，復有善男子、善女人受持深般若波羅蜜，讀、誦、親近、正憶念、如說行，勝於閻浮提眾生成就十善道乃至四無色定百倍、千倍、千萬億倍，乃至算數譬喻所不能及。」
%68.7 二、如說行般若者功德勝餘無方便者
%68.8 （一）比丘歎
爾時，有一比丘語釋提桓因：「憍尸迦！是善男子、善女人行般若波羅蜜功德勝於仁者！」
%68.9 （二）天主歎
%68.10 1、歎菩薩一發心便勝帝釋
釋提桓因言：「是善男子、善女人一發心#77.147勝於我，何況聞是般若波羅蜜，書、持、讀、誦、正憶念、如說#77.148行！
~2228
%68.11 2、如說行般若之菩薩，超勝凡夫、二乘，乃至行般若無方便力者#77.149
是善男子、善女人行般若波羅蜜，非但勝我，亦勝一切世間天及人、阿修羅；非但勝一切世間天及人、阿修羅，亦勝諸須陀洹、斯陀含、阿那含、阿羅漢、辟支佛；非但勝是須陀洹乃至辟支佛，亦勝菩薩行五波羅蜜、遠離般若波羅蜜者；非但勝菩薩行五波羅蜜、遠離般若波羅蜜者，亦勝菩薩行般若波羅蜜無方便力者。
%68.12 3、菩薩如說行般若故，不斷佛種，得現世功德
%68.13 （1）明勝因緣
是菩薩摩訶薩如說行般若波羅蜜，不斷佛種，常見諸佛，疾#77.150近道場。
菩薩如是行，為欲拔出眾生沈沒長流者。
是菩薩如是學，為不學聲聞、辟支佛學。#77.151
%68.14 （2）明現世功德
菩薩如是學，四天王天來至菩薩所，如是言：『善男子！當勤疾學，坐道場，成阿耨多羅三藐三菩提時，如過去諸佛所受四鉢，亦當應受，我當持來奉上菩薩。』及諸餘天--四天王天、三十三天、夜摩天、兜率陀天、化樂天、他化自在天、梵天@t25p603a乃至首陀會天#77.152，亦當供養。
十方諸佛亦常念是菩薩摩訶薩如說行是深般若波羅蜜者。
是菩薩諸所有世間厄難#77.153勤苦之事永無復有；一切世間有四百四病，是菩薩身中無#77.154是諸#77.155病。
以#77.156行深般若波羅蜜故，得是現世功德。」
%68.15 三、明「帝釋依佛力說」
%68.16 （一）阿難疑
爾時，阿難作是念：「釋提桓因自以力說耶？以佛神力說乎？」
%68.17 （二）天主釋
釋提桓因知阿難意所念，語阿難言：「我之所說，皆#77.157佛威神！」
%68.18 （三）佛述成
佛告阿難：「如是！如是！如釋提桓因所說，皆佛威神。
~2229
%68.19 （貳）巧學般若令魔驚怖
阿難！是菩薩摩訶薩習學是深般若波羅蜜時，三千大千世界中諸惡魔皆生狐疑#77.158：#77.159『今是菩薩為當得阿耨多羅三藐三菩提？當中道於實際作證，墮聲聞、辟支佛地？』
復次，阿難！若菩薩摩訶薩不離般若波羅蜜時，魔大愁毒#77.160，如箭入心。是時，魔復放大火風，四方俱起，欲令菩薩心沒、恐怖、懈怠，於薩婆#77.161若中乃至起一亂念#77.162。」
%68.20 （參）廣明留難，令行者識知
%68.21 一、阿難問
阿難白佛言：「世尊！魔為都嬈亂#77.163諸菩薩？有不嬈亂者？」
%68.22 二、佛分別答
佛告阿難：「有嬈者，有不嬈者。」
%68.23 三、詳論為魔所嬈者
阿難白佛言：「世尊！何等菩薩為惡魔所嬈？」#77.164
%68.24 （一）心不信解@yE022p321
佛言：「有菩薩摩訶薩先世聞是深般若波羅蜜，心不信解。如是菩薩，魔得其便。
%68.25 （二）疑般若有無
復次，阿難！菩薩聞說是深般若波羅蜜時，意疑：『是般若波羅蜜，為實有？為實無？』
如是菩薩，魔得其便。#77.165
%68.26 （三）近惡知識@yE022p321
復次，阿難！有菩薩遠離善知識、為惡知識所攝故，不聞深般若波羅蜜，不聞故不知、不見，不問：『云何應行般若波羅蜜？云何應修般若波羅蜜？』
是菩薩，惡魔得其便。
%68.27 （四）受行惡法@yE022p321
復次，阿難！若菩薩遠離般若波羅蜜、受惡法，是菩薩為惡魔得其#77.166便。
~2230魔作是念：『是@t25p603b輩當有伴黨，當滿我願。』
是菩薩自墮二地，亦使他人墮於二地。#77.167
%68.28 （五）障人學般若
復次，阿難！若菩薩聞說深般若波羅蜜時，語他人言：『是般若波羅蜜甚深，我尚不能得其底，汝復用聞、用學是般若波羅蜜為？』
如是菩薩，魔得其便。
%68.29 （六）自傲凌他@yE022p321
復次，阿難！若菩薩輕餘菩薩言：『我行般若波羅蜜，行遠離空；汝無是功德。』是時，惡魔大歡喜踊躍。
若有菩薩自恃#77.168名姓#77.169、多人知識故，輕餘行善菩薩，是人無實阿鞞跋致行、類、相貌功德；無是功德故，生諸煩惱；但著虛#77.170名故，輕賤餘人，言：『汝不在如#77.171我所得法中。』#77.172
爾時，惡魔作是念：『今我境界宮殿不空，增益三惡道。』
惡魔助其威力，令餘人信受其語；信受其語故，受行其經，如說修學；如說修學時，增益諸結使。是諸人心顛倒故，身、口、意業所作皆受惡報；以是因緣，增益三惡道，魔之眷屬宮殿益多。
阿難！魔見是利故，大歡喜踊躍。
%68.30 （七）與聲聞人共諍鬥
阿難！若行菩薩道者與求聲聞道家#77.173共諍鬪，魔作是念：『是遠離薩婆若。』
%68.31 （八）與菩薩共諍鬥
阿難！若菩薩、菩薩共諍鬪，瞋恚罵詈#77.174；是時惡魔便大歡喜踊躍言：『兩離薩婆若遠。』#77.175
~2231
%68.32 （九）向得記菩薩生惡心
%68.33 1、正明罪過
復次，阿難！若未受記菩薩向得記菩薩生惡心，諍鬪罵詈，隨起念多少劫#77.176，若干劫數#77.177，若不捨一切種智，然後乃補爾#77.178所#77.179劫大莊嚴。」#77.180
%68.34 2、辨罪出不出
%68.35 （1）阿難問
阿難白佛言：「世尊！是惡心乃經爾所#77.181劫數#77.182，於其中間，寧得出#77.183除#77.184不？」#77.185
%68.36 （2）佛答
%68.37 A、不得出罪者
佛告阿難：「我雖說求菩薩道及聲聞人得出罪#77.186，阿難！若求菩薩道人共#77.187鬪諍#77.188、瞋恚、罵詈、懷恨、不悔、不捨者，我不說有出#77.189。#77.190
~2232
%68.38 B、得出罪者
%68.39 （A）述懺罪之行
必當更爾所劫數，若不捨一切種智，然後乃大莊@t25p603c嚴。#77.191
%68.40 （B）辨破瞋因緣
阿難！若是菩薩鬪諍、瞋恚、罵詈，便自改悔，作是念：『我為大失！我當為一切眾生下屈，今世、後世皆使和解；我當忍受一切眾生履#77.192踐#77.193如橋梁，如聾、如瘂，云何以惡語報人？我不應壞是甚深阿耨多羅三藐三菩提心；我得阿耨多羅三藐三菩提時，應當度是一切苦惱眾生，云何當起瞋恚？』」#77.194
%68.41 貳、明菩薩同學
%68.42 （壹）阿難問
阿難白佛言：「世尊！菩薩、菩薩共住云何#77.195？」
%68.43 （貳）佛答
%68.44 一、相視如世尊
佛告阿難：「菩薩、菩薩共住，相視當如世尊。
何以故？是菩薩摩訶薩應作是念：『是我真伴，共乘一船，彼學我學，所謂檀波羅蜜乃至一切種智。
~2233
%68.45 二、知捨惡習善
若是菩薩雜行、離薩婆若心，我不應如是學；若是菩薩不雜行、不離薩婆若心，我亦應如是學。』
%68.46 三、結成
菩薩摩訶薩如是學者，是為同學。」
^77.3
%69.0 壹、示平等體#77.226
%69.1 （壹）須菩提問
須菩提白佛言#77.227：「世尊！何等是#77.228菩薩摩訶薩等法，菩薩所應學？」#77.229
%69.2 （貳）佛答
%69.3 一、總明所學平等法--內空乃至自相空
「須菩提！內空是菩薩等法，外空乃至自相空是菩薩等法。#77.230
%69.4 二、別舉自相空釋平等法
須菩提！色、色相空，受、想、行，識、識相空，乃至阿耨多羅三藐三菩提、阿耨多羅三藐三菩提相空。須菩提！是名菩薩摩訶薩等法。
%69.5 三、顯所得益
住是等法，得阿耨多羅三藐三菩提。」#77.231
%69.6 貳、教平等學
%69.7 （壹）除顛倒行
須菩提白佛言#77.232：「世尊！若菩薩摩訶薩為色盡故學#77.233，為學薩婆若？為色離故學、為~2238色滅故學，為學薩婆若？為色不生故#77.234學，為學薩婆若？受、想、行、識，亦如是。修行四念處乃至十八不共法盡、離、滅、不生故學#77.235，為學薩婆若？」
佛告須菩提：「如須菩提所說，為色盡、離、滅、不生故學，為學薩婆若；受、想、行、識乃至十八不共法盡、離、滅、不生故學，為學薩婆若。」
%69.8 （貳）明究竟行
%69.9 一、佛反問
佛告須菩提：「於汝意云何？色如，受、想、行、識如，乃至阿耨多羅三藐三菩提如、佛如--是諸如盡、滅、斷不？」#77.236
%69.10 二、須菩提答
須菩提言：「不也！世尊！」
%69.11 三、佛結成
佛告須菩提：「菩薩摩訶薩如是學『如』，為學薩婆若。是『如』，不作證、不滅、不斷。須菩提！菩薩摩訶薩如是學如，為學薩婆若。#77.237
%69.12 參、明等學之利益#77.238
%69.13 （壹）略說學六度等為學薩婆若
須菩提！菩薩摩訶薩如是學，為學六波羅蜜，為學四念處乃至十八不共法。若學六波羅蜜乃至十八不共法，為學薩婆若。須菩提！如是學，為盡諸學邊。
%69.14 （貳）廣明等學之利益
%69.15 一、正明等學之益
如是學，魔、若魔天所不能壞；如是學，直到阿鞞跋致地；如是學，為學佛所行道；如是學，為得擁護，為學大慈大悲，為學淨佛世界#77.239、成就眾生。#77.240
~2239須菩提！如是學，為學三@t25p605a轉十二行法輪轉#77.241故；如是學，為學度眾生；如是學，為學不斷佛種；如是學，為學開甘露門；如是學，為學欲示無為性。
%69.16 二、舉劣說勝
須菩提！下劣之人#77.242不能作是學；如是學者，為欲拔出#77.243沈沒生死眾生。#77.244
菩薩摩訶薩如是學，終不墮地獄、餓鬼、畜生中，終不生邊地，終不生栴陀羅家；終不聾盲、瘖#77.245瘂#77.246、拘癖#77.247，諸根不缺；眷屬成就，終不孤窮#77.248。菩薩如是學，終不殺生乃至終不邪見；如是學，不作邪命活，不攝惡人及破戒者。#77.249
如是學，以方便力故，不生長壽天。何等是方便力？如〈般若波羅蜜品〉中所說。菩薩摩訶薩以方便力故，入四禪、四無量心、四無色定，不隨禪、無量、無色定生。
%69.17 三、得化他利益
須菩提！菩薩如是學，一切法中得清淨#77.250，所謂淨聲聞、辟支佛心。」#77.251
~2240須菩提白佛言：「世尊！一切法本性清淨，云何言菩薩一切法中得清淨？」#77.252
佛告須菩提：「如是！如是！一切諸法本性清淨，若菩薩摩訶薩於是法中心通達、不沒#77.253，即是般若波羅蜜。如是諸法，一切凡夫#77.254不知不見。菩薩摩訶薩為是眾生故，行檀波羅蜜乃至般若波羅蜜，行四念處乃至一切種智。須菩提！菩薩如是學，於一切法中得智、力、無所畏；如是學，為了知一切眾生心所趣向。#77.255
%69.18 肆、歎法勸修
%69.19 （壹）舉喻顯能如說行般若者稀有
譬如大地#77.256，少所處出金銀珍寶；須菩提！眾生亦如是，少所人#77.257能學般若波羅蜜，多墮聲聞、辟支佛地。
須菩提！譬如少所人受行轉輪聖王業，多受行小王業；如是，須菩提！少所眾生行般若波羅蜜、求一切智，多行聲聞、辟支佛道。
須菩提！諸菩薩摩訶薩發心求阿耨多羅三藐@t25p605b三菩提中，少有如說行，多住聲聞、辟支佛地；多有菩薩摩訶薩行般若波羅蜜無方便力故，少所人住阿鞞跋致地。須菩提！以是故，菩薩摩訶薩欲住#77.258阿鞞跋致地、欲在阿鞞跋致數中，應當學是深般若波羅蜜。
%69.20 （貳）學般若功德勝，勸修學
%69.21 一、不生煩惱心
復次，須菩提！菩薩摩訶薩學是般若波羅蜜時，不生慳貪心，不生破戒、瞋恚、懈怠、散亂、愚癡心，不生諸餘過失心。#77.259
%69.22 二、無取相著心
不生取色相、取受想行識相心，#77.260不生取四念處相心，乃至不生取阿耨多羅三藐三菩~2241提相心。何以故？是菩薩摩訶薩行是深般若波羅蜜，無有法可得；以不可得故，於諸法不生心取相。
%69.23 三、總攝諸波羅蜜#77.261
%69.24 （一）法說
須菩提！菩薩摩訶薩如是學深般若波羅蜜，總攝諸波羅蜜，令諸波羅蜜增長，諸波羅蜜悉隨從。何以故？須菩提！是深般若波羅蜜，諸波羅蜜悉入中。#77.262
%69.25 （二）舉喻明理
須菩提！譬如我見中悉攝六十二見；如是，須菩提！是深般若波羅蜜悉攝諸波羅蜜。
須菩提！譬如人死，命根滅故，餘根悉隨滅；如是，須菩提！菩薩摩訶薩行深般若波羅蜜時，諸波羅蜜悉隨從。
%69.26 （三）結成
須菩提！菩薩摩訶薩欲令諸波羅蜜度彼岸，應學深般若波羅蜜。
%69.27 四、超勝一切眾生
%69.28 （一）法說
須菩提！菩薩摩訶薩學是深般若波羅蜜者，出一切眾生之上。
%69.29 （二）舉喻明理
須菩提！於汝意云何？三千大千世界中眾生多不？」
須菩提言：「一閻浮提中眾生尚多，何況三千大千世界！」
佛告須菩提：「若三千大千世界中眾生一時皆得人身，悉得阿耨多羅三藐三菩提；若有菩薩盡形壽供養爾所佛衣服、飲食、臥具、湯藥、資生所須。須菩提！於汝意云何？是人以是因緣故，@t25p605c得福德多不？」
須菩提言：「甚多！甚多！」
佛言：「不如是善男子、善女人學般若波羅蜜如說#77.263行、正憶念，得福多。何以故？般若波羅蜜有勢力，能令菩薩摩訶薩得阿耨多羅三藐三菩提。
%69.30 （三）結成
須菩提！以是故，菩薩摩訶薩欲出一切眾生之上，當學般若波羅蜜。
%69.31 五、得諸善功德
欲為無救護眾生作救護，欲與無歸依眾生作歸依，欲與無究竟道眾生作究竟道，欲為盲者作目，欲得佛功德，欲作#77.264諸佛自在遊戲，欲作佛師子吼，欲#77.265撞擊佛鍾#77.266鼓，~2242欲吹佛唄#77.267，欲昇佛高座說法，欲斷一切眾生疑，當學深般若波羅蜜。
須菩提！菩薩摩訶薩若學深般若波羅蜜，諸善功德無事不得。#77.268」
%69.32 六、雖得二乘功德但直入菩薩位
須菩提白佛言：「世尊！寧#77.269復得聲聞、辟支佛功德不#77.270？」
佛言：「聲聞、辟支佛功德皆能得，但不於中住；以智觀已，直過，入菩薩位中。#77.271
%69.33 七、疾得無上菩提
須菩提！菩薩摩訶薩如是學，近薩婆若，疾得阿耨多羅三藐三菩提。
%69.34 八、堪作世間福田
須菩提！菩薩摩訶薩如是學，為一切世間天、#77.272人、阿修羅作福田。
須菩提！菩薩摩訶薩如是學，過諸聲聞、辟支佛福田之上，疾近薩婆若。
%69.35 九、遠離二乘，疾近佛乘
須菩提！菩薩摩訶薩如是學，是名不捨不離般若波羅蜜，常行般若波羅蜜。
須菩提！菩薩摩訶薩如是學深#77.273般若波羅蜜，當知是不退轉菩薩，疾近薩婆若，遠離聲聞、辟支佛，近阿耨多羅三藐三菩提。
%69.36 伍、明「行法得失」
%69.37 （壹）邪行相──著心取相@yB029p171
須菩提！菩#77.274薩摩訶薩行般若波羅蜜時，若作是念#77.275：『是般若波羅蜜，我以是般若波羅蜜得一切種智。』若如是念，不名行般若波羅蜜。#77.276
~2243
%69.38 （貳）遮邪行相--破是著相@yB029p171
須菩提！若不作是念：『是般若波羅蜜，是人有#77.277般若波羅@t25p606a蜜；是般若波羅蜜法，是人行#77.278般若波羅蜜得阿耨多羅三藐三菩提。』是名行般若波羅蜜。
%69.39 （參）示正行相 -- 破邪著，亦說實相@yB029p171
須菩提！若菩薩作是念：『無是般若波羅蜜，無#77.279人有是般若波羅蜜；無有行是般若波羅蜜得阿耨多羅三藐三菩提。』何以故？一切法如、法性、實際常住故。
如是行，是為菩薩摩訶薩行般若波羅蜜。」#77.280
^78.1
%70.0 壹、歎發菩提心行菩薩道，所有功德勝一切眾生
%70.1 （壹）發心行菩薩道者福德無量
%70.2 一、天主歎發無上菩提心
爾時，釋提桓因#78.3作是念：「菩薩摩訶薩行般若波羅蜜、禪波羅蜜、毘梨耶波羅蜜、羼提波羅蜜、尸羅波羅蜜、檀波羅蜜乃至十八不共法時，出一切眾生之上，何況得阿耨多羅三藐三菩提時！
是諸眾生聞是薩婆若信者，得人中之善利、壽命中最，何況發阿耨多羅三@t25p608a藐三菩提意者！
是眾生能發阿耨多羅三藐三菩提意者，其餘眾生應當願樂。#78.4」
%70.3 二、天主以散華福德，願求三乘者皆得具足
爾時，釋提桓因以天曼陀羅華#78.5而散佛上，發是言：「以此福德，若有求阿耨多羅三藐三菩提者，令此人具足佛法、具足一切種#78.6智、具足自然法；若求聲聞者，令具足聲聞法。世尊！若有菩薩發阿耨多羅三藐三菩提意者，我終不生一念令其轉還，我亦不~2251生一念令其轉還墮聲聞、辟支佛地。#78.7
世尊！我願諸菩薩倍復精進於阿耨多羅三藐三菩提，見眾生生死中種種苦惱，欲利益安樂一切世間天及人、阿修羅；以是心，作是願：『我既自度，亦當度未度者；我既自脫，當脫未脫者；我既安隱，當安未安者；我既滅度，當使未入滅度者得滅度。』#78.8
%70.4 （貳）明隨喜福德無量無邊
%70.5 一、天主問
世尊！善男子、善女人於初發意菩薩功德隨喜心，得幾許福德？#78.9於久發意菩薩功德隨喜心，得幾許福德？於阿鞞跋致菩薩功德隨喜心，得幾許福德？於一生補處菩薩功德隨喜心，得幾許福德？」#78.10
%70.6 二、佛舉喻明福德無量
佛告釋提桓因：「憍尸迦！四天下世界可稱知斤兩，是隨喜心#78.11福德不可稱量。
復次，憍尸迦！是三千大千世界皆可稱知斤兩，是隨喜心福德不可稱量。
復次，憍尸迦！三千大千世界滿中海水，取一髮破為百分，以一分髮渧#78.12取海水，可知渧數，是隨喜心福德不可數知。」#78.13
~2252
%70.7 （參）天主勸學隨喜迴向
釋提桓因白佛言：「世尊！若眾生心不隨喜阿耨多羅三藐三菩提者，皆是魔眷屬；諸心不隨喜者，從魔中來生。何以故？世尊！是諸發#78.14心菩薩為破魔境界故生。
是故欲愛敬三尊者，應生隨喜心；隨喜@t25p608b已，應迴向阿耨多羅三藐三菩提，以不一不二相故。」#78.15
%70.8 （肆）佛稱說隨喜迴向功德
%70.9 一、正明
佛言：「如是！如是！憍尸迦！若有人於菩薩#78.16能如是隨喜迴向者，常值諸佛；終不見惡色，終不聞惡聲，終不嗅惡香，終不食惡味，終不觸惡觸，終不#78.17隨惡念；終不遠離諸佛，從一佛界#78.18至一佛界，親近諸佛、種善根。#78.19
%70.10 二、釋因由
何以故？善男子、善女人為無量阿僧祇初發意菩薩諸善根隨喜迴向，#78.20為無量阿僧祇第二地、第三地乃至第十地、一生補處諸菩薩摩訶薩善根，隨喜迴向阿耨多羅三藐三菩提。以是善根因緣故，疾近阿耨多羅三藐三菩提。是諸菩薩#78.21得阿耨多羅三藐三菩提已#78.22，度無量無邊阿僧祇眾生。#78.23
%70.11 三、勸修
憍尸迦！以是因緣故，善男子、善女人於初發意菩薩善根，應隨喜、迴向阿耨多羅三藐三菩提，非心#78.24、非離心；於久發意、阿鞞跋致、一生補處善根，隨喜、迴向阿耨~2253多羅三藐三菩提，非心、非離心。#78.25
%70.12 貳、正觀成就，得菩提果#78.26
%70.13 （壹）明無分別因行
%70.14 一、須菩提與佛論義
%70.15 （一）約「非即心離心空如幻」義
%70.16 1、須菩提問
須菩提白佛言#78.27：「世尊！是心如幻，云何能得阿耨多羅三藐三菩提？」#78.28
%70.17 2、佛答
%70.18 （1）破如幻心：不見如幻心定相#78.29
佛告須菩提：「於汝意云何？汝見是心如幻不？」
「不也！世尊！我不見幻，亦不見心如幻。」#78.30
%70.19 （2）破有無戲論見：不存有無心戲論#78.31
~2254「須菩提！於汝意云何？若無幻，亦無心如幻，汝見是心不？」
「不也！世尊！」#78.32
%70.20 （3）破離空如幻心外別有法得道者#78.33
「須菩提！於汝意云何？離幻、離心如幻，汝見更有法得阿耨多羅三藐三菩提不？」
「不也！世尊！我不見離幻、離心如幻，更有法得阿耨多羅三藐三菩提。#78.34
%70.21 （二）約「畢竟離」義
%70.22 1、須菩提問：若諸法畢竟離，由何得佛道
世尊！我不見更有法、何等法可說若有若無。是法相畢竟離故，不墮有、不墮無。若法畢竟離者，不能得阿耨多羅三藐三菩提；無所有法，亦不應得阿耨多羅三藐三菩提。@t25p608c何以故？世尊！一切法無所有，是中無垢者、無淨者。世尊！以是故，般若波羅蜜畢竟離，禪波羅蜜、毘梨耶波羅蜜、羼提波羅蜜、尸羅波羅蜜、檀波羅蜜畢竟離，乃至阿耨多羅三藐三菩提亦畢竟離。若法畢竟離，則不應修、不應壞。行般若波羅蜜亦無有法可得，畢竟離故。#78.35
世尊！若般若波羅蜜畢竟離者，云何因般若波羅蜜得阿耨多羅三藐三菩提？阿耨多羅三藐三菩提亦畢竟離，二離中#78.36云何能有所得？」#78.37
~2255
%70.23 2、佛答
%70.24 （1）述成：諸法畢竟離，故得無上菩提
佛告#78.38須菩提：「善哉！善哉！是般若波羅蜜畢竟離，禪波羅蜜、毘梨耶波羅蜜、羼提波羅蜜、尸羅波羅蜜、檀波羅蜜畢竟離，乃至一切種智畢竟離。
須菩提！若般若波羅蜜畢竟離乃至一切種智畢竟離，以是故能得阿耨多羅三藐三菩提。
%70.25 （2）釋因由：雖不離般若得菩提，亦不以離得離
須菩提！若般若波羅蜜非畢竟離乃至一切種智非畢竟離，是不名般若波羅蜜，不名禪波羅蜜乃至一切種智。
須菩提！若般若波羅蜜畢竟離乃至一切種智畢竟離，以是故，須菩提！非不因般若波羅蜜得阿耨多羅三藐三菩提，亦不以離得離，而得阿耨多羅三藐三菩提，非不因般若波羅蜜。#78.39
   %70.26 （三）歎菩薩所行義甚深，論菩薩所行難或不難
%70.27 1、須菩提歎菩薩所行義甚深
須菩提白佛言：「世尊！菩薩摩訶薩所行義甚深！」
%70.28 2、佛說菩薩能為難事
佛言：「如是！須菩提！菩薩摩訶薩所行義甚深。須菩提！諸菩薩摩訶薩能為難事#78.40──所謂行是深義，而不證聲聞、辟支佛地。」#78.41
%70.29 3、須菩提述
%70.30 （1）以第一義諦說菩薩所行不為難
須菩提白佛言：「世尊！如我從佛聞義，菩薩摩訶薩所行不為難。何以故？是菩薩摩訶薩不得是義可作證，亦不得般若波羅蜜作證，亦無作證者。#78.42
~2256世尊！若一切法不可得，何等@t25p609a是義可作證？何等是般若波羅蜜作證？何等是作證者？作證已得阿耨多羅三藐三菩提？世尊！是名菩薩摩訶薩無所得行。菩薩行是，於一切法皆得明了。#78.43
%70.31 （2）通達諸法畢竟空，住實相中無分別
%70.32 A、標宗：聞諸法無所得而不驚怖，是名真行般若
世尊！若菩薩摩訶薩聞是深#78.44法，心不驚、不沒、不怖、不畏，是名為行般若波羅蜜。
%70.33 B、釋因由：住實相中無分別
是菩薩摩訶薩行般若波羅蜜時，不見我行般若波羅蜜，亦不見是般若波羅蜜，亦不見我當得阿耨多羅三藐三菩提。何以故？菩薩摩訶薩行般若波羅蜜時，不作是念：『聲聞、辟支佛地去#78.45我遠，薩婆若去我近。』#78.46
%70.34 C、舉喻明理
%70.35 （A）顯畢竟空義
%70.36 a、虛空喻
世尊！譬如虛空#78.47不作是念：『有法去我遠、去我近。』何以故？世尊！虛空無分別故。
世尊！行般若波羅蜜菩薩亦不作是念：『聲聞、辟支佛地去我遠，薩婆若去我近。』何以故？般若波羅蜜中無分別故。
%70.37 b、幻人喻
世尊！譬如幻人不作是念：『幻師去我近，觀人去我遠。』何以故？幻人無分別故。
行般若波羅蜜菩薩亦#78.48不作是念：『聲聞、辟支佛地去我遠，薩婆若去我近。』#78.49
~2257
%70.38 c、鏡像喻
世尊！譬如鏡中像不作是念：『所因者去我近，餘者去我遠。』#78.50何以故？像無分別故。
行般若波羅蜜菩薩亦不作是念：『聲聞、辟支佛地去我遠，薩婆若去我近。』何以故？般若波羅蜜中無分別故。
%70.39 d、如佛無愛無憎喻
世尊！行般若波羅蜜菩薩無愛無憎。何以故？般若波羅蜜自性不可得故。
世尊！譬如佛#78.51無愛無憎；行般若波羅蜜菩薩無愛無憎亦如是。何以故？般若波羅蜜中無#78.52憎無愛故。#78.53
世尊！譬如佛一切分別想斷；行般若波羅蜜菩薩亦如是，一切分別想斷，畢竟空故。
%70.40 （B）般若雖空，若有所作，能成辦其事
%70.41 a、化人喻
世尊！譬如佛所化人#78.54不作是念：『聲@t25p609b聞、辟支佛去我遠，阿耨多羅三藐三菩提去我近。』何以故？佛所化人無分別故。
行般若波羅蜜菩薩亦如是，不作是念：『聲聞、辟支佛去我遠，阿耨多羅三藐三菩提去我近。』
世尊！譬如有所為故作化，化所作事無分別。
世尊！般若波羅蜜亦如是，有所為事而修是事成就，而般若波羅蜜亦無分別。#78.55
~2258
%70.42 b、木人喻
世尊！譬如工匠、若工匠弟子有所為故作木人，若男、若#78.56女、象、馬、牛、羊#78.57，是所作亦能有所作，是#78.58亦無分別。
世尊！般若波羅蜜亦如是，有所為故說是事成就，而般若波羅蜜亦無分別。」#78.59
%70.43 二、舍利弗與須菩提論義
%70.44 （一）六度皆無分別
%70.45 1、舍利弗問
舍利弗問須菩提：「但般若波羅蜜無分別，禪波羅蜜乃至檀波羅蜜亦無分別？」
%70.46 2、須菩提答
須菩提語舍利弗：「禪波羅蜜無分別，乃至檀波羅蜜亦無分別。」
%70.47 （二）若一切法無分別，云何分別有六道、三乘
%70.48 1、舍利弗問：諸法若無分別，凡聖何有異
舍利弗問須菩提：「色無分別乃至識亦無分別？#78.60眼乃至意無分別？色乃至法無分別？眼識觸乃至意識觸無分別？眼觸因緣生受乃至意觸因緣生受，四禪、四無量心、四無色定，四念處乃至八聖道分，空、無相、無作，佛#78.61十力、四無所畏、四無礙智、大慈大悲、十八不共法，阿耨多羅三藐三菩提，無為性，亦無分別？
須菩提！若色無分別乃至無為性無分別──若一切法無分別，云何分別有六道生死──是地獄、是餓鬼、是畜生、是天、是人、是阿修羅？云何分別是須陀洹、斯陀~2259含、阿那含、阿羅漢、辟支佛、諸佛？」
%70.49 2、須菩提答
%70.50 （1）凡夫顛倒造業故有六道
須菩提報舍利弗：「眾生顛倒因緣故，造作身口意業，隨欲本業報受六道身──地獄、餓鬼、畜生、人、天、阿修羅身。#78.62
%70.51 （2）聖者斷惑知無分別而有三乘
如汝言：『云何分別有須陀洹乃至佛道？』舍利弗！須陀@t25p609c洹即是無分別故有，須陀洹果亦是無分別故有，乃至阿羅漢、阿羅漢果、辟支佛、辟支佛道、佛、佛道，亦是無分別故有。#78.63
舍利弗！過去諸佛亦是無分別、斷分別故有。以是故，舍利弗！當知一切法無有分別、不壞相，如#78.64法如、法性、實際故。#78.65
%70.52 （貳）明無分別果
舍利弗！如是菩薩摩訶薩應行無分別般若波羅蜜；行無分別般若波羅蜜已，便得無分別阿耨多羅三藐三菩提。」
^78.2
%71.0 壹、明菩薩行般若，不見有真實、無真實可得
%71.1 （壹）舍利弗問
舍利弗語須菩提#78.121：「菩薩摩訶薩行般若波羅蜜，為行真實法？為行無真實法？」#78.122
%71.2 （貳）須菩提答
須菩提報舍利弗：「菩薩摩訶薩行般若波羅蜜，為#78.123行無真實法。何以故？是般若波羅蜜無真實，乃至一切種智無真實故。
菩薩摩訶薩行般若波羅蜜，無真實不可得，何況真實！乃至行一切種智，無真實法不可得，何況真實#78.124！」#78.125
%71.3 貳、明菩薩所行甚深
%71.4 （壹）諸天歎──菩薩不證實際，應當禮敬
爾時，欲、色界諸天子作是念：「諸有善男子、善女人發阿耨多羅三藐三菩提意，如深般若波羅蜜所說義，行於等法，不作實際證，不墮聲聞、辟支佛地，應當為作禮！」#78.126
~2272
%71.5 （貳）須菩提歎──知眾生畢竟不可得而復度眾生
%71.6 一、正歎
須菩提語諸天子：「諸菩薩摩訶薩於等法不作證聲聞、辟支佛地，不為難。諸菩薩摩訶薩大誓#78.127莊嚴：『我當度無量無邊阿僧祇眾生。』知眾生畢竟不可得而度眾生，是乃為難！#78.128
%71.7 二、顯「真般若行」
%71.8 （一）約二空說
%71.9 1、眾生空
諸天子！諸菩薩摩訶薩發阿耨多羅三藐三菩提心，作是願：『我當度一切眾生。』眾生實不可得，是人欲度眾生，如欲度虛空。何以故？虛空離故，當知眾生亦離；虛空空故，當知眾生亦空；虛空無堅固#78.129，當知眾生亦無堅固；虛空虛誑，當知眾生亦虛誑。
諸天子！以是因緣故，當知菩薩所作為難。
為利益無所有眾生故而大莊嚴，是人為眾生結誓，為欲與虛空共鬪。是菩薩結誓已，亦不得眾生而為眾生結誓。何以故？眾生離故，當知大誓亦離；眾生虛誑故，@t25p612b當知大誓亦虛誑。#78.130
若菩薩摩訶薩聞是法，心不驚、不沒，當知是菩薩摩訶薩行般若波羅蜜。
%71.10 2、法空
何以故？色離，即是眾生離；#78.131受、想、行、識離，即是眾生離。
色離，即是六波羅蜜離；受、想、行、識離，即是六波羅蜜離。
乃至一切種智離，即是六波羅蜜離。
若菩薩摩訶薩聞是一切諸法離相，心不驚、不沒、不怖、不畏，當知是菩薩摩訶薩行般若波羅蜜。」
~2273
%71.11 （二）約「般若空」說
%71.12 1、佛問
佛告須菩提：「何因緣故，菩薩摩訶薩於深般若波羅蜜中心不沒？」
%71.13 2、須菩提答
須菩提白佛言：「世尊！般若波羅蜜無所有故不沒，般若波羅蜜離故不沒，般若波羅蜜寂滅故不沒。世尊！以是因緣故，菩薩於深般若波羅蜜中心不沒。
何以故？是菩薩不得沒者、不得沒事、不得沒處──是一切法皆不可得故。#78.132
世尊！若菩薩摩訶薩聞是法，心不驚、不沒、不怖、不畏，當知是菩薩為行般若波羅蜜。何以故？沒者、沒事、沒處──是法皆不可得故。
%71.14 參、明「菩薩行般若，諸天禮敬諸佛護念」
%71.15 （壹）諸天禮敬
菩薩摩訶薩如是行般若波羅蜜，諸天及釋提桓因#78.133天、梵天#78.134王天及世界主天皆為作禮。」
佛告須菩提：「不但釋提桓因諸天、梵王及諸天、世界主及諸天禮是菩薩#78.135行般若波羅蜜者，過是上，光音天、遍淨天、廣果天、淨居天皆為是菩薩摩訶薩作禮。
%71.16 （貳）諸佛護念，魔不能壞
%71.17 一、正明十方佛護念
須菩提！今現在十方無量諸佛，亦念是行般若波羅蜜菩薩摩訶薩。當知是菩薩為如佛。須菩提！若恒河沙等世界#78.136中眾生悉使為魔，是一一魔復#78.137化作魔──如恒河沙等魔，是一切魔不能留難菩薩行般若波羅蜜。」
^79.1
$$（貳）諸佛護念，魔不能壞（承上卷78）
$$一、正明十方佛護念（承門卷78）
%71.47 二、魔不能壞
%71.48 （一）觀一切法空，不捨一切眾生
「須菩提！菩薩摩訶薩成就二法，魔不能壞。@t25p613c何等二？觀一切法空，不捨一切眾生。須菩提！菩薩成就此二法，魔不能壞。
%71.49 （二）所作如所言，為諸佛所護念
復次，須菩提！菩薩摩訶薩復有二法成就，魔不能壞。何等二？所作如所言，亦為諸佛所念。菩薩成就此二法，魔不能壞。
%71.50 （參）諸天稱歎
須菩提！菩薩如是行，是諸天皆來至#79.1菩薩所，親近、諮問#79.2、勸喻#79.3、安慰，作是言：『善男子！汝疾得阿耨多羅三藐三菩提不久。善男子！汝常當行是空、無相、無作行。
何以故？善男子！汝行是行，無護眾生汝為作護，無依眾生為作依，無救眾生為作救，無究竟道眾生為作究竟道，無歸眾生為作歸，無洲眾生為作洲，冥者為作明，盲者為作眼。』#79.4
%71.51 （肆）諸佛稱歎
%71.52 一、十方佛自稱揚讚歎
%71.53 （一）稱歎大菩薩
何以故？是菩薩摩訶薩行般若波羅蜜，十方現在無量阿僧祇諸佛在大眾中說法時，自讚歎稱揚是菩薩摩訶薩名姓，言：『某甲菩薩成就般若波羅蜜功德。』#79.5
~2278須菩提！如我今說法時，自稱揚寶相菩薩、尸棄菩薩。
復#79.6有諸菩薩摩訶薩在阿閦佛世界中行般若波羅蜜、淨修梵行，我亦稱揚是菩薩名姓。
須菩提！亦如#79.7東方現在諸佛說法時，是中有菩薩摩訶薩淨修梵行，佛亦歡喜，自稱揚讚歎是菩薩；南西北方、四維、上下，亦如是。
%71.54 （二）稱歎一切菩薩
復有菩薩從初發意欲具足佛道乃至得一切種智；諸佛說法時，亦歡喜自稱揚讚歎是菩薩。何以故？是諸菩薩摩訶薩所行甚難，不斷佛種行。」
%71.55 二、佛所稱歎菩薩之聖德
%71.56 （一）德行勝故佛稱歎
須菩提白佛言：「世尊！何等菩薩摩訶薩，諸佛說法時，自讚歎稱揚？」
佛告須菩提：「阿鞞跋致菩薩，諸佛說法時，自讚歎稱揚。」#79.8
須菩提言：「何等阿鞞跋致菩薩為佛所讚#79.9？」
佛言：「如阿閦佛@t25p614a為菩薩時所行所學，諸菩薩亦如是學；是諸阿鞞跋致菩薩，諸佛說法時，歡喜讚歎。#79.10
%71.57 （二）智慧力勝故佛稱歎
復次，須菩提！有菩薩行般若波羅蜜，信解一切法無生，未得無生忍法；信解一切法空，未得無生忍法；信解一切法虛誑、不實、不堅固，未得無生忍法。須菩提！如是等諸菩薩摩訶薩，佛說法時，歡喜自讚歎稱揚名姓。
~2279須菩提！若諸菩薩摩訶薩，諸佛說法時#79.11，歡喜自讚歎者，是菩薩滅聲聞、辟支佛地，當得阿耨多羅三藐三菩提記。
須菩提！若菩薩摩訶薩，諸佛說法時，歡喜自讚歎者，是菩薩當住阿鞞跋致地；住是地已，當得薩婆若。#79.12
%71.58 （三）信根力勝故佛稱歎
復次，須菩提！若#79.13菩薩摩訶薩聞是深般若波羅蜜，其心明利、不疑不悔，作是念：『是事如佛所說。』是菩薩亦當於阿閦佛及諸菩薩所廣聞是般若波羅蜜，亦信解；信解已，如佛所說，當住阿鞞跋致地。
如是，須菩提！但聞般若波羅蜜，得大利益，何況信解！信解已，如說住、如說行；如說住#79.14、行已，住一切種智中。」
%71.59 （伍）住如中即住薩婆若
%71.60 一、述義
須菩提白佛言：「世尊！若佛說：『菩薩摩訶薩如所說住、如所說行，住薩婆若。』若菩薩摩訶薩無所得法，云何住薩婆若？」#79.15
佛告須菩提：「菩薩摩訶薩住諸法如中，住薩婆若。」#79.16
%71.61 二、除如更無餘法可得，而如亦復空
%71.62 （一）須菩提問
須菩提言：「世尊！除如，更無法可得，誰住如中？住如中已，當得阿耨多羅三藐三菩提？誰住如中當說法？如尚不可得，何況住如得阿耨多羅三藐三菩提！誰住如中而說法？無有是處！」#79.17
~2280
%71.63 （二）佛述義明理
佛告須菩提：「如汝所言#79.18：『除如，更無法，誰住如中？住如中已，當得阿耨多羅三藐三菩提？誰住如中當說法？如尚不可得，@t25p614b何況住如得阿耨多羅三藐三菩提！誰住如中而說法？無有是處！』」
佛言：「如是！如是！須菩提！除如，更無有法可得，誰住如中？住如中已，當得阿耨多羅三藐三菩提？誰住如中當說法？如尚不可得，何況住如中得阿耨多羅三藐三菩提！誰住如中而說法？
何以故？是如生不可得、滅不可得、住異不可得；若法生、滅、住異不可得，是中誰當住如？誰當住如已，得阿耨多羅三藐三菩提？誰當住如而說法？無有是處！」#79.19
%71.64 （陸）歎菩薩深行，讚須菩提說空無礙
%71.65 一、天主歎菩薩難行能行
釋提桓因白佛言：「世尊！諸菩薩摩訶薩所為甚難──深般若波羅蜜中欲得阿耨多羅三藐三菩提。何以故？世尊！無有如中住者，亦無當得阿耨多羅三藐三菩提者，亦無說法者。菩薩摩訶薩於是處心不驚、不沒，不怖、不畏，不疑、不悔。」#79.20
%71.66 二、須菩提反責：諸法空，誰驚怖，何有難事
爾時，須菩提語釋提桓因：「如#79.21憍尸迦說：『菩薩摩訶薩所為甚難，是甚深法中心不驚、不沒，不怖、不畏，不疑、不悔。』憍尸迦！諸法空中誰驚、誰沒？誰怖、誰畏？誰疑、誰悔？」
%71.67 三、天主讚須菩提說空無礙
是時，釋提桓因語須菩提：「須菩提所說，但為空事，無所罣礙。譬如仰射空中，箭去無礙；須菩提說法無礙亦如是。」#79.22
^79.2
%72.0 壹、讚菩薩般若行殊勝，勸修學#79.64
%72.1 （壹）佛印可天主及須菩提
%72.2 一、佛印可天主
%72.3 （一）天主問
爾時，釋提桓因白佛#79.65言：「世尊！我如是說、如是答，為隨順法不？為正答不？」
%72.4 （二）佛述成
佛告釋提桓因言：「憍尸迦！汝所說、所答，實皆隨順。」
%72.5 二、佛印可須菩提
%72.6 （一）天主歎須菩提說空善巧
釋提桓因言：「希有！世尊！須菩提所#79.66樂說皆為#79.67空、為無相、無作，為四念處乃至為阿耨多羅三藐三菩提。」#79.68
%72.7 （二）佛讚須菩提行空時，觀諸法及行法者皆不可得
佛告釋提桓因：「須菩提比丘行空時，檀波羅蜜不可得，何況行檀波羅蜜者！乃至般若波羅蜜不可得，何況行般若波羅蜜者！四念處不可得，何況修四念處者！乃至八聖道分不可得，何況修八聖道分者！禪、解脫、三昧、定不可得，何況修禪、解脫、三昧、定者！佛十力不可得，何況修佛十力者！四無所畏不可得，何況能生四無所~2288畏者！四無礙智不可得，何況能#79.69生四無礙智者！大慈、大悲不可得，何況行大慈、大悲者！十八不共法不可得，何況生十八不共法者！阿耨多羅三藐三菩提不可得，何況得阿耨多羅三藐三菩提者！一切智不可得，何況得一切智者！如來不可得，@t25p616b何況當作如來者！無生法不可得，何況#79.70無#79.71生法作證者！三十二相不可得，何況得三十二相者！八十隨形好不可得，何況得八十隨形好者！
何以故？憍尸迦！須菩提比丘一切法離行、一切法無所得行、一切法空行、一切法無相行、一切法無作行。#79.72
%72.8 （貳）較量功德，顯菩薩般若行超勝
%72.9 一、校德：「菩薩般若行」勝「須菩提空行」
憍尸迦！是為須菩提比丘所行，欲比菩薩摩訶薩般若波羅蜜行，百分不及一，千分、千萬億分乃至算數譬喻所不能及。
何以故？除佛行，是菩薩摩訶薩行般若波羅蜜於#79.73聲聞、辟支佛諸行中最尊、最妙、最上。#79.74
%72.10 二、顯勝：菩薩行般若，過二乘地，入菩薩位，當得無上菩提
以是故，菩薩摩訶薩欲得於一切眾生中最上，當行是般若波羅蜜行。
何以故？憍尸迦！諸菩薩摩訶薩行般若波羅蜜時，過聲聞、辟支佛地，入菩薩位，能具足佛法，得一切種智，斷一切煩惱習，作佛。」
%72.11 （參）眾中有多比丘發大心，佛為授大菩提記
%72.12 一、諸天散花供養
是會中諸三十三天以天文#79.75陀羅花散佛及僧。
%72.13 二、佛授記八百比丘成佛
%72.14 （一）八百比丘發願行無上菩薩道
是時，八百比丘從坐起，以華散佛，偏袒右肩，合掌，右膝著地，白佛言：「世尊！我等當行是無上行──聲聞、辟支佛所不能行！」#79.76
%72.15 （二）佛為現瑞授記
爾時，佛知諸比丘心行，便微笑。如諸佛法，種種色光──青、黃、赤、白、紅、~2289縹#79.77，從口#79.78中出，遍照三千大千世界，遶佛三匝，還從頂入。
爾時，阿難偏袒右肩，右膝著地，白佛言：「世尊！何因緣故#79.79笑#79.80？諸佛不以無因緣而笑！」
佛告阿難：「是八百比丘於星宿劫#79.81中當得阿耨多羅三藐三菩提，佛名散華，皆同一字，比丘僧、世界#79.82、壽命皆等，各各過十萬歲，出家、作佛，是時諸世界#79.83常雨五色天花#79.84。#79.85
%72.16 三、結歎勸修般若
　以是故，阿難！菩薩摩訶薩欲行最上行，當#79.86行般若波羅蜜！」
%72.17 （肆）讚菩薩能行深般若，並勸修
%72.18 一、明「能行深般若者之德相」
%72.19 （一）能行深般若者，從人道或兜率天上來
佛告阿難：「若有善男子、@t25p616c善女人能行是深般若波羅蜜，當知是菩薩人中死、此間生，若兜率天上死、來生此間，若人中、若兜率天上廣聞是深般若波羅蜜。阿難！我見是諸菩薩摩訶薩能行是深般若波羅蜜。
%72.20 （二）親從佛聞般若、種善根，並以般若教化他人
阿難！若有善男子、善女人聞是深般若波羅蜜，受持、讀、誦、親近、正憶念，轉復以般若波羅蜜教行菩薩道者，當知是菩薩面#79.87從佛聞深般若波羅蜜，乃至親近，亦從諸佛所#79.88種善根。#79.89
~2290善男子、善女人當作是念：『我等非聲聞所種善根，亦不從聲聞所聞是深般若波羅蜜。』
阿難！若有善男子、善女人受持是深般若波羅蜜，讀、誦、親近、隨義隨法行，當知是善男子、善女人則為面見佛。#79.90
%72.21 （三）供養諸佛、多種善根、善知識守護故，信心清淨不可破壞
阿難！若有善男子、善女人聞是深般若波羅蜜，信心清淨，不可沮#79.91壞，當知是善男子、善女人曾供養諸#79.92佛、種善根、與善知識相得。
%72.22 二、欲以三乘得解脫、得無上菩提，應了了行六度乃至一切種智
阿難！於諸佛福田種善根雖不虛誑，要得聲聞、辟支佛、佛而得解脫，應當深了了#79.93行六波羅蜜乃至一切種智。#79.94
阿難！若菩薩深了了行六波羅蜜乃至一切種智，是人若住聲聞辟支佛道、不得阿耨多羅三藐三菩提，無有是處！#79.95
%72.23 貳、正明囑累
%72.24 （壹）付法勸流通
%72.25 一、正囑累
是故，阿難！我以般若波羅蜜囑累汝！
%72.26 二、受持般若有大功德，忘失般若有大罪
%72.27 （一）明忘失之過罪
   ~2291阿難！汝若受持一切法，除般若波羅蜜，若忘若失，其過小小，無有大罪。
   阿難！汝受持深般若波羅蜜，若忘#79.96失一句，其過甚大！
   阿難！汝若受持深般若波羅蜜，後#79.97還忘失，其罪甚多！
   以是故，阿難！囑累汝！是深般若波羅蜜，汝當善受持、讀、誦，令利！#79.98
%72.28 （二）明受持之功德
%72.29 1、若受持般若則為受持三世佛菩提#79.99
阿難！若有善男子、善女人受持般#79.100若波羅蜜，則為受持過去、未來、現在諸@t25p617a佛阿耨多羅三藐三菩提。
%72.30 2、若供養般若即為供養三世如來
阿難！若善男子、善女人現在供養我，恭敬、尊重、讚歎，華香、瓔珞、擣#79.101香#79.102、澤香#79.103、衣服、幡蓋，應當受持般若波羅蜜，讀、誦、說、親近、供養、恭敬、尊重、讚歎，華香乃至幢幡#79.104。
阿難！供養般若波羅蜜，則為供養我，亦供養過去、未來、現在佛已。
%72.31 3、若信心愛樂般若則為信心愛樂三世佛
若有善男子、善女人聞說深般若波羅蜜，信心清淨恭敬愛樂，則為信心清淨恭敬愛樂過去、未來、現在諸佛已。
阿難！汝愛樂佛、不捨離，當愛樂般若波羅蜜，莫捨離！
%72.32 4、般若亦是世尊，欲不捨三寶、三世佛菩提，切莫捨般若
阿難！深般若波羅蜜，乃至一句，不應令失！
阿難！我說囑累因緣甚多，今但略說：如我為世尊，般若波羅蜜亦是世尊。
以是故，阿難！種種因緣囑累汝般若波羅蜜。阿難！今我於一切世間人、天#79.105、阿修羅眾#79.106中囑累汝。諸欲不捨佛、不捨法、不捨僧、不捨過去、未來、現在諸佛阿~2292耨多羅三藐三菩提者，慎莫捨般若波羅蜜。阿難！是我所教化弟子法。#79.107
%72.33 5、般若為三世諸佛之母，自受持並為他廣說，能速得無上菩提
阿難！若善男子、善女人受持深般若波羅蜜，讀、誦、說、正憶念，復為他人種種廣說其義，開示、演暢、分別，令易解，是善男子、善女人疾得阿耨多羅三藐三菩提、疾近薩婆若。何以故？般若波羅蜜中生諸佛阿耨多羅三藐三菩提。阿難！過去、未來諸佛阿耨多羅三藐三菩提，皆從般若波羅蜜中生；今現在東方、南方、西方、北方、四維、上下諸佛阿耨多羅三藐三菩提，亦從般若波羅蜜中#79.108生。
%72.34 6、六波羅蜜是諸佛無盡法藏，三世諸佛及佛弟子皆從中學而得成就
以是故，阿難！諸菩薩摩訶薩欲得阿耨多羅三藐三菩提，應當學六波羅蜜！
何以故？阿難！六波羅蜜是菩薩摩訶薩母，生諸@t25p617b菩薩故。阿難！若有菩薩摩訶薩學是六波羅蜜，皆當得阿耨多羅三藐三菩提。
以是故，我以六波羅蜜倍復囑累汝。
阿難！是六波羅蜜是諸佛無盡法藏。阿難！十方諸佛現在說法，皆從六波羅蜜法藏中出。過去諸佛亦從六波羅蜜中學，得阿耨多羅三藐三菩提；未來諸佛亦從六波羅蜜中學，得阿耨多羅三藐三菩提；現在諸佛亦從六波羅蜜中學，得阿耨多羅三藐三菩提#79.109；過去、未來、現在諸佛弟子皆從六波羅蜜中學，得滅度──已得#79.110、今得、當得滅度。
%72.35 7、「以般若相應法教菩薩」勝「令三千世界眾生盡得阿羅漢」
%72.36 （1）正述
阿難！汝為諸#79.111聲聞人說法，令三千大千世界中眾生皆得阿羅漢果證，猶未為我弟子事；汝若以般若波羅蜜相應一句教菩薩摩訶薩，則為我弟子事，我亦歡喜，勝教三千大千世界中眾生令得阿羅漢果。#79.112
復次，阿難！是三千大千世界中眾生不前不後、一時皆得阿羅漢果證；是諸阿羅~2293漢行布施功德、持戒、禪定功德，是功德多不？」
阿難言：「甚多！世尊！」
佛言：「阿難！不如弟子以般若波羅蜜相應法為菩薩摩訶薩說，乃至一日，其福多#79.113！置#79.114一日，但半日；置半日，但一食#79.115頃#79.116；置一食頃，但須臾#79.117間說，其福多！
%72.37 （2）釋因由
何以故？菩薩摩訶薩善根勝一切聲聞、辟支佛故。菩薩摩訶薩自欲得阿耨多羅三藐三菩提，亦示、教、利、喜他人，令得阿耨多羅三藐三菩提。#79.118
%72.38 （3）結成
阿難！如是菩薩行六波羅蜜，行四念處乃至行一切種智，增益善根，若不得阿耨多羅三藐三菩提，無有是處！」#79.119
%72.39 （貳）佛現攝神足，顯般若無所著
%72.40 一、佛現攝神足顯阿閦佛會如幻，能如是觀，是為無所著般若行
說是〈般若波羅蜜品〉時#79.120，佛在四眾中、天、人、龍、鬼神、甄陀#79.121羅、摩睺羅伽等──@t25p617c於大眾前而現神足變化──一切大眾皆見阿閦佛，比丘僧圍繞，說法；大眾譬如大海水#79.122，皆是阿羅漢──漏盡、無煩惱，皆得自在，得好解脫──心好#79.123解脫，慧好解脫；其心調柔，譬如大象；所作以#79.124辦，逮#79.125得己利，盡諸有結，正智~2294得解脫；一切心、心數法中得自在；及諸菩薩摩訶薩無量功德成就。
爾時，佛攝#79.126神足，一切大眾不復見阿閦佛、聲聞人、菩薩摩訶薩及其世界，不與眼作對#79.127。何以故？佛攝神足故。#79.128
爾時，佛告阿難：「如是，阿難！一切法不與眼作對，法法不相見、法法不相知。#79.129
如是，阿難！如阿閦佛、弟子、菩薩、世界，不與眼作對；如是，阿難！一切法不與眼作對，法法不相知、法法不相見。何以故？一切法無知、無見、無作、無動、不可捉、不可思議，如幻人無受、無覺、無真實。
菩薩摩訶薩如是行，為行般若波羅蜜，亦不著諸法。
阿難！菩薩摩訶薩如是學，名為學般若波羅蜜。#79.130
%72.41 二、讚欲得諸波羅蜜，當學般若
欲得諸波羅蜜，當學般若波羅蜜。何以故？如是學名為第一學、最上學、微妙學；如是學，安樂、利益一切世間#79.131，無護者為作護，是諸佛所#79.132學。
諸佛住是學中，能以右手舉三千大千世界，還著本處，是中眾生無覺知者。何以故？阿難！諸佛學是般若波羅蜜，過去、未來、現在法中得無礙智見。#79.133
阿難！如#79.134般若波羅蜜於諸學中最尊、第一、微妙、無上。
~2295
%72.42 （參）歎般若無量
%72.43 一、正說：般若無量，名眾、句眾、字眾有量
阿難！若#79.135有人欲得般若波羅蜜邊際，為欲得虛空邊際。
何以故？阿難！般若波羅蜜無有量，我初不說般若波羅蜜量；名眾、句眾#79.136、字眾是有量，般若波羅蜜無有量。」#79.137
%72.44 二、釋因由：無盡、離、無生故無量
阿難白佛言：「世尊！般@t25p618a若波羅蜜何以故無有量？」
佛告阿難：「般若波羅蜜無盡故無有量，般若波羅蜜離故無有量。阿難！過去諸佛皆學般#79.138若波羅蜜得度，般若波羅蜜故不盡；未來世諸佛亦學是般若波羅蜜得度，是般若波羅蜜故不盡；現在十方諸佛皆學是#79.139般若波羅蜜得度，般若波羅蜜故不盡──已不盡、今不盡、當不盡。
阿難！欲盡般若波羅蜜，為欲盡虛空。般若波羅蜜不可盡──已不盡、今不盡、當不盡，禪波羅蜜乃至檀波羅蜜不可盡──已不盡、今不盡、當不盡，乃至一切種智亦如是。
何以故？是一切法皆無生；若法無生，云何有盡？」#79.140
%72.45 （肆）佛出覆面舌相令信受般若
爾時，佛出覆面舌相，告阿難：「從今日，於四眾中廣演、開示、分別般若波羅蜜，當令分明易解。何以故？是深般若波羅蜜中廣說諸法相。是中求聲聞辟支佛、求佛者，皆當於中學；學已，各得成就。#79.141
%72.46 （伍）廣說般若功德
~2296
%72.47 一、學般若能入文字陀羅尼門、得樂說辯才
阿難！是深般若波羅蜜則是一切字門；行是深般若波羅蜜，能入陀羅尼門；學是陀羅尼門#79.142，諸菩薩得一切樂說辯才。#79.143
%72.48 二、受持般若即能持三世諸佛無上菩提
阿難！般若波羅蜜是三世諸佛妙法。以是故，阿難！我為汝了了說，若有人受持深般若波羅蜜，讀、誦、親近，是人則能持三世諸佛阿耨多羅三藐三菩提。
%72.49 三、般若是行者足，能持般若陀羅尼，則能總持一切佛法
阿難！我說般若波羅蜜是行者足。汝持是般若波羅蜜陀羅尼故，則能持一切諸#79.144法。#79.145」
^80.1
%73.0 壹、明「方便慧體」#80.3
%73.1 （壹）論「般若無盡」
~2307
%73.2 一、須菩提問
爾時，須菩提作是念#80.4：「是諸佛阿耨多羅三藐三菩提甚深，我當問佛。」作是念已，白佛言：「世尊！是般若波羅蜜不可盡？」#80.5
%73.3 二、佛答
佛言：「虛空#80.6不可盡故，般若波羅蜜不可盡。」#80.7
%73.4 （貳）論「般若生」
%73.5 一、須菩提問
「世尊！云何應生般若波羅蜜？」
%73.6 二、佛答
%73.7 （一）觀五蘊乃至一切種智無盡
佛言：「色不可盡故#80.8，般若波羅蜜應生；受、想、行、識不可盡故，般若波羅蜜應生。
檀波羅蜜不可盡故，般若波羅蜜應生；尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜不可盡故，般若波羅蜜應生；乃至一切種智不可盡故，般若波羅蜜@t25p621a應生。#80.9
~2308
%73.8 （二）觀十二因緣空無盡
復次，須菩提！癡空不可盡故，菩薩摩訶薩般若波羅蜜應生；#80.10行空不可盡故，菩薩般若波羅蜜應生；識空不可盡故，菩薩般若波羅蜜應生；名色空不可盡故，菩薩般若波羅蜜應生；六處空不可盡故，菩薩般若波羅蜜應生；六觸空不可盡故，菩薩般若波羅蜜應生；受空不可盡故，菩薩般若波羅蜜應生；愛空不可盡故，菩薩般若波羅蜜應生；取空不可盡故，菩薩般若波羅蜜應生；有空不可盡故，菩薩般若波羅蜜應生；生空不可盡故，菩薩般若波羅蜜應生；老死憂悲苦惱空不可盡故，菩薩般若波羅蜜應生。#80.11
如是，須菩提！菩薩摩訶薩般若波羅蜜應生。
%73.9 貳、十二因緣之妙用
%73.10 （壹）十二因緣是獨菩薩法，能除諸邊、顛倒，唯坐道場者能觀
須菩提！是#80.12十二因緣，是獨#80.13菩薩法#80.14，能除諸邊、顛倒#80.15。
坐道場時#80.16，應如是觀，當得一切種智。#80.17
~2309
%73.11 （貳）不墮二乘地，疾證無上道
須菩提！若有菩薩摩訶薩以虛空不可盡法，行般若波羅蜜，觀十二因緣，不墮聲聞、辟支佛地#80.18，住阿耨多羅三藐三菩提。#80.19
須菩提！若求菩薩道而轉還者#80.20，皆#80.21離般若波羅蜜念故；是人不知云何行般若波羅蜜，以虛空不可盡法觀十二因緣。
須菩提！若求菩薩道而轉還者，皆不得是方便力故，於阿耨多羅三藐三菩提而轉還。#80.22
須菩提！若菩薩摩訶薩於阿耨多羅三藐三菩提不轉還者，皆得是方便力故。
須菩提！菩薩摩訶薩應以虛空不可盡法觀般若波羅蜜，應以虛空不可盡法生般若波羅蜜。#80.23
%73.12 （參）不見法無因生，不見法常不滅
如是，須菩提！菩薩摩訶薩觀十二因緣時，不見法無因緣生#80.24，不見法常不滅。#80.25
~2310
%73.13 （肆）除我見，不見法有我乃至知者、見者
不見法有我#80.26、人、壽者、命者、眾生#80.27，知者、見者。#80.28
%73.14 （伍）一切法不可得，除法見，不見法常、無常等
不見@t25p621b法無常#80.29，不見法苦，不見法無我，不見法寂滅、非寂滅。
如是，須菩提！菩薩摩訶薩行般若波羅蜜，應如是觀十二因緣。#80.30
須菩提！若菩薩摩訶薩能如是行般若波羅蜜，是時不見色──若常、若無常，若苦、若樂，若我、若無我，若寂滅、若非寂滅；受、想、行、識亦如是。
須菩提！菩薩摩訶薩是時亦不見般若波羅蜜，亦不見以是法見般若波羅蜜；禪波羅蜜，乃至阿耨多羅三藐三菩提，亦不見阿耨多羅三藐三菩提，亦不見以是法見阿耨多羅三藐三菩提。
如是，須菩提！一切法#80.31不可得故，是為應般若波羅蜜行。#80.32
%73.15 （陸）眾魔憂愁，天、人、阿修羅等無能壞
若菩薩行無所得般若波羅蜜時，惡魔愁毒#80.33，#80.34如箭入心。
譬如人新喪父母；如是，須菩提！惡#80.35魔見菩薩行無所得般若波羅蜜時，便大愁毒，如箭入心。」
須菩提白佛言：「世尊！但一魔愁毒，三千大千世界中魔亦復愁毒？」
佛告須菩提：「三千大千世界中諸惡魔皆愁毒，如箭入心，各於其坐不能自安。
~2311須菩提！菩薩摩訶薩能如是行般若波羅蜜，是時一切世間天及人、阿修羅不能得其便令其憂惱。
須菩提！以是故，菩薩摩訶薩欲得阿耨多羅三藐三菩提，當行是般若波羅蜜！
%73.16 參、行無所得方便，能具足六度
%73.17 （壹）正說
菩薩摩訶薩行般若波羅蜜時，具足修檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜。須菩提！菩薩摩訶薩行般若波羅蜜時，具足諸波羅蜜。」#80.36
%73.18 （貳）示修
%73.19 一、須菩提問
須菩提白佛言：「世尊！菩薩摩訶薩行般若波羅蜜時，云何具足檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜？」
%73.20 二、佛答
佛告須菩提：「@t25p621c菩薩摩訶薩所有布施皆迴向薩婆若。如是，須菩提！菩薩摩訶薩行般若波羅蜜時，具足檀波羅蜜。#80.37
須菩提！菩薩摩訶薩所有持戒皆迴向薩婆若，是為具足尸羅波羅蜜。
菩薩摩訶薩所有忍辱皆迴向薩婆若，是為具足羼提波羅蜜。
菩薩摩訶薩所有精進皆迴向薩婆若，是為具足毘梨耶波羅蜜。
菩薩摩訶薩所有禪定皆迴向薩婆若，是為具足禪波羅蜜。
菩薩摩訶薩所有智慧皆迴向薩婆若，是為具足般若波羅蜜。
如是，須菩提！菩薩摩訶薩行般若波羅蜜，具足六波羅蜜。」#80.38
^80.2
%74.0 壹、布施攝餘五度
%74.1 （壹）布施攝戒
須菩提白佛言：「世尊！云何菩薩摩訶薩住檀波羅蜜取尸羅波羅蜜？」
佛告須菩提：「菩薩摩訶薩布施時，持是布施迴向薩婆若，於眾生中住慈身口意業。是為菩薩住檀波羅蜜取尸羅波羅蜜。」#80.102
%74.2 （貳）布施攝忍
「世尊！云何菩薩住檀波羅蜜取羼提波羅蜜？」
佛告須菩提：「菩薩布施時，受者嗔恚罵辱、惡言加之；是時菩薩忍辱，不生瞋心。是為菩薩住檀波羅蜜取羼提波羅蜜。」
%74.3 （參）布施攝勤
「世尊！云何菩薩住檀波羅蜜取毘梨耶波羅蜜？」
佛言：「菩薩布施時，受者瞋恚罵辱、惡言#80.103加之；菩薩增益布施，心作是念：『我應當施，不應有所惜。』即時生身精進、心精進。是為菩薩住檀波羅蜜取毘梨耶波羅蜜。」
%74.4 （肆）布施攝禪
「世尊！云何菩薩摩訶薩住檀波羅蜜取禪波羅蜜？」
佛言：「菩薩布施時，迴向薩婆若，不趣聲聞、辟支佛地，但一心念薩婆若。是為菩薩住檀波羅蜜取禪波羅蜜。」
%74.5 （伍）布施攝慧
「世尊！云何菩薩摩訶薩住檀波羅蜜取般若波羅蜜？」
佛言：「菩薩布施時，知布施空如幻，不見為眾生布施有益、無益。#80.104是為菩薩住檀波~2322羅蜜取般若波羅蜜。」
%74.6 貳、持戒攝餘五度
%74.7 （壹）持戒攝施
須菩提白佛言：「世尊！云何菩薩摩訶薩住尸羅波羅蜜取檀波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、@t25p623c禪波羅蜜、般若波羅蜜？」
佛告須菩提：「菩薩摩訶薩住尸羅波羅蜜中，身、口、意生布施福德，助阿耨多羅三藐三菩提；持是功德，不取聲聞、辟支佛地。
住尸羅波羅蜜中，不奪他命、不劫奪他#80.105物、不行邪婬，不妄語、不兩舌、不惡口、不綺語，不貪嫉、不瞋恚、不邪見。
所有布施，飢者與食，渴者與飲，須乘與乘，須衣與衣，須香與香，須瓔珞與瓔珞，塗香、臥具、房舍、燈燭、資生所須盡給與之。
持是布施，與眾生共之，迴向阿耨多羅三藐三菩提。如是迴向，不墮聲聞、辟支佛地。
須菩提！是為菩薩摩訶薩住尸羅波羅蜜取檀波羅蜜。」#80.106
%74.8 （貳）持戒攝忍
「世尊！云何菩薩摩訶薩住尸羅波羅蜜取羼提波羅蜜？」
佛言：「菩薩摩訶薩住尸羅波羅蜜中，若有眾生來節節支解，菩薩於是中不生瞋恚心乃至一念，作是言：『我得大利！眾生來取我支節用，我無一念瞋恚。』
是為菩薩住尸羅波羅蜜中取羼提波羅蜜。」
%74.9 （參）持戒攝勤
「世尊！云何菩薩摩訶薩住尸羅波羅蜜取毘梨耶波羅蜜？」
佛言：「若菩薩摩訶薩身精進、心精進，常不捨，作是念：『一切眾生在生死中，我當拔，著甘露地#80.107。』是為菩薩住尸羅波羅蜜中取毘梨耶波羅蜜。」
%74.10 （肆）持戒攝襌
「世尊！云何菩薩摩訶薩住尸羅波羅蜜取禪波羅蜜？」
佛言：「菩薩入初禪，第二、第三、第四禪，不貪聲聞、辟支佛地，作是念：『我當住禪波羅蜜中，度一切眾生生死。』是為菩薩#80.108住尸羅波羅蜜取禪波羅蜜。」
%74.11 （伍）持戒攝慧
「世尊！云何菩薩摩訶薩住尸羅波羅蜜取般若波羅蜜？」
~2323佛言：「菩薩住尸羅波羅蜜中，無有法可見──若作法，若有為法#80.109，若@t25p624a數法，若相法，若有、若無；但見諸法不過如相。以般若波羅蜜、漚和拘舍羅力故，不墮聲聞、辟支佛地。是為菩薩住尸羅波羅蜜取般若波羅蜜。」#80.110
^81.1
%74.67 參、忍辱攝餘五度
%74.68 （壹）忍辱攝施
須菩提白佛言：「世尊！云何菩薩摩訶薩住羼提波羅蜜取檀波羅蜜？」
%74.69 一、忍眾生瞋害，隨眾生所須盡皆與之
佛言：「菩薩從初發心乃至坐#81.2道場，於其中間，若一切眾生來瞋恚罵詈、若節節支解，菩薩住於忍辱，作是念：『我應布施一切眾生，不應不與；是眾生須食與食、須飲與飲，乃至資生所須，盡皆與之。
%74.70 二、迴向無上道，不生二種心
持是功德與一切眾生共之，迴向阿耨多羅三藐三菩提。』是菩薩迴向時不生二心：誰迴向者？迴向何處？
是為菩薩住羼提波羅蜜取檀波羅蜜。」
%74.71 （貳）忍辱攝戒
「世尊！云何菩薩摩訶薩住羼提波羅蜜取尸羅波羅蜜？」
%74.72 一、不行十不善道，不貪二乘地
佛言：「菩薩從初發心乃至坐道場，於其中間，終不奪他命、不與不#81.3取，乃至不邪見，亦不貪聲聞、辟支佛地。
%74.73 二、迴向無上道，不生三種心
持是功德與一切眾生共之，迴向阿耨多羅三藐三菩提。是菩薩迴向時三種心不生#81.4：誰迴向阿耨多羅三藐三菩提？用何法迴向？迴向何處？
是為菩薩住羼提波羅蜜取尸羅波羅蜜。」
%74.74 （參）忍辱攝勤
「世尊！云何菩薩摩訶薩住羼提波羅蜜取毘梨耶波羅蜜？」
~2330佛言：「菩薩住羼提波羅蜜生精進，作是念：『我當往一由旬#81.5，若十由旬、百千萬億由旬，過一世界#81.6乃至過百千萬億世界，乃至教一人令持五戒，何況令得須陀洹果乃至阿羅漢果、辟支佛道、阿耨多羅三藐三@t25p626b菩提！持是功德與一切眾生共之，迴向阿耨多羅三藐三菩提。
是為菩薩住羼提波羅蜜取毘梨耶波羅蜜。」#81.7
%74.75 （肆）忍辱攝襌
「世尊！云何菩薩摩訶薩住羼提波羅蜜取禪波羅蜜？」
佛言：「菩薩住羼提波羅蜜，離欲、離惡不善法，有覺有觀，離生喜樂，入初禪，乃至入第四禪#81.8。是諸禪中淨心、心數法，皆迴向薩婆若；迴向時，是菩薩諸禪及禪支#81.9皆不可得。
是為菩薩住羼提波羅蜜取禪波羅蜜。」#81.10
%74.76 （伍）忍辱攝慧
「世尊！云何菩薩摩訶薩住羼提波羅蜜取般若波羅蜜？」
佛言：「菩薩住羼提波羅蜜，觀諸法若離相、若寂滅相、若無盡相，不以寂滅#81.11相作證，乃至坐道場，得一切種智；從道場起，便轉法輪。
是為菩薩住羼提波羅蜜取般若波羅蜜，不取不#81.12捨故。」#81.13
~2331
%74.77 肆、精進攝餘五度
%74.78 （壹）精進攝施
須菩提白佛言：「世尊！云何菩薩摩訶薩住毘梨耶波羅蜜取檀波羅蜜？」
佛告須菩提：「菩薩住毘梨耶波羅蜜，身心精進，不懈不息#81.14，作是念：『我必應當得阿耨多羅三藐三菩提，不應不得。』
是菩薩為利益眾生故，往一由旬、若百千萬億由旬，若過一世界、若過十世界#81.15、若過百千萬億世界，住毘梨耶波羅蜜中，若不能#81.16得一人教令入佛道中、若聲聞道中、若辟支佛道中，或得一人教令行十善道，精進不懈，法施及以財施令具足。
持是功德與眾生共之，迴向阿耨多羅三藐三菩提，不迴向聲聞、辟支佛地。
是為菩薩住毘梨耶波羅蜜取檀波羅蜜。」#81.17
%74.79 （貳）精進攝戒
「世尊！云何菩薩摩訶薩住毘梨耶波羅蜜取尸羅波羅蜜？」
%74.80 一、依四種正行勤修十善道，不貪三界福，不證二乘地
佛言：「菩薩住毘梨耶波羅蜜，從初發意乃至坐道場，自不殺生，不教他@t25p626c殺，讚不殺生法，歡喜讚歎不殺生者；乃至自遠離邪見，教他遠離邪見，讚不邪見法，歡喜讚歎不邪見者。
%74.81 二、不貪三界福，不證二乘地
是菩薩住#81.18尸羅波羅蜜因緣，不求欲界、色界、無色界福，不求聲聞、辟支佛地。
%74.82 三、迴向無上道，不生三種心
持是功德與眾生共之，迴向阿耨多羅三藐三菩提，不生三種心：不見迴向者，不見迴向法，不見迴向處。
是為菩薩住毘梨耶波羅蜜取尸羅波羅蜜。」
%74.83 （參）精進攝忍
「世尊！云何菩薩摩訶薩住毘梨耶波羅蜜取羼提波羅蜜？」
%74.84 一、破我顛倒，深入諸法實相，能忍殘害
佛言：「菩薩住毘梨耶波羅蜜，從初發意乃至坐道場，於其中間，若人、若非人來節~2332節支解，菩薩作是念：『割我者誰？截我者誰？奪我者誰？』復作是念：『我大得善利，我為眾生故受身，眾生還自來取。』
是時菩薩正憶念諸法實相。
%74.85 二、福德與眾生共，迴向無上菩提，不向二乘地
持是功德與眾生共之，迴向阿耨多羅三藐三菩提，不向聲聞、辟支佛地。
是為菩薩住毘梨耶波羅蜜取羼提波羅蜜。」#81.19
%74.86 （肆）精進攝襌
「世尊！云何菩薩摩訶薩住毘梨耶波羅蜜取禪波羅蜜？」
%74.87 一、依精進得四禪八定、四無量心
佛言：「菩薩住毘梨耶波羅蜜，離欲、離惡不善法，有覺有觀，離生喜樂，入初禪，第二、第三、第四禪，入慈、悲、喜、捨，乃至入非有想非無想處。
%74.88 二、雖得禪定而不受禪定果報，遊諸佛國，常隨佛學、成就眾生
持是禪、無量心#81.20、無色定，不受果報，生於利益眾生之處，以六波羅蜜成就眾生，所謂檀波羅蜜乃至般若波羅蜜；從一佛土#81.21至一佛土，親近供養諸佛，種善根。
是為菩薩住毘梨耶波羅蜜取禪波羅蜜。」#81.22
%74.89 （伍）精進攝慧
「世尊！云何菩薩摩訶薩住毘梨耶波羅蜜取般若波羅蜜？」
佛言：「菩薩住毘梨耶波羅蜜，不見檀波羅蜜法，不見檀波羅蜜相；乃至不見禪波羅蜜法，不見禪波羅蜜相；@t25p627a四念處乃至一切種智，亦不見法，亦不見相。不#81.23見一切法，非法、非非法；於一切#81.24法中無所著。是菩薩所作如所言。
~2333是為菩薩住毘梨耶波羅蜜取般若波羅蜜。」#81.25
%74.90 伍、禪定攝餘五度
%74.91 （壹）禪定攝施
須菩提白佛言：「世尊！云何菩薩摩訶薩住禪波羅蜜取檀波羅蜜？」
%74.92 一、住定心不亂，以四種正行修財法二施
佛言：「菩薩摩訶薩住禪波羅蜜，離諸欲、離惡不善法，有覺有觀，離生喜樂，入初禪，第二、第三、第四禪，入慈、悲、喜、捨，乃至入#81.26非有想非無想處；住禪波羅蜜中，心不亂，行二施以施眾生：法施、財施；自行二施，教他#81.27行二施，讚歎二施法，歡喜讚歎行二施者。
%74.93 二、迴向無上道，不向二乘地
持是功德與眾生共之，迴向阿耨多羅三藐三菩提，不向聲聞、辟支佛地。
是為菩薩住禪波羅蜜取檀波羅蜜。」
%74.94 （貳）禪定攝戒
「世尊！云何菩薩摩訶薩住禪波羅蜜取尸羅波羅蜜？」
%74.95 一、不生三毒、惱他心，但修行一切智相應心
佛言：「菩薩住禪波羅蜜，不生婬欲、瞋恚、愚癡心，不生惱他心，但修行#81.28一切智相應心。
%74.96 二、迴向無上道，不向二乘地
持是功德與眾生共之，迴向阿耨多羅三藐三菩提，不向聲聞、辟支佛地。
是為菩薩住禪波羅蜜取尸羅波羅蜜。」
%74.97 （參）禪定攝忍：觀五蘊無實，念無我，能安忍
「世尊！云何菩薩摩訶薩住禪波羅蜜取羼提波羅蜜？」
佛言：「菩薩住禪波羅蜜，觀色如聚沫，觀受如泡，觀想如野馬，觀行如芭蕉，觀識如幻；作是觀時，見五眾無堅固相，作是念：『割我者誰？截我者誰？誰受、誰想、誰行、誰識？誰罵者？誰受罵者？誰生瞋恚？』
~2334是為菩薩住禪波羅蜜取羼提波羅蜜。」
%74.98 （肆）禪定攝勤
「世尊！云何菩薩摩訶薩住禪波羅蜜取毘梨耶波羅蜜？」
%74.99 一、依定發五通，嚴土熟生
%74.100 （一）依定發五通
佛言：「菩薩住禪波羅蜜，離欲、離惡不善法，有覺有觀，離生喜樂，入初禪，第二、第三、第四禪；是諸禪及支，取相，生@t25p627b種種神通──
%74.101 1、神足通
履水如地，入地如水，如先說。
%74.102 2、天耳通
天耳聞二種聲──若天、若人。
%74.103 3、他心通
知他心──若攝心、若亂心，乃至有上心、無上心。
%74.104 4、宿命通
憶種種宿命，如先說。
%74.105 5、天眼通
以天眼淨過人眼，見眾生乃至如業受報，如先說。#81.29
%74.106 （二）住五神通，遊諸佛國嚴土熟生
菩薩住是五神通，從一佛世界#81.30至一佛世界，親近供養諸佛，種善根，成就眾生，淨佛世界#81.31。
%74.107 二、功德與眾生共，迴向無上道
持是功德與眾生共之，迴向阿耨多羅三藐三菩提。
是為菩薩住禪波羅蜜取毘梨耶波羅蜜。」#81.32
~2335
%74.108 （伍）禪定攝慧：觀諸法實相，常一心應薩婆若行
「世尊！云何菩薩摩訶薩住禪波羅蜜取般若波羅蜜？」
佛言：「菩薩住禪波羅蜜，不得色，不得受、想、行、識；不得檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜，不得般若波羅蜜；不得四念處，乃至不得一切種智；不得有為性，不得無為性。不得故不作，不作故不生，不生故不滅。
何以故？有佛、無佛，是如、法相、法性常住、不生不滅。
常一心應#81.33薩婆若行。
是為菩薩住禪波羅蜜取般若波羅蜜。#81.34
%74.109 陸、般若攝餘五度
%74.110 （壹）般若攝施
%74.111 一、住於十四空，觀法不可得
須菩提白佛言：「世尊！云何菩薩摩訶薩住般若波羅蜜取檀波羅蜜？」
佛言：「菩薩住般若波羅蜜，內空、內空不可得，外空、外空不可得，內外空、內外空不可得，空空、空空不可得，乃至一切法空、一切法空不可得。
菩薩住是十四空#81.35中，不得色相若空、若不空，不得受、想、行、識相若空、若不空，~2336不得四念處若空、若不空，乃至不得阿耨多羅三藐三菩提若空、若不空，不得有為性#81.36、無為性若空、若不空。
%74.112 二、悟三輪體空，不生慳著心
是菩薩摩訶薩如是住般若波羅蜜中，有所布施──若飲食、衣服、種種資生之具，觀是布施空。何等空？施者、受者及財物空，不令@t25p627c慳著心生。
何以故？菩薩摩訶薩行般若波羅蜜，從初發意乃至坐道場，無有妄想分別。#81.37如諸佛得阿耨多羅三藐三菩提時，無慳著心；菩薩摩訶薩亦如是，行般若波羅蜜時，無慳著心。
是菩薩所可尊者，般若波羅蜜。#81.38
是為菩薩住般若波羅蜜取檀波羅蜜。」
%74.113 （貳）般若攝戒
「世尊！云何菩薩摩訶薩住般若波羅蜜取尸羅波羅蜜？」
%74.114 一、知諸法不可得，不生二乘心
佛言：「菩薩住般若波羅蜜，不生聲聞、辟支佛心。
何以故？是菩薩，聲聞、辟支佛地不可得，趣向聲聞、辟支佛心亦不可得。
%74.115 二、依四種正行修十善道，不取著戒相
是菩薩摩訶薩從初發意乃至坐道場，於其中間，自不殺生，不教他殺生#81.39，讚不殺生法，歡喜讚歎不殺生者；乃至自不邪見，不教他邪見，讚不邪見法，歡喜讚歎不邪見者。
以是持戒#81.40無法可取──若聲聞、若辟支佛地，何況餘法！
是為菩薩住般若波羅蜜取尸羅波羅蜜。」
~2337
%74.116 （參）般若攝忍
「世尊！云何菩薩摩訶薩住般若波羅蜜取羼提波羅蜜？」
%74.117 一、隨順法忍生，不取定法相
佛言：「菩薩住般若波羅蜜，隨順法忍生，作是念：『此法中無有法──若起、若滅，若生、若死，若受罵詈、若受惡口，若割、若截，若破、若縛、若打、若殺。』#81.41
%74.118 二、假使一切眾生皆來打罵加害，菩薩能忍心不動
是菩薩從初發意乃至坐道場，若一切眾生來罵詈惡口、刀杖瓦石、割截傷害，心不動，作是念：『甚可怪！此諸法中無有法受罵詈、惡口、割截、傷害者，而眾生受#81.42苦惱！』#81.43
是為菩薩住般若波羅蜜取羼提波羅蜜。」
%74.119 （肆）般若攝勤：教眾生行道得果，而不住有為性、無為性中
「世尊！云何菩薩摩訶薩住般若波羅蜜取毘梨耶波羅蜜？」
佛言：「菩薩住般若波羅蜜，為眾生說法，令行檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜，教令行四念@t25p628a處乃至八聖道分，令得須陀洹果、斯陀含、阿那含、阿羅漢果、辟支佛道，令得阿耨多羅三藐三菩提。
不住有為性中，不住無為性#81.44中。
是為菩薩住般若波羅蜜取毘梨耶波羅蜜。」#81.45
%74.120 （伍）般若攝襌
「世尊！云何菩薩摩訶薩住般若波羅蜜取禪波羅蜜？」
%74.121 一、總明：除諸佛三昧，餘三昧出入隨意
佛言：「菩薩住般若波羅蜜，除諸佛三昧，入餘一切三昧──若聲聞三昧、若辟支佛三昧、若菩薩三昧，皆行、皆入。
~2338
%74.122 二、別明：八背捨乃至超越三昧，漸次得自在
%74.123 （一）八背捨
是菩薩住諸三昧，逆順出入八背捨#81.46。
何等八？內有色相#81.47外觀色，是初背捨；內無色相外觀色，二背捨；淨背捨，身作證，三背捨；過一切色相，滅有對相，不念種種相故，入無量虛空處，四背捨；過一切虛空處，入無邊識處，五背捨；過一切識處，入無所有處，六背捨；過一切無所有處，入非有想非無想處，七背捨；過一切非有想非無想處，入滅受想處，八背捨。
%74.124 （二）九次第定
於是八背捨，逆順出入九次第定#81.48。
何等九？離諸欲、離諸惡不善法，有覺有觀，離生喜樂，入初禪；乃至過非有想非無想處，入滅受想定#81.49。是名九次第定，逆順出入。
%74.125 （三）師子奮迅三昧
是菩薩依八背捨、九次第定，入師子奮迅#81.50三昧#81.51。
云何名師子奮迅三昧？須菩提！菩薩離欲#81.52、惡不善法，有覺有觀，離生喜樂，入初禪；乃至入滅受想定；從滅受想定起，還入非有想非無想處；從非有想非無想處起，乃至還入初禪。
%74.126 （四）住超越三昧，得諸法等相
是菩薩依師子奮迅三昧，入超越三昧#81.53。
云何為超越三昧#81.54？須菩提！
菩薩離欲、離諸惡不善法，有覺有觀，離生喜樂，入初禪，從初禪起乃至入非有想非無想處；非有想非無想處起，入滅受想定。
~2339滅受想定起@t25p628b還入初禪，從初禪起入滅受想定；滅受想定起還入二禪，二禪起入滅受想定；滅受想定起入三禪，三禪起入滅受想定；滅受想定起入四禪，四禪起入滅受想定；滅受想定起入空#81.55處，空處起入滅受想定；滅受想定起入識處，識處起入滅受想定；滅受想定起入無所有處，無所有處起入滅受想定；滅受想定起入非有想非無想處，非有想非無想處起入滅受想定；滅受想定起入散心中，散心中起入滅受想定。
滅受想定起還入散心中。
散心中起入非有想非無想處，非有想非無想處起還住散心中；散心中起入無所有處，無所有處起住散心中；散心中起入識處，識處起住散心中；散心中起入空處，空處起住散心中；散心中起入第四禪，第四禪中起住散心中；散心中起入第三禪，第三禪中起住散心中；散心中起入第二禪，第二禪中起住散心中；散心中起入初禪，初禪中起住散心中。
是為菩薩摩訶薩住超越三昧，得諸法等相。
是為菩薩住般若波羅蜜取禪波羅蜜。」#81.56
^82.1
#82.3
%75.0 壹、讚歎菩薩成就方便力
%75.1 （壹）明往昔因行
%75.2 一、發心已歷無量劫數
爾時，須菩提白佛言#82.4：「世尊！是菩薩摩訶薩如是方便力成就者，發意已來幾時？」
佛告須菩提：「是菩薩摩訶薩能成就方便力者，發心已來無量億阿僧祇劫。」
%75.3 二、已供養如恆河沙等諸佛
須菩提言：「世尊！是菩薩摩訶薩如是成就方便力者，為供養幾佛？」
佛言：「是菩薩成就方便力者，供養如恒河沙等諸佛。」
%75.4 三、具足六度諸善根
須菩提白佛言：「世尊！菩薩得如是方便力者，種何等善根？」
佛言：「菩薩成就如是方便力者，從初發意已來，於檀波羅蜜無不具足，於尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜無不具足。」#82.5
~2356
%75.5 （貳）歎人希有
須菩提@t25p632c白佛言：「世尊！菩薩摩訶薩成就如是方便力者，甚希有！」
佛言：「如是！如是！須菩提！菩薩摩訶薩成就如是方便力者，甚希有！
%75.6 貳、讚歎菩薩方便妙用
%75.7 （壹）般若能導萬行至無上菩提
%75.8 一、舉喻歎般若為萬行之首
%75.9 （一）日月周行照天下喻
須菩提！譬如日月#82.6周行#82.7，照四天下，多有所益；般若波羅蜜亦如是，照五波羅蜜，多有所益。
%75.10 （二）具輪寶乃名輪王喻
須菩提！譬如轉輪聖王，若無輪寶#82.8，不得名為轉輪聖王；輪寶成就故，得名轉輪聖王。
須菩提#82.9！五波羅蜜亦如是，若離般若波羅蜜，不得波羅蜜名字；不離般若波羅蜜故，得波羅蜜名字。
%75.11 （三）有夫之婦難可侵喻
須菩提！譬如無夫婦人，易為侵凌#82.10；五波羅蜜亦如是，遠離般若波羅蜜，魔、若魔天壞之則易。
譬如有夫婦人，難可侵凌；五波羅蜜亦如是，得般若波羅蜜，魔、若魔天不能沮壞#82.11。#82.12
%75.12 （四）軍將具足鎧仗喻
須菩提！譬如軍將，鎧仗#82.13具足，隣國強敵所不能壞；五波羅蜜亦如是，不遠離般若波羅蜜，魔、若魔天、若增上慢人，乃至菩薩旃陀羅所不能壞。
~2357
%75.13 （五）小王朝宗輪王喻
須菩提！譬如諸小國王，隨時朝侍#82.14轉輪聖王；五波羅蜜亦如是，隨順般若波羅蜜。
%75.14 （六）萬流入大海喻
譬如眾川萬流，皆入於恒河，隨入大海；五波羅蜜亦如是，般若波羅蜜所守護故，隨到薩婆若。
%75.15 （七）右手作事方便喻
譬如人之右手，所作事便，般若波羅蜜亦如是；如人左手，造事不便，五波羅蜜亦如是。#82.15
%75.16 （八）眾流入海合一味喻
譬如眾流，若大、若小，俱入大海，合為一味；五波羅蜜亦如是，為般若波羅蜜所護，隨般若波羅蜜入薩婆若，得波羅蜜名字。#82.16
%75.17 （九）輪寶前導皆隨王意喻
譬如轉輪聖王四種兵，輪寶在前@t25p633a導，王意欲住，輪則為住，令四種兵滿其所願，輪亦不離其處；般若波羅蜜亦如是，導五波羅蜜到薩婆若，常是中住，不過其處。#82.17
譬如轉輪聖王四種兵，輪#82.18寶在前導；般若波羅蜜亦如是，導五波羅蜜到薩婆若中住。般若波羅蜜亦不分別：『檀波羅蜜隨從我，尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜不隨從我。』
檀波羅蜜亦不分別：『我隨從般若波羅蜜，尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜不隨從。』
尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜，亦如是。
何以故？諸波羅蜜性無所能作、自性空、虛誑、如野馬。」#82.19
%75.18 二、歎般若勝妙，能攝導萬行
%75.19 （一）正明般若能攝導萬行
~2358
%75.20 1、諸法雖畢竟空，菩薩當以方便力為眾生行六度
%75.21 （1）總明以方便力為眾生行六度
爾時，須菩提白佛言：「世尊！若一切法自性空，云何菩薩摩訶薩行六波羅蜜當得阿耨多羅三藐三菩提？」#82.20
「須菩提！菩薩摩訶薩行六波羅蜜時，作是念：『是世間心皆顛倒，我若不行方便力，不能度脫眾生生死。我當為眾生故行檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜。』
%75.22 （2）別明為眾生行六度
%75.23 A、施度
是菩薩為眾生故，捨內外物；捨時作是念：『我無所捨。何以故？是物必當壞敗。』菩薩作如是思惟，能具足檀波羅蜜。
%75.24 B、戒度
為眾生故，終不破戒。何以故？菩薩作是念：『我為眾生故發阿耨多羅三藐三菩提，若殺生是所不應；乃至我為眾生故#82.21發阿耨多羅三藐三菩提，若作邪見、若貪著聲聞辟支佛地，是所不應！』菩薩摩訶薩如是思惟，能具足尸羅波羅蜜。
%75.25 C、忍度
菩薩為眾生故不瞋心，乃至不生一念。#82.22菩薩如是思惟：『我應利益眾生，云何而起瞋心？』菩薩如是思惟，能具足羼提波羅蜜。
%75.26 D、精進度
菩薩為眾生故，乃至阿耨多羅三藐三菩提，常不生懈怠心。菩薩如是行，能具足毘梨耶波羅蜜。
%75.27 E、禪定度
菩薩為眾生故，乃至得阿耨多羅三@t25p633b藐三菩提，不生散亂心。菩薩如是行，能具足禪波羅蜜。
%75.28 F、般若度
菩薩為眾生故，乃至得#82.23阿耨多羅三藐三菩提，終不離智慧。何以故？除智慧，不可以餘法度脫眾生#82.24故。菩薩如是行，能具足般若波羅蜜。」#82.25
~2359
%75.29 2、諸波羅蜜中，般若為最上
%75.30 （1）釋「諸度無差別相，云何般若最勝妙」
須菩提白佛言：「世尊！若諸波羅蜜無差別相，云何般若波羅蜜於五波羅蜜中第一、最上、微妙？」#82.26
佛告須菩提：「如是！如是！諸波羅蜜雖無差別，若無般若波羅蜜，五波羅蜜不得波羅蜜名字；因般若波羅蜜，五波羅蜜得波羅蜜名字。
須菩提！譬如種種色身#82.27，到須彌山王邊，皆同一色；五波羅蜜亦如是，因般若波羅蜜到薩婆若中，一種無異，不分別是檀波羅蜜、是尸羅波羅蜜、是羼提波羅蜜、是毘梨耶波羅蜜、是禪波羅蜜、是般若波羅蜜。何以故？是諸波羅蜜無自性故。以是因緣故，諸波羅蜜無差別。」
%75.31 （2）釋「隨實義無分別，云何般若最勝妙」
須菩提白佛言：「世尊！若隨實義無分別，云何般若波羅蜜於五波羅蜜中最上、微#82.28妙？」#82.29
佛言：「如是！如是！須菩提！雖實義中無有分別，但以世俗法故說檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜。為欲度眾生生死，是眾生實不生不死、不起不退。須菩提！眾生無所有故，當知一切法無所有。
以是因緣故，般若波羅蜜於五波羅蜜中最上、最妙。#82.30
須菩提！譬如閻浮提眾女人中，玉女寶#82.31第一、最上、最妙；般若波羅蜜亦如是，~2360於五波羅蜜中第一、最上、最妙。」
%75.32 3、明般若不住故，能攝導眾善至薩婆若
%75.33 （1）釋「不取不捨義」
%75.34 A、般若住不住法故，能導眾善至薩婆若
須菩提白佛言：「世尊！佛以#82.32何意故說般若波羅蜜最上、最妙？」
佛告須菩提：「是#82.33般若波羅蜜取@t25p633c一切善法到薩婆若中，住不住故。」#82.34
%75.35 B、不憶念一切法故，般若於諸法不取不捨
%75.36 （A）諸法皆不可取捨故般若無取捨
%75.37 a、正明
須菩提白佛言：「世尊！般若波羅蜜有法可取、可捨不？」
佛言：「不也！須菩提！般若波羅蜜無法可取、無法可捨。
%75.38 b、釋因
何以故？一切法不可取、不可捨故。」
%75.39 （B）不憶念取相故，不取色乃至無上菩提
%75.40 a、正明
「世尊！般若波羅蜜於何等法不取不捨？」
佛言：「般若波羅蜜於色不取不捨，於受想行識乃至阿耨多羅三藐三菩提不取不捨。」
%75.41 b、釋因
「世尊！云何不取色乃至不取阿耨多羅三藐三菩提？」
佛言：「若菩薩不念色乃至不念阿耨多羅三藐三菩提，是名不取色#82.35乃至不取阿耨多羅三藐三菩提。」#82.36
%75.42 （2）辨「不念不著義」
%75.43 A、正明
須菩提言：「世尊！若不念色乃至不念阿耨多羅三藐三菩提，云何得增益善根？善根不增，云何具足諸波羅蜜？若不具足諸波羅蜜，云何得阿耨多羅三藐三菩提？」
~2361佛告須菩提：「若菩薩不念色乃至不念阿耨多羅三藐三菩提，是時善根增益；善根增益故，具足諸波羅蜜；諸波羅蜜具足故，得阿耨多羅三藐三菩提。何以故？不念色乃至不念阿耨多羅三藐三菩提時，便得阿耨多羅三藐三菩提。」
%75.44 B、釋因
「世尊！何因緣故，色不念時乃至阿耨多羅三藐三菩提不念時，便得阿耨多羅三藐三菩提？」
佛言：「以念故著欲界、色界、無色界，不念故無所著。如是，須菩提！菩薩摩訶薩行般若波羅蜜，不應有所著。」
%75.45 （3）辨「不著不住義」
%75.46 A、正明
「世尊！菩薩摩訶薩如是行般若波羅蜜，當住何處？」
佛言：「菩薩摩訶薩如是行，不住色，乃至不住一切種智。」
%75.47 B、釋因
「世尊！何因緣故，色中不住，乃至一切種智中不住？」
佛言：「不著故不住。何以故？是菩薩不見有法可著、可住。
%75.48 C、結成
如是，須菩提！@t25p634a菩薩摩訶薩以不著、不住法，行般若波羅蜜。#82.37
%75.49 （二）明學般若有得有失
%75.50 1、明失
%75.51 （1）著人法空失
須菩提！若菩薩摩訶薩作是念：『若能如是行、如是修，是行般若波羅蜜；我今行般若波羅蜜、修般若波羅蜜。』
若如是取相，則遠離般若波羅蜜；若遠離般若波羅蜜，則遠離檀波羅蜜乃至遠離一切種智。何以故？般若波羅蜜無有著處、亦無著者，自性無故。
%75.52 （2）著般若無性失
菩薩摩訶薩若復如是取相，則於般若波羅蜜退；若退般若波羅蜜，則是退阿耨多羅三藐三菩提，不得受記。
%75.53 （3）著菩薩道失
菩薩摩訶薩復作是念：『住是般若波羅蜜，能生檀波羅蜜乃至能生大悲。』
若作是念，則為失般若波羅蜜；失般若波羅蜜者#82.38，則不能生檀波羅蜜#82.39乃至不能#82.40生大悲。
~2362
%75.54 （4）著佛道起佛見失
菩薩若復作是念：『諸佛知諸法無受相故，得阿耨多羅三藐三菩提。』菩薩若作如是演說、開示、教詔#82.41，則失般若波羅蜜。
何以故？佛#82.42於諸法無所知、無所得，亦無法可說，何況當有所得！無有是處！」#82.43
%75.55 2、明得
%75.56 （1）念諸法無所有、無可取、無所得，是行般若
%75.57 A、須菩提問
須菩提白佛言：「世尊！菩薩行般若波羅蜜，云何無是過失？」
%75.58 B、佛答
佛言：「若菩薩摩訶薩行般若波羅蜜，作是念：『諸法無所有、不可取；若法無所有、不可取，則無所#82.44得。若如是行，為行般若波羅蜜。』
若菩薩摩訶薩著無所有法，則遠離般若波羅蜜。何以故？般若波羅蜜中無有著法故。」
%75.59 （2）於一切法離自相不著，則般若等生
%75.60 A、須菩提問
須菩提白佛言：「世尊！般若波羅蜜遠離般若波羅蜜耶#82.45？檀波羅蜜遠離檀波羅蜜耶？乃至#82.46一切種智遠離一切種智#82.47耶？
世尊！若般若波羅蜜遠離般若波羅蜜，乃至一切種智遠離一切種智，菩薩云何得般若波羅蜜乃至得一切種智？」
%75.61 B、佛答
%75.62 （A）明一切法不生，則般若等生
%75.63 a、破人法著
佛言：「菩薩摩訶@t25p634b薩行般若波羅蜜時，不生色──是色，誰色；乃至一切種智不生──是一切種智，誰一切種智。如是菩薩能生般若波羅蜜乃至能生一切種智。#82.48
~2363
%75.64 b、破顛倒見
復次，須菩提！菩薩摩訶薩行般若波羅蜜時，不觀色若常若無常、若苦若樂、若我若非我、若空若不空、若離若非離。
%75.65 （B）釋因由
何以故？自性不能生自性。
乃至一切種智亦如是。
%75.66 （C）結行得
若菩薩摩訶薩行般若波羅蜜，如是觀色乃至觀一切種智，能生般若波羅蜜乃至能生一切種智。
%75.67 三、舉喻結歎般若最勝
%75.68 （一）四兵隨從聖王喻
譬如轉輪聖王有所至處，四種兵#82.49皆隨從；般若波羅蜜亦如是，有所至處，五波羅蜜皆悉隨從到薩婆若中住。
%75.69 （二）善御駕駟喻
譬如善御#82.50駕駟#82.51，不失平道，隨意所至；般若波羅蜜亦如是，御五波羅蜜不失正道，至薩婆若。」#82.52
%75.70 （貳）為度眾生行方便，當學般若
%75.71 一、明般若為大事故起──示是道、是非道
%75.72 （一）明菩薩道與非菩薩道
須菩提言：「世尊！何等是菩薩摩訶薩道？何等是非道？」
佛言：「聲聞道非菩薩道，辟支佛道非菩薩道；一切種#82.53智道是菩薩摩訶薩道。#82.54
須菩提！是名菩薩摩訶薩道、非道。」
~2364
%75.73 （二）歎般若是菩薩導，為大事故起，令離二乘住薩婆若
須菩提言：「世尊！諸菩薩摩訶薩般若波羅蜜為大事故起，所謂示是道、是非道。」
佛言：「如是！如是！須菩提！般若波羅蜜為大事故起，所謂示是道、是非道。
須菩提！是般若波羅蜜為度無量眾生故起，為利益阿僧祇眾生故起。
般若波羅蜜雖作是利益，亦不受色，亦不受受、想、行、識；亦不受聲聞、辟支佛地。
須菩提！般若波羅蜜是諸菩薩摩訶薩導，示阿耨多羅三藐三菩提，能令離聲聞、辟支佛地，住薩婆若。般若波羅蜜無所生、無所滅，諸法常住故。」#82.55
%75.74 （三）般若雖無生無滅，而不妨行六度
%75.75 1、須菩提問
須菩提言：「世尊！若般若波羅蜜無所生、無所滅，云何菩薩摩訶薩@t25p634c行般若波羅蜜時應布施？云何應持戒？云何應修忍？云何應勤精進？云何應入禪定？云何應修智慧？」
%75.76 2、佛答
%75.77 （1）念薩婆若，應行六度
佛告須菩提：「菩薩摩訶薩念薩婆若應布施，念薩婆若應持戒、忍辱、精進、禪定、智慧。#82.56
%75.78 （2）功德與眾生共，迴向佛菩提
是菩薩摩訶薩持是功德與眾生共之，應#82.57迴向阿耨多羅三藐三菩提。
若如是迴向，則具足修六波羅蜜乃至#82.58慈悲心諸功德。
須菩提！若菩薩摩訶薩不遠離六波羅蜜，則不遠離薩婆若。#82.59
%75.79 （3）結勸修六度
以是故，須菩提！菩薩摩訶薩欲得阿耨多羅三藐三菩提，應學應行六波羅蜜；菩~2365薩摩訶薩行六波羅蜜，具足一切善根，當得阿耨多羅三藐三菩提。
以是故，須菩提！菩薩摩訶薩應習行六波羅蜜！」
%75.80 二、觀法無合散，依無所住行六度
%75.81 （一）須菩提問
須菩提言：「世尊！云何菩薩摩訶薩應習行六波羅蜜？」
%75.82 （二）佛答
%75.83 1、觀諸法不合不散
佛言：「菩薩摩訶薩應如是觀──色不合不散，受、想、行、識不合不散，乃至一切種智不合不散。是名菩薩摩訶薩習行六波羅蜜。#82.60
%75.84 2、觀諸法無所住
復次，須菩提！菩薩摩訶薩應作是念：『我當不住色中，不住受、想、行、識中，乃至不住一切種智中。如是應習行六波羅蜜。何以故？是色無所住，乃至薩婆若無所住。』如是，須菩提！菩薩摩訶薩以無所#82.61住法習行六波羅蜜，應當得阿耨多羅三藐三菩提。#82.62
%75.85 三、欲上求下化，應習學六度
%75.86 （一）如士夫種樹，欲得無上菩提果，應行六度化眾生
須菩提！譬如士夫欲食菴#82.63羅果#82.64、若波羅#82.65那婆果#82.66，當種其子，隨時溉灌、守護，漸漸生長，時節和合，便有果實得而食之。#82.67
~2366須菩提！菩薩摩訶薩亦如是，欲得阿耨多羅三藐三菩提，當學六波羅蜜，以布施攝取眾生，持戒、忍辱、精進、禪定、智慧攝取眾生，度眾生生死#82.68。如是#82.69行，當得阿耨多羅三藐三菩@t25p635a提。#82.70
%75.87 （二）欲得諸功德，當學般若
%75.88 1、欲不隨他語
以是故，須菩提！菩薩摩訶薩欲不隨他人語，當學般若波羅蜜。
%75.89 2、欲嚴土熟生
欲淨佛國土、成就眾生，欲坐道場，欲轉法輪，當學般若波羅蜜。」#82.71
%75.90 3、欲於法自在
須菩提白佛言：「世尊！應如是學般若波羅蜜耶？」
佛言：「菩薩應如是學般若波羅蜜。欲於諸法得自在，當學般若波羅蜜。何以故？學是般若波羅蜜，於一切諸法中得自在故。
%75.91 4、欲得三乘道
復次，般若波羅蜜於一切諸法中最大。譬如大海，於萬川中最大；般若波羅蜜亦如是，於一切諸#82.72法中最大。
以是故，諸欲求聲聞、辟支佛道#82.73及諸菩薩道，應當學般若波羅蜜、檀波羅蜜乃至一切種智。
%75.92 5、欲勝諸魔怨
須菩提！譬如射師，執#82.74如意弓箭，不畏怨敵；菩薩摩訶薩亦如是，行般若波羅蜜乃至一切種智，魔、若魔天所不能壞。
以是故，須菩提！菩薩摩訶薩欲得阿耨多羅三藐三菩提，應學般若波羅蜜。
%75.93 6、十方諸佛護念
%75.94 （1）正明佛護念
是行般若波羅蜜菩薩，為十方諸佛所念。」
~2367
%75.95 （2）釋因
%75.96 A、菩薩雖行六度，亦觀畢竟空不可得
須菩提白佛言：「世尊！云何十方諸佛念是菩薩摩訶薩？」
佛告須菩提：「菩薩摩訶薩行檀波羅蜜時，十方諸佛皆念；行尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜時，十方諸佛皆念。
云何念？布施不可得，持戒、忍辱、精進、禪定、智慧不可得，乃至一切種智不可得。
菩薩能如是不得諸法故，諸佛念是菩薩摩訶薩。
%75.97 B、諸佛不取相而護念
復次，須菩提！諸佛不以色故念，不以受、想、行、識故念，乃至不以一切種智故念。」
%75.98 （參）得此方便，則於一切法皆明了
%75.99 一、菩薩雖多有所學，而實無所學
須菩提言：「世尊！菩薩摩訶薩多有所學，實無所學。#82.75」
佛言：「如是！如是！須菩提！菩薩多有所學，實無所學。
何以故？是菩薩所學諸法皆不可得。」#82.76
%75.100 二、菩薩學略攝般若，則知諸法略廣相
%75.101 （一）勸學六度若略、若廣，則能知一切法略廣相
須@t25p635b菩提白佛言：「世尊！佛所說法，若略、若廣#82.77；於此法中，諸菩薩摩訶薩欲求阿耨多羅三藐三菩提，六波羅蜜若略、若廣，應當受持、親近、讀、誦；讀誦已，思惟、正觀，心、心數法不行故。」#82.78
~2368佛告須菩提：「如是！如是！#82.79菩薩摩訶薩略廣學六波羅蜜，當知一切法略廣相。」#82.80
%75.102 （二）以四門辨，知一切法略廣之相
%75.103 1、須菩提問
須菩提言：「世尊！云何菩薩摩訶薩知一切法略廣相？」
%75.104 2、佛答
%75.105 （1）約如明
佛言：「知色如相，知受、想、行、識乃至知一切種智如相，如是能知一切法略廣相。」
須菩提言：「世尊！云何色如相？云何受、想、行、識乃至一切種智如相？」
佛告須菩提：「色如相#82.81──無生、無滅、無住異，是名色如相；乃至一切種智如相──無生、無滅、無住異，是名一切種智如相。是中菩薩摩訶薩應學。」#82.82
%75.106 （2）約實際（無際）明
「復次，須菩提！菩薩摩訶薩知諸法實際時，知一切法略廣相。」
「世尊！何等是諸法實際？」
佛言：「無際是名實際。菩薩學是際，知#82.83一切諸法略廣相。#82.84
%75.107 （3）約法性明
須菩提！若菩薩摩訶薩知諸法法性，是菩薩能知一切法略廣相。」
「世尊！何等是諸法法性？」
佛言：「色性是名法性，是性無分、無非分。須菩提！菩薩摩訶薩知法性#82.85故，知~2369一切法略廣相。」#82.86
%75.108 （4）約不合不散明
%75.109 A、正說
須菩提白佛言：「世尊！復云何應知一切法略廣相？」
佛言：「若菩薩摩訶薩知一切法不合不散。」
須菩提言：「世尊！何等法不合不散？」
佛言：「色不合不散，受、想、行、識不合不散，乃至一切種智不合不散。有為性、無為性不合不散。
%75.110 B、釋因
何以故？是諸法自性無，云何有合有散？若法自性無，是為非法，非法不合不散。如是，應當知一切法略廣相。」#82.87
%75.111 （三）勸學略攝般若
須菩提言：「世尊！是名菩薩摩訶薩略攝般若波羅蜜。@t25p635c
世尊！是略攝般若波羅蜜中，初發意菩薩摩訶薩應學，乃至十地菩薩摩訶薩亦應學。是菩薩摩訶薩學是略攝般若波羅蜜，則知一切法略廣#82.88相。」
^83.1
%75.237 三、明四門無礙，一心學者皆能入
%75.238 （一）須菩提說：唯利根菩薩得入
「世尊！是門#83.2，利根菩薩摩訶薩所#83.3入。」#83.4
%75.239 （二）佛說：四門無礙，唯懈怠妄念者不能入
%75.240 1、明能入者
佛言：「鈍根菩薩亦可入是門，中根菩薩、散心菩薩亦可入是門──是門無礙；若菩薩摩訶薩一心學者，皆入是門。
懈怠、少精進#83.5、妄憶念、亂心者所不能入，精進、不懈怠、正憶念、攝心者能入。
欲住阿鞞跋致地、欲逮#83.6一切種智者能入。#83.7
%75.241 2、如般若所說行六度者當得一切智
是菩薩摩訶薩如般若波羅蜜所說當學#83.8，乃至如檀波羅蜜所說當學，是菩薩摩訶薩當得一切智。
~2385
%75.242 參、歎行般若功德果報，並勸修學
%75.243 （壹）讚行般若人力勢──魔事欲起即滅
是菩薩摩訶薩行般若波羅蜜，所有魔事欲起即滅。
以是故，菩薩摩訶薩欲得方便力，當行般若波羅蜜。
%75.244 （貳）歎菩薩行般若功德
%75.245 一、十方三世諸佛憶念
若菩薩摩訶薩如是行、如是習、如是修般若波羅蜜，是時#83.9無量阿僧祇國土中#83.10現在諸佛念是行般若波羅蜜菩薩。何以故？是般若波羅蜜中生過去、未來、現在諸佛故。
以是故，菩薩摩訶薩應如是思惟：『過去、未來、現在諸佛所得法，我亦當得。』
如是，須菩提！菩薩摩訶薩應習般若波羅蜜！
%75.246 二、疾得無上道
若如是習般若波羅蜜，疾得阿耨多羅三藐三菩提。以是故，菩薩摩訶薩常應不遠離薩婆#83.11若念。
%75.247 三、較量功德，顯般若殊勝
若#83.12菩薩摩訶薩如是行般若波羅@t25p640a蜜，乃至彈指頃，是菩薩福德甚多。
若有人教三千大千世界中眾生自恣布施，教令持戒、禪定、智慧，教令得解脫、解脫知見，教令得須陀洹果乃至阿羅漢果、辟支佛道，不如是菩薩修般若波羅蜜乃至彈指頃。何以故？是般若波羅蜜中生布施、持戒、禪定、智慧、須陀洹果乃至辟支佛道；十方#83.13現在諸佛亦從般若波羅蜜中生，過去、未來諸佛亦從般若波羅蜜中生故。
復次，須菩提！菩薩摩訶薩應薩婆若念行般若波羅蜜，若須臾時、若半日、若一日、若一月、若百日、若一歲、若百歲、若一劫、若百劫，乃至無量無邊阿僧祇劫，是菩薩修是般若波羅蜜福德甚多；勝於教十方恒河沙等世界中眾生布施、持戒、禪定、智慧、解脫、解脫知見，教令得須陀洹果乃至辟支佛道。
何以故？諸佛從般若波羅蜜中生#83.14，說是布施、持戒、禪定、智慧、解脫、解脫知見，須陀洹果乃至辟支佛道。
%75.248 四、如般若所說而住，得眾功德
%75.249 （一）諸佛護念、住法王子地、得佛受記具足
若有菩薩摩訶薩如般若波羅蜜所說住，
當知是菩薩摩訶薩是阿鞞跋致，為諸佛所念，如是方便力成就；
當知是菩薩親近、供養無量千萬億諸佛，種善根，與善知識相隨，久行六波羅蜜，~2386久修十八空、四念處乃至八聖道分、佛十力#83.15乃至一切種智；
當知是菩薩住法王子地#83.16，滿足諸願，常不離諸佛，不離諸善根，從一佛國至一佛國；#83.17
當知是菩薩辯才無盡，具足得陀羅尼，身色具足、受記具足故，為眾生受身。
%75.250 （二）善知諸義
當知是菩薩
（1）善知字門，善知非字門；
（2）善於言，善於不言；#83.18
（3）善於一言，善於二言，善於多言；
（4）善知#83.19女語，善知男語；
（5）善#83.20@t25p640b知色乃至識；
（6）善知世間性，善知涅槃性；
（7）善知法相，善知有為相，善知無為相；
（8）善知有法，善知無法；
（9）善知自性，善知他性；
（10）善知合法，善知散法；
（11）善知相應法，善知不相應法，善知相應不相應法；
~2387（12）善知如，善知不如；#83.21
（13）善知法性，善知法位；#83.22
（14）善知緣，善知無緣；#83.23
（15）善知陰，善知界，善知入；
（16）善知諦#83.24，善知十二因緣；
（17）善知禪，善知無量心，善知無色定；
（18）善知六波羅蜜，善知四念處，乃至善知一切種智；
（19）善知有為性，善知無為性；
（20）善知有性，善知無性；
（21）善知色觀，善知受、想、行、識觀，乃至善知一切種智觀；
（22）善知色、色相空，善知受、想、行、識、識相空，乃至善知菩提、菩提相空；
（23）善知捨道，善知不捨道；
（24）善知生，善知滅，善知住異；
（25）善知欲，善知瞋，善知癡；
（26）善知不欲，善知不瞋，善知不癡；
（27）善知見，善知不見；#83.25
（28）善知邪見，善知正見，善知一切見；
（29）善知名，善知色，善知名色；
（30）善知因緣，善知次第緣，善知緣緣，善知增上緣；
（31）善知行相；#83.26
（32）善知苦，善知集，善知滅，善知道；
（33）善知地獄，善知餓鬼，善知畜生，善知人，善知天；
（34）善知地獄趣，善知餓鬼趣，善知畜生趣，善知人趣，善知天趣；
（35）善知須陀洹，善知須陀洹果，善知須陀洹道；
（36）善知斯陀含，善知斯陀含果，善知斯陀含道；
（37）善知阿那含，善知阿那含果，善知阿那含道；
（38）善知阿羅漢，善知阿羅漢果，善知阿羅漢道；
（39）善知辟支佛，善知辟支佛果，善知辟支佛道；
（40）善知佛，善知一切#83.27智，善知一切#83.28智道；
（41）善知諸根，善知諸根具足；#83.29
~2388（42-1）善知慧，（42-2）善知疾慧，（42-3）善知有力慧，（42-4）善知利慧，（42-5）善知出慧，（42-6）善知達慧，（42-7）善知廣@t25p640c慧，（42-8）善知深慧，（42-9）善知大慧，（42-10）善知無等慧，（42-11）善知寶#83.30慧；
（43）善知過去世，善知未來世，善知現在世；
（44）善知方便，
（45）善知待眾生；#83.31
（46）善知心，善知深心；#83.32
（47）善知義，善知語；#83.33
（48）善知分別三乘。#83.34
%75.251 （參）歎德勸修
須菩提！菩薩摩訶薩行般若波羅蜜、生般若波羅蜜、修般若波羅蜜，得如是等利益。」
^83.2
#83.67
%76.0 壹、明行般若、生般若、修般若
%76.1 （壹）略明
%76.2 一、辨義
%76.3 （一）須菩提問
須菩提白佛言：「世尊！菩薩摩訶薩云何行般若波羅蜜？云何生般若波羅蜜？云何修般若波羅蜜？」#83.68
%76.4 （二）佛答
%76.5 1、就五陰寂滅明「行」義
佛言：「色寂滅故，色空故，色虛誑故，色不堅實故，應行般若波羅蜜；受、想、行、識亦如是。
%76.6 2、就如虛空明「生」義
如汝所#83.69問：『云何生般若波羅蜜？』如虛空生故，應生般若波羅蜜。#83.70
%76.7 3、就壞一切法明「修」義
如汝所問：『云何修般若波羅蜜？』修諸法破壞故，應修般若波羅蜜。」#83.71
~2394
%76.8 二、明時節
須菩提言：「世尊！行般若波羅蜜、生般若波羅蜜、修般若波羅蜜，應幾時？」
佛言：「從初發意乃至坐道場，應行、應生、應修般若波羅蜜。」
%76.9 三、明方法
須菩提白佛言：「世尊！次第心應行般若波羅蜜？」
佛言：「常不捨薩婆若心，不令餘念得入，為行般若波羅蜜、為生般若波羅蜜、為修般若波羅蜜。
若心、心數法不行故，為行般若波羅蜜、為生般若波羅蜜、為修般若波羅蜜。」#83.72
%76.10 （貳）廣明
%76.11 一、行不可說法當得薩婆若
%76.12 （一）取相著心四句不得薩婆若
須菩提白佛言：「世尊！菩#83.73薩摩訶薩修般若波羅蜜，當得薩婆若不？#83.74」#83.75
佛言：「不。」
「世尊！不修般若波羅蜜，得薩婆若不？」
佛言：「不。」
「世尊！修不修，得薩婆若不？」
佛言：「不。」
「世尊！非修非不修，得薩婆若不？」
佛言：「不。」#83.76
~2395
%76.13 （二）依諸法實相說得薩婆若
%76.14 1、如「如相」得
「世尊！若不爾，云何當得薩婆若？」
佛言：「菩薩摩訶薩得薩婆若，如如相。」#83.77
%76.15 2、如「實際」得
「世尊！云何如#83.78如相？」
「如實際。」
%76.16 3、如「法性」得
「云何如實際？」
「如法性。」#83.79
%76.17 （三）如我畢竟空說得薩婆若
%76.18 1、正明
「云何如法性？」
「如我性、眾生性、壽@t25p642a命性。」
%76.19 2、反問結義
「世尊！云何我性、眾生性、壽命性？」
佛告須菩提：「於汝意云何？我、眾生、壽命法可得不？」
須菩提言：「不可得。」
佛言：「若我、眾生、壽命不可#83.80得，云何當說有我性、眾生性、壽命性？#83.81
%76.20 （四）結：行不可說法當得一切種智
若般若波羅蜜中不說有一切法，當得一切種智。」#83.82
~2396
%76.21 二、明不可說行
%76.22 （一）一切法皆不可說
須菩提言：「世尊！但般若波羅蜜是不可#83.83說？禪波羅蜜乃至檀波羅蜜亦不可說？」
佛告須菩提：「般若波羅蜜不可說，檀波羅蜜乃至一切法──若有為、若無為，若聲聞法、若辟支佛法、若菩薩法、若佛法，亦不可說。」
%76.23 （二）依勝義說諸法不可得
%76.24 1、須菩提問：若諸法不可說，云何分別說有五道、三乘
「世尊！若一切法不可說，云何說是地獄、是畜生、是餓鬼、是人、是天，是須陀洹、是斯陀含、阿那含、阿羅漢、辟支佛，是諸佛？」
%76.25 2、佛明眾生不可得義
佛告須菩提：「於汝意云何？是眾生名字實可得不？」
「世尊！不可得。」
佛言：「若眾生不可得，云何當說有地獄、餓鬼、畜生、人、天、須陀洹乃至佛？
%76.26 （三）勸學不可說般若
如是，須菩提！菩薩摩訶薩行般若波羅蜜時，應當學一切法不可說。」#83.84
%76.27 三、明般若之行法
%76.28 （一）明無所行
%76.29 1、總論：學不增不減
%76.30 （1）須菩提問
須菩提言：「世尊！菩薩摩訶薩學#83.85般若波羅蜜時，應學色、受、想、行、識，乃至應學一切種智？」
%76.31 （2）佛答
佛告須菩提：「是#83.86菩薩摩訶薩學般若波羅蜜時，應學色不增不減，乃至應學一切種智不增不減。」
%76.32 2、別釋
%76.33 （1）學不生不滅（無相解脫門）
須菩提言：「世尊！云何色不增不減學？乃至一切種智不增不減學？」
~2397佛言：「不生不滅故學。」#83.87
%76.34 （2）學不起不作（無作解脫門）
「世尊！云何名不生不滅學？」
佛言：「不起不作諸行業若有、若無故。」#83.88
%76.35 （3）學自相空（空解脫門）
%76.36 A、明觀行
「世尊！云何不起不作諸行業若有、若無？」
佛言：「觀諸法自相空故。」#83.89
「世尊！云何應觀諸法自相空？」
佛言：「應觀色、色相空，應觀受想行識、識相空；應觀眼、眼相空，乃至意，色乃至法，眼識界乃至意識界、意識界相@t25p642b空；應觀內空、內空相空，乃至應觀自相空、自相空相空；應觀四禪、四禪相空，乃至滅受想#83.90定、滅受想定相空；應觀四念處、四念處相空，乃至阿耨多羅三藐三菩提、阿耨多羅三藐三菩提相空。如是，須菩提！菩薩行般若波羅蜜時，應行諸法自相空。」
%76.37 B、顯真義
%76.38 （A）不行是名行般若
「世尊！若色、色相空，乃至阿耨多羅三藐三菩提、阿耨多羅三藐三菩提相空，云何菩薩摩訶薩應行般若波羅蜜？」
~2398佛言：「不行，是名行般若波羅蜜。」#83.91
%76.39 （B）釋因：由人法空示不可得，以無戲論顯真行
「世尊！云何不行是行般若波羅蜜？」
佛言：「般若波羅蜜不可得故，菩薩不可得，行亦不可得，行者、行法、行處亦不可得故，是名菩薩摩訶薩行不行般若波羅蜜，一切諸戲論不可得故。」#83.92
%76.40 （二）明無所得行
%76.41 1、以不二平等顯無所得
%76.42 （1）正說
%76.43 A、明發心即學無所得
「世尊！若不行是菩薩摩訶薩行般若波羅蜜，從#83.93初發意菩薩，云何行#83.94般若波羅蜜？」
「須菩提！菩薩從初發意已來，應學空無所得法。是菩薩用無所得法故布施、持戒、忍辱、精進、禪定，以無所#83.95得法故修智慧，乃至一切種智亦如是。」#83.96
%76.44 B、辨有所得、無所得義
%76.45 （A）正明：有二相是有所得，無二相是無所得
須菩提白佛言：「世尊！云何名有所得？云何名無所得？」
佛告須菩提：「諸有二者，是有所得；無有二者，是無所得。」
「世尊！何等是二有所得？何等是不二無所得？」
佛言：「眼、色為二，乃至意、法為二，乃至阿耨多羅三藐三菩提、佛為二──是名為二。」
~2399
%76.46 （B）示非：若見有所得、無所得，仍為有所得
「世尊！從有所得中無所得？#83.97從無所得中無所得？」
佛言：「不從有所得中無所得，不從無所得中無所得。#83.98
%76.47 （C）結正義：有所得、無所得平等，方是真無所得
須菩提！有所得、無所得平等，是名無所得。#83.99
%76.48 （2）勸學
如是，須菩提！菩薩摩訶薩於有所得、無所得#83.100平等法中應學！
須菩提！菩薩摩訶薩如是學般若波羅蜜，是名無所@t25p642c得者，無有過失。」
%76.49 2、行無所得般若故，能從一地至一地
須菩提白佛言：「世尊！若菩薩行般若波羅蜜，不行有所得、不行無所得，云何從一地至一地，得一切種智？」
佛告須菩提：「菩薩摩訶薩行般若波羅蜜時，不住有所得中，從一地至一地。何以故？有所得中住，不能從一地至一地。何以故？須菩提！無所得是般若波羅蜜相，無所得是阿耨多羅三藐三菩提相，無所得亦是行般若波羅蜜者相。須菩提！菩薩摩訶薩應如是行般若波羅蜜。」#83.101
%76.50 3、諸法無所得故，行般若具諸善法
%76.51 （1）行般若故，不得諸法相
~2400
%76.52 A、須菩提問
須菩提白佛言：「世尊！若般若波羅蜜不可得，阿耨多羅三藐三菩提亦不可得，行般若波羅蜜者亦不可得，云何菩薩摩訶薩分別諸法相--是色，是受、想、行、識，乃至是#83.102阿耨多羅三藐三菩提？」
%76.53 B、佛答
佛告須菩提：「菩薩摩訶薩行般若波羅蜜時，不得色，不得受、想、行、識，乃至不得阿耨多羅三藐三菩提。」#83.103
%76.54 （2）行無所得故，具足諸善法
%76.55 A、須菩提問
「世尊！若菩薩摩訶薩行般若波羅蜜時#83.104，色不可得，乃至阿耨多羅三藐三菩提不可得，云何具足檀波羅蜜乃至具足般若波羅蜜，入菩薩法位中；入已，淨佛國土、成就眾生，得一切種智；得一切種智已，轉法輪、作佛事，度眾生生死？」
%76.56 B、佛答
佛告須菩提：「菩薩摩訶薩不為色故行般若波羅蜜，乃至不為阿耨多羅三藐三菩提故行般若波羅蜜。」
   %76.57 （三）明無為無作行
%76.58 1、正明無為無作
%76.59 （1）須菩提問
須菩提白佛言：「世尊！菩薩為何事故行般若波羅蜜？」
%76.60 （2）佛答
佛言：「無所為故行般若波羅蜜。何以故？一切諸法無所為、無所作，般若波羅蜜亦無所為、無所作，阿耨多羅三藐三菩提亦無所為、無所作，菩薩亦無所為、無所作。
如是，須菩提！菩薩摩訶薩應#83.105行般若波羅蜜無所@t25p643a為、無所作。」#83.106
^84.1
$$三、明般若之行法（承上卷83）
$$（一）明無所行（承上卷83）
$$（二）明無所得行（承上卷83）
$$（三）明無為無作行（承上卷83）
$$1、正明無為無作（承上卷83）
%76.150 2、釋分別三乘疑
%76.151 （1）須菩提問
須菩提白佛言：「世尊！若諸法無所為、無所作，不應分別有三乘：聲聞、辟支佛、佛乘？」
%76.152 （2）佛答
%76.153 A、佛述成
佛告須菩提：「諸法無所為、無所作#84.1，無有分別；有所為、有所作中有分別。#84.2
%76.154 B、釋因：諸法不可得故無分別，凡愚著諸法故生疑
何以故？凡夫愚人#84.3不聞聖法，著五受眾，所謂色、受、想、行、識，著檀波羅蜜，乃至著阿耨多羅三藐三菩提。是人念有是色、得是色，乃至念有是阿耨多羅三藐三菩提、得是阿耨多羅三藐三菩提。
是菩薩作是念：『我當得阿耨多羅三藐三菩提，我當度眾生生死。』
須菩提！我以五眼觀，尚不得色乃至阿耨多羅三藐三菩提。#84.4
是狂愚人無目，而欲得阿耨多羅三藐三菩提、度脫眾生生死！」#84.5
~2413
%76.155 3、釋分別三聚疑
%76.156 （1）須菩提問
須菩提白佛言：「世尊！若佛以五眼觀不見眾生生死中可度者，今世尊云何得阿耨多羅三藐三菩提，分別眾生有三聚：正定、邪定、不定#84.6？」
%76.157 （2）佛答
%76.158 A、第一義中無三聚
「須菩提！我得阿耨多羅三藐三菩提，初不得眾生三聚：若正定、若邪定、若不定。#84.7
%76.159 B、為破顛倒故，依世諦分別有三聚
須菩提！以眾生無法有法想，我以除其妄著，世俗#84.8法故說有得#84.9，非第一義。」#84.10
   %76.160 （四）明不住行
%76.161 1、正明不住
%76.162 （1）勝義、顛倒二處皆不住
「世尊！非住第一@t25p645c義得阿耨多羅三藐三菩提耶？」
佛言：「不也！」
「世尊！住顛倒得阿耨多羅三藐三菩提耶？」
佛言：「不也！」
%76.163 （2）實得佛菩提，但無所住
「世尊！若不住第一義中得，亦不住顛倒中得，將無#84.11世尊不得阿耨多羅三藐三菩提耶？」
佛言：「不也！我實得阿耨多羅三藐三菩提，無所住若有為相、若無為相。#84.12
%76.164 2、舉化佛喻，示實得義
%76.165 （1）舉喻，合法
~2414須菩提！譬如佛所化人#84.13不住有為相、不住無為相，化人亦有來有去、亦坐亦立。
須菩提！是#84.14化人若行檀波羅蜜，行尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜，行四禪、四無量心、四無色定、五神通，行四念處乃至行八聖道分，入空三昧、無相三昧、無作三昧，行內空乃至無法有法空，行八背捨、九次第定#84.15，佛十力、四無所畏、四無礙智、大慈#84.16大悲，得阿耨多羅三藐三菩提，轉法輪。
是化人化作無量眾生，有三聚。#84.17
須菩提！於汝意云何？是化人有行檀波羅蜜，乃至有三聚眾生不？」#84.18
須菩提言：「不也#84.19！」
「須菩提！佛亦如是，知諸法如化，如化人度化眾生，無有實眾生可度。
如是，須菩提！菩薩摩訶薩行般若波羅蜜，如佛所化人行。」#84.20
%76.166 （2）辨真佛、化佛之同異
%76.167 A、真佛、化佛所作無異，化佛獨能有所作
須菩提白佛言：「世尊！若一切法如化，佛與化人有何等差別？」
佛告須菩提：「佛與化人無有差別。何以故？佛能有所作，化人亦能有所作。」#84.21
「世尊！若無佛，化獨能有所作不？」
佛言：「能有所作。」
須菩提言：「世尊！云何無佛，化能有所作？」
「須菩提！譬如過去有佛名須扇多，為欲度菩薩故，化作佛已#84.22，而自滅度；是化佛住半劫作佛事，授應菩薩行者記已，滅度；一切世間眾生知佛實滅度。#84.23
須~2415菩提！化人實無生@t25p646a無滅。
如是，須菩提！菩薩行般若波羅蜜，當信知諸法如化。」#84.24
%76.168 B、以諸法實相故，供養真佛、化佛福德等
%76.169 （A）舉施清淨相，示福德平等、無盡
「世尊！若佛、佛#84.25所化人無差別者，云何令#84.26布施清淨？如人供養佛，是眾生乃至無餘涅槃，福德不盡；若供養化佛，是人乃至無餘涅槃，福德亦應不盡耶？」#84.27
佛告須菩提：「佛以諸法實相故，與一切眾生──天及人作福田；化佛亦以諸法實相故，與一切眾生──天及人作福田。」#84.28
%76.170 （B）舉三事念佛，說福德不盡
%76.171 a、慈敬心念佛
佛告須菩提：「置是化#84.29佛及於化佛所種福德，若有善男子、善女人但以敬心念佛，是善根因緣，乃至畢苦，其福不盡。#84.30
%76.172 b、散華念佛
須菩提！置是敬心念佛，若有善男子、善女人但以一華散虛空中念佛，乃至畢~2416苦，其福不盡。
%76.173 c、但稱南無佛
須菩提！置是敬心念佛、散華念佛，若有人一稱南無佛，乃至畢苦，其福不盡。
%76.174 （C）結歎
如是，須菩提！佛福田中種其福無量。
%76.175 C、結成：諸法實相故，真佛與化佛無異
以是故，須菩提！當知佛與化佛無有差別，諸法法相無異故。#84.31
%76.176 3、勸修不壞行，等心入實相
須菩提！菩薩摩訶薩應如是行般若波羅蜜，入諸法實相中。是諸法實相不應壞──所謂般若波羅蜜相，乃至阿耨多羅三藐三菩提相#84.32。」#84.33
%76.177 （五）明假名行
%76.178 1、為眾生假名說諸法，不壞諸法相
須菩提白佛言：「世尊！若諸法實相不應壞，佛何以故#84.34壞諸法相，言『是色，是受、想、行、識，#84.35是內法、是外法，是善法、是不善法，是有漏、是無漏，是世間、是出世間，是有諍法、是無諍法，是有為法、是無為法』等？世尊！將無壞#84.36諸法相？」
佛告須菩提：「不也！#84.37以名字相故示諸法，欲令眾生解；佛不壞諸法法相。」#84.38
%76.179 2、隨世俗假立，不著名相觀無實
須菩提白佛言：「世尊！若以名字相故說諸法令眾生解；世尊！一#84.39切法無名無相，~2417云何以名相示眾生欲令解？#84.40
佛告須菩提：「隨世俗法有名相，實無著處。
須菩提！如凡@t25p646b夫#84.41說#84.42苦#84.43，著名、隨相；須菩提！諸佛及弟子不著名、不隨相。#84.44
須菩提！若名著名、相著相，空亦應著空，無相亦應著無相，無作亦應著無作，實際應#84.45著實際，法性應著法性，無為性應著無為性。
須菩提！是一切法但有名相，是法不住名相中。
如是，須菩提！菩薩摩訶薩但名相中住，應行般若波羅蜜，是名相中亦不應著。」#84.46
%76.180 3、行中道般若，能得菩提度眾生
%76.181 （1）須菩提問
「世尊！若一切有為法但名相者，菩薩摩訶薩為誰故發阿耨多羅三藐三菩提心，受種種勤苦──菩薩行道時，布施、持戒、行忍辱、勤精進、入禪定、修智慧，行四禪、四無量心、四無色定、四念處乃至八聖道分，行空行、無相行、無作行、佛十力乃至具足大慈悲#84.47？」
%76.182 （2）佛答
佛言：「如須菩提所說：『若一切有為法但#84.48名相者，菩薩摩訶薩為誰故行菩薩道？』須菩提！若有為法但名相等，是名相、名相相空。以是故，菩薩摩訶薩行菩薩道，得一切種智；得一切種智已，轉法輪；轉法輪已，以三乘法度脫眾生。是名相亦無生#84.49、無滅、無住異。」#84.50
~2418
%76.183 貳、明三智#84.51
%76.184 （壹）明智淺深
%76.185 一、略述
爾時，須菩提白佛言：「世尊！世尊說一切種智？」
佛告須菩提：「我說一切種智。」
須菩提言：「佛說一切智、說道種智、說一切種智──是三種智有何差別？」#84.52
佛告須菩提：「薩婆若是一切聲聞、辟支佛智，道種智是菩薩摩訶薩智，一切種智是諸佛智。」#84.53
%76.186 二、別釋
%76.187 （一）一切智：觀諸法總相
須菩提白佛言：「世尊！何因緣故，薩婆若是聲聞、辟支佛智？」
佛告須菩提：「『一切』名所謂內外法，是聲聞、辟支佛能知，不能用一切道、一切種智#84.54。」#84.55
%76.188 （二）道種智：觀諸法總相、別相
%76.189 1、菩薩應具足知諸道法度眾生
須菩提言：「世尊！何因緣故，道種智#84.56是諸菩薩摩訶薩智？」
佛告須菩提：「一切道，菩薩@t25p646c摩訶薩應知──若聲聞道、辟支佛道、菩薩道，應具足知；亦應用是道度眾生，亦不作實際證。」#84.57
~2419
%76.190 2、嚴土熟生未成就前不應取證
須菩提白佛言：「世尊！如佛說『菩薩摩訶薩應具足諸道，不應以是道實際作證』耶？」
佛告須菩提：「是菩薩未淨佛土、未成就眾生，是時不應實際作證。」
%76.191 3、菩薩無所住而於實際作證
%76.192 （1）明不住四句證實際
須菩提白佛言：「世尊！菩薩住道中，應實際作證？」
佛言：「不也！」
「世尊！住非道中，實際作證？」
佛言：「不也！」
「世尊！住道非道，實際作證？」
佛言：「不也！」
「世尊！住非道亦非非道，實際作證？」
佛言：「不也！」
%76.193 （2）無所住而證
%76.194 A、須菩提問
「世尊！菩薩摩訶薩住何處，應實際作證？」
%76.195 B、佛以四句反問答
佛告須菩提：「於汝意云何？汝住道中#84.58，受諸法故，漏盡#84.59得解脫不？」#84.60
須菩提言：「不也！世尊！」
「汝住非道，漏盡得解脫不？」
「不也！世尊！」
「汝住道非道，漏盡得解脫不？」
「不也！世尊！」
「汝住非道亦非非道，漏盡得解脫不？」
「不也！世尊！我無所住，不受諸法，漏盡心得解脫。」
佛告須菩提：「菩薩摩訶薩亦如是，無所住，應實際作證。」#84.61
~2420
%76.196 （三）一切種智：遍知諸法相，空假皆無礙
%76.197 1、須菩提問
須菩提言：「世尊！云何為一切種智相？」
%76.198 2、佛答
%76.199 （1）通達諸法寂滅相
佛言：「一相故名一切種智，所謂一切法寂滅相。#84.62
%76.200 （2）通達諸法名相言說
復次，諸法行類、相貌、名字顯示說，佛如實知。
以是故名一切種智。」#84.63
%76.201 （貳）明斷差別
%76.202 一、煩惱斷、習氣斷之別
%76.203 （一）總明：斷煩惱無別，斷習氣有異［佛習氣永盡，餘乘未斷盡］
須菩提白佛言：「世尊！一切智、道種智、一切種智──是三智結斷有差別、有盡、有餘不？」#84.64
佛言：「煩惱斷無差別；諸佛煩惱習一切悉斷，聲聞、辟支佛煩惱習不悉斷。」#84.65
%76.204 （二）別釋
%76.205 1、三乘煩惱斷是皆無為
「世尊！是諸人不得無為法得斷煩惱耶？」
佛言：「不也！」#84.66
%76.206 2、無為法中無差別
「世尊！無為法中可得差別不？」
佛言：「不也！」
%76.207 3、辨斷煩惱習差別［習非煩惱］
「世尊！若無為法中不可得差別，何以故說是人煩惱習斷、是人煩惱習不斷？」#84.67
~2421佛告須菩提：「習，非煩惱。是聲聞、辟支@t25p647a佛身口有似婬欲、瞋恚、愚癡相，凡#84.68夫愚人為之得罪；是三毒習，諸佛無有。」#84.69
%76.208 二、三乘同證無為，世俗言說成分別
%76.209 （一）三乘同證實相，以無為法顯差別
須菩提白佛言：「世尊！若道無法，涅槃亦無法，何以故分別說是須陀洹、是斯陀含、是阿那含、是阿羅漢、是辟支佛、是菩薩、是佛？」#84.70
佛告須菩提：「是皆以無為法而有分別是須陀洹、是斯陀含、是阿那含、是阿羅漢、是辟支佛、是菩薩、是佛。」#84.71
%76.210 （二）依世俗諦說有差別，於第一義無分別
「世尊！實以無為法故分別有須陀洹乃至佛？」#84.72
佛告須菩提：「世間#84.73言說故有差別，非第一義，第一義中無有分別說。何以故？第一義中無言說道，斷結故說後際。」#84.74
%76.211 三、達自相空皆不可得，則不著一切法
%76.212 （一）諸法自相空故三際不可得
須菩提言：「世尊！諸法自相空中，前際不可得，何況說有後際！」
佛告須菩提：「如是！如是！諸法自相空中，無有前際，何況有後際！無有是處！
須菩提！以眾生不知諸法自相空故，為說是前際、是後際；諸法自相空中，前際、後際不可得。
%76.213 （二）行自相空則不著一切法
如是，須菩提！菩薩摩訶薩應以自相空法行般若波羅蜜。
~2422須菩提！若菩薩行自相空法，則無所著──若內法、若外法，若有為法、#84.75若無為法，若聲聞法、若#84.76辟支佛法、若佛法。」
%76.214 參、釋般若
%76.215 （壹）辨得名義
%76.216 一、須菩提問
須菩提白佛言：「世尊#84.77！常說般若波羅蜜，般若波羅蜜以何義故名般若波羅蜜？」#84.78
%76.217 二、佛答
%76.218 （一）就正智說［行］
佛言：「得第一度，一切法到彼岸，以是義故名般若波羅蜜。#84.79
%76.219 （二）就果法說［果］
復次，須菩提！諸佛、菩薩、辟支佛、阿羅漢用是般若波羅蜜得度彼岸，以是義故名般若波羅蜜。#84.80
%76.220 （三）就境相說［境］
%76.221 1、就壞虛妄義
復次，須菩提！分別、籌量破壞一切法，乃至微塵，是中不得堅實，以是義故名般若波羅蜜。#84.81
%76.222 2、就攝實相義
復次，須菩提！諸法如、法性、實際皆入般若波羅蜜中，以是義故名般若波羅蜜。#84.82
%76.223 3、就空無相義
復次，須菩提！是般若波@t25p647b羅蜜無有法若合若散、若有色若無色、若可見若不可見、若有對若無對、若有漏若無漏、若有為若無為。何以故？是般若波羅蜜無色、無形、無對，一相，所謂無相。
%76.224 （貳）論勝力用
~2423
%76.225 一、能生善法
復次，須菩提！是般若波羅蜜能生一切法、一切樂說辯、一切照明。
%76.226 二、無能壞者
須菩提！是#84.83般若波羅蜜，魔、若魔天、求#84.84聲聞、辟支佛人及餘異道梵志、怨讎#84.85惡人不能斷#84.86壞菩薩行般若波羅蜜。何以故？是人輩，般若波羅蜜中皆不可得故。#84.87
%76.227 三、結
須菩提#84.88！菩薩摩訶薩應如是行般若波羅蜜義。#84.89
%76.228 （參）成諸觀義
復次，須菩提！菩薩摩訶薩欲行深般若波羅蜜義，應行無常義、苦義、空義、無我義，亦應行苦智義、集智義、滅智義、道智義、法智義、比智義、世智義、他心智義、盡智義、無生智義、如實智義。
如是，須菩提！菩薩摩訶薩為般若波羅蜜義故，應行般若波羅蜜。」
%76.229 （肆）明義非義
%76.230 一、依二諦理說
%76.231 （一）須菩提問
須菩提白佛言：「世尊！是深般若波羅蜜中，義與非義皆不可得，云何菩薩為深般若波羅蜜義故應行般若波羅蜜？」#84.90
%76.232 （二）佛答
%76.233 1、就世俗對治義說
%76.234 （1）約煩惱辨
佛告須菩提：「菩薩摩訶薩為深般若波羅蜜義故，應如是念：『貪欲非義，如是義不應行；瞋恚、愚癡非義，如是義不應行；一切邪見無義，如是義不應行。』#84.91
~2424何以故？三毒如相，無有義、無有非義；一切邪見如相，無有義、無有非義。#84.92
%76.235 （2）約善、無記法辨
復次，須菩提！菩薩摩訶薩應作是念：『色非義、非非義，乃至識非義、非非義，檀波羅蜜乃至阿耨多羅三藐三菩提非義、非非義。』
何以故？須菩提！佛得阿耨多羅三藐三菩提時，無有法可得若義、若非義。#84.93
%76.236 2、就諸法實相義說
須菩提！有佛無佛，諸法法相常住，無有是義、無有非義。
%76.237 3、結成
如是，須菩提！菩@t25p647c薩摩訶薩行般若波羅蜜，應離義#84.94、非義。」#84.95
%76.238 二、依無作相說
須菩提白佛言：「世尊！何以故般若波羅蜜非義、非非義？」
佛告須菩提：「一切有為法無作相，以是故，般若波羅蜜非義、非非義。」#84.96
%76.239 三、依無增減說
「世尊！一切賢聖──若佛、若佛弟子皆以無為為義，云何佛言『般若波羅蜜無有義#84.97、非義』？」#84.98
佛言：「雖一切賢聖──若佛、若佛弟子皆以無為為義，亦不以增、亦不以損。
須菩提！譬如虛空如，不能益眾生、不能損眾生；如是，須菩提！菩薩摩訶薩般若波羅蜜無有增、無有損。」#84.99
%76.240 （伍）論得無得
%76.241 一、標宗
~2425「世尊！菩薩摩訶薩不學無為般若波羅蜜得一切種智耶？」#84.100
佛言：「如是！如是！須菩提！菩薩摩訶薩學是無為般若波羅蜜，當得一切種智，不以二法故。」#84.101
%76.242 二、示非：以二法、不二法，皆不能得一切種智
「世尊！不#84.102二法能得不二法耶？」
佛言：「不也！」
須菩提言：「二法能得不二法耶？」
佛言：「不也！」
%76.243 三、顯正：不取相無所得，能得一切種智
須菩提言：「世尊！菩薩摩訶薩若不以二法、亦#84.103不以不二法，云何當得一切種智？」
「須菩提！無所得即是得，以是得無所得。」#84.104
^85.1
#85.2
%77.0 壹、歎方便起心#85.3
%77.1 （壹）須菩提歎般若甚深
須菩提白佛言：「世尊！是般若波羅蜜甚深！世尊！諸菩薩摩訶薩不得眾生，而為眾生求阿耨多羅三藐三菩提，是為甚難！
世尊！譬如人欲於虛空中種樹，是為甚難！世尊！菩薩摩訶薩亦如是，為眾生故，求阿耨多羅三藐三菩提，眾生亦不可得。」#85.4
%77.2 （貳）佛述成，釋歎
%77.3 一、佛述成
佛告須菩提：「如是！如是！諸菩薩摩訶薩所為甚難，為眾生故，求阿耨多羅三藐三菩提，度著吾我顛倒眾生。
%77.4 二、舉喻釋歎
%77.5 （一）法喻合說
須菩提！譬如人種樹，不識樹根、莖、枝、葉、華、果，而愛護溉灌，漸漸長大，華、葉、果實成就，皆得用之。
如是，須菩提！諸菩薩摩訶薩為眾生故，求阿耨多羅三藐三菩提，漸漸行六波羅蜜，得一切種智，成佛樹，以葉、華、果實益眾生。#85.5
~2442
%77.6 （二）別釋
%77.7 1、葉益眾生：離三惡道
須菩提！何等為葉益眾生？
因菩薩摩訶薩得離三惡道，是為葉益眾生。
%77.8 2、華益眾生：受人天樂
何等為華#85.6益眾生？
因菩薩得生剎利大姓、婆羅門大姓、居士大家、四天王天處乃至非有想非無想天處，是為華益眾生。
%77.9 3、果益眾生：得聖道果
何等為果益眾生？
是菩薩得一切種智，令眾生得須陀洹果、斯陀含果、阿那含果、阿羅漢果、辟支佛道、佛道，是#85.7眾生漸漸@t25p652a以三乘法於無餘涅槃而般涅槃，是為果益眾生。
%77.10 （三）結成
是菩薩摩訶薩不得眾生實法，而度眾生令#85.8離我顛倒著，作是念：『一切諸法中無眾生，我所為眾生求一切種智，是眾生實不可得。』」
%77.11 貳、如佛歎
%77.12 （壹）須菩提作斷惡歎
須菩提白佛言：「世尊！當知是菩薩為如佛。#85.9
何以故？是菩薩因緣故，斷一切地獄種、一切畜生種、一切餓鬼種，斷一切諸難，斷一切貧窮下賤道，斷一切欲界、色界、無色界。」#85.10
%77.13 （貳）佛述成，釋歎
%77.14 一、約生善斷惡因菩薩有，故說如佛
佛言：「如是！如是！須菩提！當知是菩薩摩訶薩如佛。須菩提！若菩薩摩訶薩不發~2443心求阿耨多羅三藐三菩提，世間則無過去、未來、現在諸佛，世間亦無辟支佛、阿羅漢、阿那含、斯陀含、須陀洹；三惡趣及三界亦無斷時。
%77.15 二、約體如故說如佛
須菩提！汝所說：『是菩薩摩訶薩當知如佛。』
如是！如是！須菩提！當知是菩薩實如佛。何以故？以如故說如來，以如故說辟支佛、阿羅漢、一切賢聖；以如故說為色乃至識，以如故說一切法乃至有為性、無為性。是諸#85.11如，如實無異，以是故說名為如。
諸菩薩摩訶薩學是如，得一切種智，得名如來。
以是因緣故說菩薩摩訶薩當知如佛，以如相故。#85.12
%77.16 參、勸學如#85.13
%77.17 （壹）明利益
如是，須菩提！菩薩摩訶薩應學如般若波羅蜜。
菩薩學如般若波羅蜜，則能學一切法如；學一切法如，則得具足一切法如；具足一切法如已，住#85.14一切法如得自在；住一切法如得自在已，善知#85.15一切眾生根；#85.16善知一切眾生根已，知#85.17一切眾生根具足；知#85.18一切眾生根具足已，亦知一切眾生業因緣；知一切眾生業因緣已，得願智具足；得#85.19願智具足已，淨三世慧；淨三世慧已，饒益一切眾生；@t25p652b饒益一切眾生已，淨佛國土；淨佛國土已，得一切種智；得一切種智已，轉法輪；轉法輪已，安立眾生於三乘，令入無餘涅槃。#85.20
~2444
%77.18 （貳）勸發心
如是，須菩提！菩薩摩訶薩欲得一切功德，自利利人，應發阿耨多羅三藐三菩提心。」#85.21
%77.19 肆、顯勝校德
%77.20 （壹）一切世間人應作禮能如說行深般若者
須菩提白佛言：「世尊！是諸菩薩摩訶薩能如說行深般若波羅蜜，一切世間天及人、阿修羅應#85.22當作#85.23禮。」
佛告須菩提：「如是！如是！是#85.24菩薩摩訶薩能如說行深#85.25般若波羅蜜，一切世間天及人、阿修羅應當為作禮。」
%77.21 （貳）校量功德
%77.22 一、明初發意菩薩德勝
%77.23 （一）勝發二乘心者
「世尊！是初發意菩薩摩訶薩為眾生故求阿耨多羅三藐三菩提，得幾所福德？」
佛告須菩提：「若千#85.26國土中眾生皆發聲聞、辟支佛意，於汝意云何？其福多不？」
須菩提言：「甚多無量！」
佛告須菩提：「其福不如#85.27初發意菩薩摩訶薩，百倍、千倍、巨億#85.28萬倍，乃至算數譬喻所不能及。何以故？發聲聞、辟支佛意者皆因菩薩出故，菩薩終不因聲聞、辟支佛出。二千世界、三千大千世界中亦如是。
%77.24 （二）勝住乾慧地者
置是三千大千世界中住聲聞、辟支佛地者。若三千大千世界中眾生皆住乾慧地，其福多不？」
須菩提言：「甚多無量！」
佛言：「不如初發意菩薩，百倍、千倍、巨億萬倍，乃至算數譬喻所不能及。
~2445
%77.25 （三）勝住性地乃至住辟支佛地者
置是住乾慧地眾生。若三千大千世界中#85.29眾生皆住性地、八人地、見地、薄地、離欲地、已辦地、辟支佛地，#85.30是一切福德，欲比初發意菩薩，百倍、千倍、巨億萬倍，乃至算數譬喻所不能及。
%77.26 二、明菩薩漸次增勝
%77.27 （一）初發意菩薩，不如入法位菩薩
須菩提！若三千大千世界中初發意菩薩，不如入法位菩薩，百千萬倍、巨億萬倍，乃至算數譬喻所不能及。
%77.28 （二）入法位菩薩，不如向佛道菩薩
若三千大千世@t25p652c界中入法位菩薩，不如向佛道菩薩，百千萬倍、巨億萬倍，乃至算數譬喻所不能及。#85.31
%77.29 （三）向佛道菩薩，不如佛功德
若三千大千世界中向佛道菩薩，不如佛功德，百千萬倍、巨億萬倍，乃至算數譬喻所不能及。」#85.32
%77.30 伍、明初發心所念
%77.31 （壹）初發心應念一切種智
須菩提白佛言：「世尊！初發心菩薩摩訶薩當念何等法？」
佛言：「應念一切種智。」#85.33
%77.32 （貳）示一切種智性空
須菩提言：「何等是一切種智？一切種智何等緣？何等增上？何等行？何等相？」
佛告須菩提：「一切種智無所有、無#85.34想、無念、無生、無示。#85.35
如須菩提所問：『一切種智何等緣？何等增上？何等行？何等相？』須菩提！一切種智~2446無法緣，念為增上，寂滅為行，無相為相。須菩提！是名一切種智緣、增上、行、相。」#85.36
%77.33 （參）明色等一切法亦是無法
%77.34 一、正說
須菩提白佛言：「世尊！但#85.37一切種智無法，色、受、想、行、識亦無法？內外法亦無法？四禪、四無量心、四無色定，四念處、四正勤、四如意足、五根、五力、七覺分、八聖道分，空三昧、無相三昧、無作三昧，八背捨、九次第定，佛十力、四無所畏、四無礙智、十八不共法，大慈、大悲、大喜、大捨，初神通、第二、第三、第四、第五、第六神通，有為相、無為相亦無法？」
佛告須菩提：「色亦無法，乃至有為相、無為相亦無法。」#85.38
須菩提言：「世尊！何因緣故一切種智無法，色無法，乃至有為相#85.39、無為相亦無法？」
佛言：「一切種智自性無故，若法自性無是名無法。色乃至有為#85.40、無為相，亦如是。」#85.41
%77.35 二、釋因：緣起無自性故空
「世尊！何因緣故諸法自性無？」
佛言：「諸法和合因緣故#85.42生法中無自性，若無自性是名無法。#85.43以是故，須菩提！菩薩摩訶薩當知一切法無性。何以故？一切法自#85.44性空故，以是故當知一切法無性。」
%77.36 陸、明起行方便
%77.37 （壹）須菩提問
~2447須菩提白佛言：「@t25p653a世尊！若一切法無性，初發意菩薩以何等方便力能行檀波羅蜜，淨佛世#85.45界、成就眾生？能行尸羅#85.46波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜，行初禪乃至第四禪，行慈心乃至捨心，行空處乃至非有想非無想處，內空乃至無法有法空，四念處乃至八聖道分，空三昧、無相三昧、無作三昧，八背捨、九次第定#85.47，佛十力、四無所畏、四無礙智、十八不共法、大慈大悲，能行一切種智，淨佛世界、成就眾生？」
%77.38 （貳）佛答
%77.39 一、起無所有方便行，教化眾生、淨佛世界
%77.40 （一）空有無礙方便行
佛告須菩提：「菩薩摩訶薩能學諸法無性，亦能淨佛世界、成就眾生，知世界、眾生亦無性，即是方便力。#85.48
須菩提！是#85.49菩薩摩訶薩行檀波羅蜜修學佛道，行尸羅波羅蜜修學佛道，行#85.50羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜修學佛道，乃至行一切種智修學佛道，亦知佛道無性。
是菩薩摩訶薩#85.51行六波羅蜜修學佛道，乃至未成就佛十力、四無所畏、四無礙智、十八不共法、大慈大悲、一切種智，是為修學佛道，能具足#85.52佛道因緣；具足佛道因緣已#85.53，用一念相應慧得一切種智；#85.54爾時，一切煩惱習永盡，以不生故。
%77.41 （二）以佛眼觀一切法畢竟空，有無皆不可得
是時，以佛眼觀三千大千世界，無法尚不可得，何況有法！#85.55
%77.42 （三）勸學方便行無所有般若
如是，須菩提！菩薩摩訶薩應行無性般若波羅蜜。
須菩提！是名菩薩摩訶薩方便力。
~2448無法尚不可得，何況有法！#85.56
　%77.43 二、一切法無作者故，知諸法無作，皆無所有
須菩提！是#85.57菩薩摩訶薩若布施時，布施──無法尚不可#85.58得，何況有法！受者及菩薩心──無法尚不知，何況有法！#85.59乃至一切種智，得者、得法、得處──無法尚不知，何況#85.60有法！#85.61
何以故？一切法本性爾。非佛作，非@t25p653b聲聞、辟支佛#85.62作，亦非餘人作，一切法無作者故。」#85.63
%77.44 柒、明諸法無所有，不失能知義
%77.45 （壹）菩薩知諸法無所有，以世俗諦為眾生示有無
須菩提白佛言：「世尊！諸法、諸法性離耶？」
佛言：「如是！如是！諸法、諸法性離。」
「世尊！若諸法、諸法性離，云何離法能知離法若有、若無？何以故？無法不能知無法，有法不能知有法；無法不能知有法，有法不能知無法。世尊！如是一切法無所有相，云何菩薩摩訶薩作是分別是法若有、若無？」#85.64
佛言：「菩薩摩訶薩以世諦故示眾生若有、若無，非以第一義。」#85.65
~2449
%77.46 （貳）二諦如無異，為眾生故依世俗分別說
%77.47 一、二諦如無異
「世尊！世諦、第一義諦有異耶？」
「須菩提！世諦、第一義諦無異也。何以故？世諦如即是第一義諦如。#85.66
%77.48 二、為眾生故依世俗分別說
%77.49 （一）眾生不知不見如故，依世俗說有無
以#85.67眾生不知、不見是如故，菩薩摩訶薩以世諦示若有、若無。#85.68
%77.50 （二）眾生著相不知空故，欲令知清淨無所有
復次，須菩提！眾生於五受眾中有著相故，不知無所有；為是眾生故，示若有、若無，令知清淨無所有。#85.69
%77.51 （參）勸學無所有般若
如是，須菩提！菩薩摩訶薩應當作是行般若波羅蜜。」
^85.2
%78.0 壹、明菩薩行
%78.1 （壹）總標：為無上菩提行，是名菩薩行
%78.2 一、須菩提問
須菩提白佛言：「世尊！世尊說菩薩行，何等是菩薩行？」
%78.3 二、佛答
佛言：「菩薩行者，為阿耨多羅三藐三菩提行，是名菩薩行。」#85.97
%78.4 （貳）觀諸法空，修六度等，不作二相，是名為無上菩提修菩薩行
「世尊！云何菩薩摩訶薩為阿耨多羅三藐三菩提行#85.98？」
佛言：「若菩薩摩訶薩行色空，#85.99行受、想、行、識空；行眼空，乃@t25p655a至意；行色空，乃至法；行眼界空，乃至意識界；
行檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜；
行內空、行外空、行內外空、行空空、行大空、行#85.100第一義空、有為空、無為空、畢竟空、無始空、散空、#85.101諸法空、性空#85.102、自相空、#85.103無法空、有法空、無法有法空；
行初禪、第二#85.104、第三#85.105、第四禪，
行慈、悲、喜、捨，
行無量虛空處、無量識處、無所有處、非有想非無想處；
行四念處，行四正勤、四如意足、五根、五力、七覺分、八聖道分；
行空三昧，行無相、#85.106無作三昧；
行八背捨、九次第定；
行佛十力、行四無所畏、行四無礙智、行十八不共法、行大慈大悲；
~2456行淨佛國土、行成就眾生；
行諸辯才、行#85.107文字入無文字、行諸陀羅尼門；#85.108
行有為性、行無為性，如阿耨多羅三藐三菩提不作二。
如是，須菩提！菩薩摩訶薩行般若波羅蜜，名為『阿耨多羅三藐三菩提行#85.109』。」#85.110
%78.5 貳、明得果
%78.6 （壹）明佛義
須菩提白佛言：「世尊！世尊#85.111說言佛，何義故名佛？」
佛告須菩提：「知諸法實義故名為佛。復次，得諸法實相故名為佛。復次，通達實義故名為佛。復次，如實知一切法故名為佛。」#85.112
%78.7 （貳）明菩提義
%78.8 一、須菩提問
須菩提言：「何義故名菩提？」
%78.9 二、佛答
%78.10 （一）空、如、法性、實際是菩提
「須菩提！空義是菩提義，如義#85.113、法性義、實際義是菩提義。
%78.11 （二）名相言說是菩提
復次，須菩提！名相言說是菩提義#85.114。#85.115
%78.12 （三）不可壞、不可分別是菩提
須菩提！菩提實義不可壞、不可分別是菩提義。#85.116
~2457
%78.13 （四）諸法實相不誑不異是菩提
復次，須菩提！諸法實相不誑不異是菩提義。
以是故名菩提。
%78.14 （五）舉人釋法
%78.15 1、約人說：菩提是諸佛所有故名菩提
復次，須菩提！是菩提#85.117，諸佛所有故名菩提。#85.118
%78.16 2、約智說：諸佛正遍知故名菩提
復次，須菩提！諸佛正遍知故名為#85.119菩提。」#85.120
%78.17 參、以無所有方便行，具行三事#85.121利益眾生
%78.18 （壹）般若畢竟淨，菩薩行道時於諸法無得失
須菩提白佛言：「世尊！若菩薩摩訶薩為是#85.122菩提行六波羅蜜乃至行@t25p655b一切種智，於諸法何得何失、何增何減、何生何滅、何垢何淨？」
佛告須菩提：「若菩薩摩訶薩#85.123行六波羅蜜乃至行一切種智，於諸法無得無失、無增無減、無生無滅、無垢無淨。何以故？菩薩摩訶薩行般若波羅蜜，不為得失、增減、生滅、淨垢#85.124故出。」#85.125
%78.19 （貳）不以二法行諸道
須菩提白佛#85.126言：「世尊！若菩薩摩訶薩行般若波羅蜜，不為得失乃至不為淨垢故出，菩薩摩訶薩云何行般若波羅蜜，能取檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜？云何行內空#85.127乃至無法有法空？云何行禪、無量心、無色定？云何行四念處乃至八聖道分？云何行空、無相、無作解脫門？云何行佛十力、四無所畏、四無礙智、十八不共法、大慈大悲？云何行菩薩十地？云何過聲聞、辟支佛地，入菩薩位中？」
~2458佛告須菩提：「菩薩摩訶薩行般若波羅蜜時，不以二法故#85.128行檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜，不以二法乃至行一切種智。」
%78.20 （參）菩薩行不二法，能增益善根，世間眾生及眾惡皆不能壞
%78.21 一、行不二法，增益善根
須菩提言：「世尊！若菩薩摩訶薩不以二法故行檀波羅蜜乃至般若波羅蜜，不以二法故乃至行一切種智，菩薩從初發意乃至後#85.129意云何善根增益？」
佛告須菩提：「若行二法者，善根不得增益。何以故？一切凡夫#85.130皆依二法，不得增益善根。菩薩摩訶薩行不二法，從初發意乃至後意，於其中間增益善根。#85.131
%78.22 二、一切世間眾生不能壞菩薩令墮二乘地
以是故，菩薩摩訶薩，一切世間天及人、阿修羅無能伏，無能壞其善根、令#85.132墮聲聞、辟支佛地；#85.133
%78.23 三、諸惡不善法不能壞六度等諸善法
及諸眾惡不善法不能制菩薩令不能行檀波羅蜜、增益@t25p655c善根，乃至般若波羅蜜亦如是。#85.134
%78.24 四、結
須菩提！菩薩摩訶薩應如是行般若波羅蜜。」
%78.25 （肆）依正觀具足三事#85.135，自利利他得無上菩提
%78.26 一、不為善根、非善根故行般若
%78.27 （一）正說
「世尊！菩薩摩訶薩為善根故行般若波羅蜜不？」
佛言：「不也！須菩提！菩薩摩訶薩#85.136亦不為善根故行般若波羅蜜，亦不#85.137為非善根故行般若波羅蜜。
%78.28 （二）釋因：三事未成，不能得佛智
~2459何以故？須菩提！菩薩摩訶薩法，未供養諸佛、未具足善根、未得真知識，不能得一切種智。」
%78.29 二、勸行三事，能得一切種智
%78.30 （一）須菩提問
須菩提言：「世尊！云何菩薩摩訶薩供養諸佛、具足善根、得真知識能得一切種智？」
%78.31 （二）佛答
%78.32 1、明三事
%78.33 （1）供養諸佛
佛告須菩提：「菩薩摩訶薩從初發意供養諸佛。
%78.34 （2）具足善根
諸佛所說十二部經──修妬路乃至憂波提舍，是菩薩聞、持、誦利、心觀、了達；了達故，得陀羅尼；得陀羅尼故，能起無礙智；起無礙智故，所生處，乃至薩婆若，終不忘失是法#85.138。亦於諸佛所種善根，為是善根所護，終不墮惡道諸難。
以是善根因緣故，得深心#85.139清淨#85.140；得深心清淨故，能淨佛國土、成就眾生。#85.141
%78.35 （3）親近善知識
以善根所護故，常不離真知識，所謂諸佛、諸菩薩摩訶薩及諸聲聞能讚歎佛、法、眾者。#85.142
%78.36 2、結勸應修
如是，須菩提！菩薩摩訶薩應供養諸佛、種善根、親近善知識。」
^85.3
%79.0 壹、論具足善根義
%79.1 （壹）明行三事尚難得道，何況不行
%79.2 一、須菩提問
須菩提白佛言：「世尊！菩薩摩訶薩若不供養諸佛、不具足善根、不得真知識，當得薩婆若不？」
%79.3 二、佛答
佛告須菩提：「菩薩摩訶薩供養諸佛、種善根、得真知識，一切種智尚難得，何況不供養諸佛、不種善根、不得真知識！」
%79.4 （貳）明離方便故難得道
須菩提白佛言：「世尊！菩薩摩訶薩供養諸佛、種善根、得真知識，何以故難得一切種智？」
佛告須菩提：「是菩薩摩訶薩遠離方便力，不從諸佛聞方便力，所種善根不具足，不常隨善知識教。」#85.178
~2467
%79.5 貳、正明方便善成
%79.6 （壹）舉布施度明
%79.7 一、以有無心行布施度
%79.8 （一）應薩婆若心，三輪體空
「世尊！何等是方便力，菩薩摩訶薩行是方便力，得一切種智？」
佛言：「菩薩摩訶薩從初發意行檀波羅蜜，應薩婆若念。
布施佛、若辟支佛、若聲聞、若人、若非人，是時不生布施想、受者想。何以@t25p657c故？觀一切法自相空、無生、無定相、無所轉，入諸法實相，所謂一切法無作無起相。#85.179
%79.9 （二）增益善根，嚴土熟生
菩薩以是方便力故，增益善根；增益善根故，行檀波羅蜜，淨佛國土、成就眾生。#85.180
%79.10 二、不受世間果報，但為救眾生故行施度
布施不受世間果報，但欲救度一切眾生故行檀波羅蜜。#85.181
%79.11 （貳）例餘五度
%79.12 一、戒度
復次，須菩提！菩薩摩訶薩從初發意行尸羅波羅蜜，應薩婆若念。
持戒時，不墮婬怒#85.182癡中，亦不墮諸煩惱纏縛#85.183及諸不善破道法──若慳貪、破戒、瞋恚、懈怠、亂意、愚癡，慢、大慢、慢慢、我慢、增上慢、不如慢、邪慢，若聲聞心、若辟支佛心。何以故？是菩薩摩訶薩觀一切法自相空、無生、無定相、無所轉，入諸法實相，所謂一切法#85.184無作#85.185無起相#85.186。
菩薩成就是方便力故，增益善根；增益善根故，行尸羅波羅蜜，淨佛國土、成就眾生。
持戒不受世間果報，但欲救度一切眾生故行尸羅波羅蜜。
~2468
%79.13 二、忍度
復次，須菩提！菩薩摩訶薩從初發意行羼提波羅蜜，應薩婆若念。
方便力成就故，行見諦道、思惟道，亦不取須#85.187陀洹果、斯陀含、阿那含、阿羅漢果。何以故？是菩薩摩訶薩知諸法自相空、無生、無定相、無所轉，雖行是助道法，而#85.188過聲聞、辟支佛地。須菩提！是名菩薩無生法忍。#85.189
%79.14 三、精進度
復次，須菩提！菩薩摩訶薩從初發意行毘梨耶波羅蜜，入初禪乃至入#85.190第四禪，入四無量心、四無色定。雖出入諸禪，而不受果報。何以故？是菩薩成就是方便力故，知諸禪定自相空、無生、無定相、無所轉，淨佛國土、成就眾生。
精進不受世間果報，但欲救度一切眾生故，行毘梨耶波羅蜜。#85.191
%79.15 四、禪定度
復次，須菩提！菩薩摩訶薩從初發意行禪@t25p658a波羅蜜，應薩婆若念，入#85.192八背捨、九次第定。
亦不證須陀洹果，乃至不證阿羅漢果。何以故？是菩薩摩訶薩知諸法自相空、無生、無定相、無所轉。#85.193
%79.16 五、般若度
復次，須菩提！菩薩摩訶薩從初發意行般若波羅蜜，學佛十力、四無所畏、四無礙智、~2469十八不共法、大慈大悲，乃至未得一切種智、未淨佛國土、未成就眾生，於其中間應如是行#85.194。何以故？是菩薩摩訶薩知諸法自相空、無生、無定相、無所轉。
須菩提！是#85.195菩薩摩訶薩應如是行般若波羅蜜，不受果報。」#85.196
^86.1
%80.0 壹、歎「方便具足，不受世間果報」
%80.1 （壹）標歎
%80.2 一、須菩提歎
爾時，須菩提白佛言：「世尊！是菩薩摩訶薩大智慧成就，行是深法，亦不受果報。」
%80.3 二、佛述歎說因
佛告須菩提「如是！如是！菩薩摩訶薩大智慧成就，行是深般若波羅蜜，亦不受果報。何以故？是菩薩摩訶薩，諸法性中不動故。」#86.3
%80.4 （貳）釋歎
%80.5 一、須菩提問：於何等諸法性中不動
「世尊！何等諸法性中不動？」
%80.6 二、佛答：諸法性無所有故，於色性乃至大慈悲等性中不動
佛言：「於無所有性中不動。#86.4
復次，菩薩摩訶薩，色性中不動，受、想、行、識性中不動；#86.5檀波羅蜜性中不動，尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜性中不動；四禪性中不動，四無量性中不動，四無色定性中不動；四念處性中不動，乃至八聖道分性中不動；空三昧、無相、無作三昧乃至大慈大悲性中不動。
何以故？須菩提！是諸法性即是無所有。#86.6
%80.7 貳、明「離諸戲論，得出世果」
%80.8 （壹）明得道
~2472
%80.9 一、以四句戲論不能得道
%80.10 （一）不能以無所有法得所有法
須菩提！以無所有法#86.7不能得所有法。」#86.8
%80.11 （二）不能以所有法得所有法
須菩提言：「世尊！所有法能得所有法不？」
佛言：「不也！」
%80.12 （三）不能以所有法得無所有法
「世尊！所有法能得無所有法不？」
佛言：「不也！」
%80.13 （四）不能以無所有得無所有法
「世尊！無所有法能得無所有法不？」
佛言：「不也！」
%80.14 二、若離四句戲論，即是道
「世尊！若無所有不能得所有，所有不能得所有，所有不能得無所有，無所有不能得無所有，將無世尊不得道耶？」#86.9
佛言：「有得，不以此四句。」
「世尊！云何有得？」
佛言：「非所有、非無所有，無諸戲論，是名得道。」#86.10
%80.15 （貳）明入菩薩位#86.11
%80.16 一、明戲論相
%80.17 （一）須菩提問
須菩提白佛言：「世尊！何等是菩薩摩訶薩戲論？」
%80.18 （二）佛答
佛@t25p659a告須菩提：「菩薩摩訶薩觀色若常、若無常，是為戲論，觀受、想、行、~2473識若常、若無常，是為戲論；
觀色若苦、若樂，受、想、行、識若苦、若樂，是為戲論；
觀色若我、若非我，受、想、行、識若我、若非我；
色若寂滅、若不寂滅，受、想、行、識若寂滅、若不寂滅，是為戲論。
苦聖諦應見、集聖諦應斷、滅聖諦應證、道聖諦應修，是為戲論。
應修四禪、四無量心、四無色定，是為戲論；
應修四念處、四正勤、四如意足、五根、五力、七覺分、八聖道分，是為戲論；
應修空解脫門、無相解脫門、無作解脫門，是為戲論；
應修八背捨、九次第定，是為戲論。
我當過須陀洹果、斯陀含果、阿那含果、阿羅漢果、辟支佛道，是為戲論。
我當具足菩薩十地，是為戲論。我當入菩薩位，是為戲論。
我當淨佛國土，是為戲論；我當成就眾生，是為戲論。
我當生佛十力、四無所畏、四無礙智、十八不共法，是為戲論；
我當得一切種智，是為戲論；我當斷一切煩惱習，是為戲論。
%80.19 二、明離戲論
%80.20 （一）應行無戲論般若
%80.21 1、於五蘊乃至一切種智不應戲論
須菩提！是菩薩摩訶薩行般若波羅蜜時，色若常、若無常不可戲論故不應戲論，受想行識若常、若無常不可戲論故不應戲論，乃至一切種智不可戲論故不應戲論。
%80.22 2、釋因：諸法因緣生，但有假名故
何以故？性不戲論性，無性不戲論無性；離性、無性，更無法可得，所謂戲論者、戲論法、戲論處。以是故，須菩提！色無戲論，受想行識乃至一切種智無戲論。#86.12
%80.23 3、勸行無戲論般若
如是，須菩提！菩薩摩訶薩應行無戲論般若波羅蜜。」
%80.24 （二）重示因緣：無性故不可戲論
須菩提白佛言：「世尊！云何色不可戲論，乃至一切種智不可戲論？」
佛告須菩提：「色性無，乃至一切種智性無。須@t25p659b菩提！若法性無，即是無戲論。#86.13
~2474以是故，色不#86.14可戲論，乃至一切種智不可戲論。
%80.25 三、顯益：入菩薩位
須菩提！若菩薩摩訶薩能如是行無戲論般若波羅蜜，是時得入菩薩位。」#86.15
%80.26 參、正明遍學諸道
%80.27 （壹）論「以何道入菩薩位」
%80.28 一、須菩提問
須菩提白佛言：「世尊！若諸法無有性，菩薩行何等道入菩薩位？為用聲聞道？為用辟支佛道？為用佛道？」#86.16
%80.29 二、佛答
%80.30 （一）明理：菩薩遍學諸道，得入菩薩位
佛告須菩提：「不#86.17以聲聞道、不以辟支佛道、不以佛道得入菩薩位，菩薩摩訶薩遍學諸道，得入菩薩位。
%80.31 （二）舉喻：小乘見諦喻
須菩提！譬如八人先學諸道然後入正位#86.18，未得果而先生果道。#86.19
%80.32 （三）合法
菩薩亦如是，先遍學諸道然後入菩薩位，亦未得一切種智而先生金剛三昧，爾時以一念相應慧得一切種智。」#86.20
%80.33 （貳）釋遍學難
%80.34 一、須菩提難
%80.35 （一）述說
%80.36 1、諸道各異
須菩提白佛言：「世尊！若菩薩摩訶薩遍學諸道入菩薩位者，八人向須陀洹、得須陀洹，向斯陀含、得斯陀含，向阿那含、得阿那含，向阿羅漢、得阿羅漢，辟支佛道、佛道，是諸道各各異。
~2475
%80.37 2、若遍學諸道，則所成諸道亦應各異
世尊！若菩薩摩訶薩遍學諸道然後入菩薩位者，是菩薩若生八道，應作八人！生見道，應作須陀洹！生思惟道，應作斯陀含、作阿那含、作阿羅漢！若生辟支佛道，作辟支佛！#86.21
%80.38 （二）正難
世尊！若菩薩摩訶薩作八人，然後入菩薩位，無有是處！
不入菩薩位，得一切種智，亦無是處！
作須陀洹乃至作辟支佛，然後入菩薩位，亦無是處！
不入菩薩位，得一切種智，亦無是處！
%80.39 （三）結所疑
世尊！我云何當知菩薩摩訶薩遍學諸道得入菩薩位？」
%80.40 二、佛答
%80.41 （一）佛印可：若入二乘聖位，則不入菩薩位，不得一切種智
佛告須菩提：「如是！如是！若菩薩摩訶薩作八人、得須陀洹果乃至得阿羅漢果、得辟支佛道，然後入菩薩位，無有是處！不入菩薩位，當得一切種智，無有是處！
%80.42 （二）釋其難
%80.43 1、菩薩以智觀過八地，以道種智入菩薩位，以一切種智斷煩惱習
須菩@t25p659c提！若菩薩摩訶薩從初發意行六波羅蜜時，以智觀過八地。何等八地？乾慧地、性地、八人地、見地、薄地、離欲地、已辦地、辟支佛地。以道種智入菩薩位；入菩薩位已，以一切種智斷一切煩惱習。#86.22
%80.44 2、二乘智斷皆是菩薩忍
須菩提！是#86.23八人若智若斷，是菩薩無生法忍；須陀洹若智若斷、斯陀含若智若斷、阿那含若智若斷、阿羅漢若智若斷、辟支佛若智若斷皆是菩薩忍。#86.24
%80.45 3、得無生忍入菩薩位，更斷煩惱習成佛道
菩薩學如是聲聞、辟支佛道，以道種智入菩薩位；入菩薩位已，以一切種智斷一切煩惱習，得佛道。
~2476
%80.46 （三）結勸
如是，須菩提！菩薩摩訶薩遍學諸道具足，應得阿耨多羅三藐三菩提；得阿耨多羅三藐三菩提已，以果饒益眾生。」#86.25
%80.47 肆、舉道種智勸修
%80.48 （壹）正舉勸修
%80.49 一、總說
須菩提白佛言：「世尊！世尊#86.26所說道──聲聞道、辟支佛道、佛道，何等是菩薩道種智？」#86.27
佛告須菩提：「菩薩摩訶薩應生一切道#86.28種#86.29淨智。
須菩提！何等是道種淨智？若諸法相貌所可顯示法，菩薩應正知；正知已，為他#86.30演說、開示，令諸眾生得解。是菩薩摩訶薩應解一切音聲語言，以是音聲說法，遍滿三千大千世界，如響相。#86.31
%80.50 二、詳述
%80.51 （一）善觀根性，應機施教
%80.52 1、遮惡道，開善道
%80.53 （1）遮惡道
以是故，須菩提！菩薩摩訶薩應先具足學一切道，道智具足已，應分別知#86.32眾生深心，所謂地獄眾生，地獄道，地獄因，地獄果，應知、應障；#86.33畜生、餓鬼道，畜生、餓鬼因，畜生、餓鬼果，應知、應障；諸龍、鬼神#86.34、犍#86.35闥婆、緊那羅、摩~2477睺羅伽、阿修羅道、因、果，應知、應障。
%80.54 （2）開善道
人道、因、果應知，諸天道、因、果應知──四天王天、三十三天、夜摩天、兜率陀天、化樂天、他化自在天、梵天、光音天、遍淨天、廣果天、無想天、阿婆羅呵天、無熱天、易見天、喜見天、阿@t25p660a迦尼吒天道、因、果應知；無邊虛空處、無邊識處、無所有處、非有想非無想處道、因、果應知。
%80.55 2、示助道法，令入聖道
四念處、四正勤、四如意足、五根、五力、七覺分、八聖道分，因、果，應知；空解脫門、無相解脫門、無作解脫門，佛十力、四無所畏、四無礙智、十八不共法、大慈大悲，因、果應知。
菩薩以是道，令眾生入須陀洹道乃至阿羅漢、辟支佛道，乃至阿耨多羅三藐三菩提道。
%80.56 （二）結義，顯用
須菩提！是名菩薩摩訶薩淨道種智。
菩薩學是道種智已，入眾生深心相；入已，隨眾生心，如應說法，所言不虛。
何以故？是菩薩摩訶薩善知眾生根相，知一切眾生心、心數法生死所趣。#86.36
%80.57 三、勸行道慧般若
須菩提！菩薩摩訶薩如是應行道#86.37般若波羅蜜。
何以故？一切諸善#86.38助道法皆入般若波羅蜜中，諸菩薩摩訶薩、聲聞、辟支佛所應行。」#86.39
%80.58 （貳）諸法性空，不妨修道
%80.59 一、明不妨修道
%80.60 （一）須菩提問
須菩提白佛言：「世尊！若四念處乃至阿耨多羅三藐三菩提──是一切法皆不合不散、無色、無形、無對，一相，所謂無相。世尊！云何是助道法能取阿耨多羅三藐三菩提？世尊！是不合不散、無色、無形、無對，一相，所謂無相法，無所取、無所捨，譬如虛空無取無捨。」#86.40
~2478
%80.61 （二）佛答
%80.62 1、佛印可：諸法自相空故無取無捨
佛言：「如是！如是！須菩提！諸法自相#86.41空，無所取、無所捨。
%80.63 2、欲令眾生悟空故依世俗諦說
%80.64 （1）分別助道法令得菩提
須菩提！有眾生不知諸法自相空，為是#86.42眾生故，顯示助道法能至阿耨多羅三藐三菩提。#86.43
%80.65 （2）示一切法皆畢竟空、無相
復次，須菩提！所有#86.44色、受、想、行、識，所有檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜，所有內空、外空乃至無法有法空，初禪乃至非有想非無想處，四念處#86.45乃至八聖道分，三解脫門，八背捨、九次第定，佛十力、四@t25p660b無所畏、四無礙智、十八不共法、大慈大悲、一切種智等諸法，於是聖法中，皆不合不散、無色、無形、無對，一相，所謂無相。
%80.66 （3）以世俗諦為眾生說
以#86.46世俗法故，為眾生說令解，非以第一義。
%80.67 二、勸如道而學
%80.68 （一）勸學聖法
%80.69 1、總標：應以知、見學一切法，善分別應用不應用
須菩提！於是一切法中，菩薩摩訶薩以智、見如法應學；學已，分別諸法應用、不應用。」#86.47
%80.70 2、料簡
%80.71 （1）二乘法知而不應用
須菩提言：「世尊！何等法菩薩分別已，應用、不應用？」
佛言：「聲聞、辟支佛法，分別知，不應用；
%80.72 （2）一切種智知而應用
一切種智，分別知，應用。
~2479
%80.73 3、勸學
如是，須菩提！菩薩摩訶薩於是聖法中應學般若波羅蜜。」#86.48
%80.74 （二）釋聖法義
%80.75 1、須菩提問
須菩提白佛言：「世尊！何以故說名聖法？何等是聖法？」
%80.76 2、佛答
%80.77 （1）於一切法不合不散是為聖法
佛告須菩提：「諸聲聞、辟支佛法，諸#86.49菩薩摩訶薩及諸佛，於欲、瞋、癡不合不散，身見、戒取、疑不合不散，欲染、瞋恚不合不散，色染、無色染、掉#86.50、慢、無明不合不散；#86.51初禪乃至第四禪不合不散，慈、悲、喜、捨、虛空處乃至非有想非無想處不合不散；四念處乃至八聖道分不合不散；內空乃至大悲、有為性、無為性不合不散。
%80.78 （2）釋不合不散之因
何以故？是一切法皆無色、無形、無對，一相，所謂無相。
無色法與無色法不合不散，無形法與無形法不合不散，無對法與無對法不合不散，一相法與一相法不合不散，無相法與無相法不合不散。
%80.79 （3）勸學無相般若
須菩提！是無色、無形、無對，一相，所謂無相般若波羅蜜，諸菩薩摩訶薩應學；學#86.52已，不得諸法相。」#86.53
%80.80 三、勸修無相
%80.81 （一）明不以有相修般若
%80.82 1、須菩提遍舉諸相問
須菩提白佛言：「世尊！菩薩摩訶薩不學色相耶？不學受、想、行、識相耶？不學眼相乃至意相，不學色相乃至法相，不學地種相乃至識種相，不學檀波羅蜜相、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅@t25p660c蜜相，不學內空乃至無法有法空相，#86.54不學初禪相乃至第四禪相，不學慈相乃至捨相，不學無~2480邊空相乃至非有想非無想相#86.55，不學四念處相乃至八聖道分相，不學空三昧相、無相#86.56、無作三昧相，不學八背捨、九次第定相，不學佛十力相、四無所畏#86.57、四無礙智相、十八不共法相、大慈大悲相，不學苦聖諦相、集滅道聖諦相，不學逆順十二因緣相，不學有為性相、無為性相耶？
世尊！若不學諸法相，菩薩摩訶薩云何學諸法相若有為、若無為，學已，過聲聞、辟支佛地？若不過聲聞、辟支佛地，云何入菩薩位？若不入菩薩位，云何當得一切種智？若不得一切種智，云何當轉法輪？若不轉法輪，云何以三乘度眾生生死？」
%80.83 2、佛答
%80.84 （1）正觀：破取相行
佛告須菩提：「若諸法實有相，菩薩應學是相。須菩提！以一切法實無有#86.58相，無色、無形、無對，一相，所謂無相。以是故，須菩提！菩薩摩訶薩不學相、不學無相。
%80.85 （2）釋因：諸法本無相
何以故？有佛、無佛，諸法一相，性常住。」#86.59
%80.86 （二）正明以無相修般若
%80.87 1、修無相即是修般若
須菩提白佛言：「世尊！若一切法非有相、非無相，菩薩摩訶薩云何修般若波羅蜜？若不修般若波羅蜜，不能過聲聞、辟支佛地；若不過聲聞、辟支佛地，不能入菩薩位；若不入菩薩位，不得無生法忍；若不得無生法忍，不能得諸菩薩神通；若不得菩薩神通，不能淨佛國土、成就眾生；若不淨佛國土、成就眾生，不能得一切種智；若不得一切種智，不能轉法輪；若不轉法輪，不能令眾生得須陀洹果、斯陀含、阿那含、阿羅漢果、辟支佛道，不能令得阿耨多羅三藐三菩提，亦不能令眾生@t25p661a得布施福，亦不能令得持戒、修定福。」
佛告須菩提：「如是！如是！諸法無相，非一相、非異相；若修無相，是修般若波羅蜜。」#86.60
%80.88 2、修諸法壞是修般若
%80.89 （1）正述
須菩提言：「世尊！云何修無相是修般若波羅蜜？」
~2481佛言：「修諸法壞，是修般若波羅蜜。」#86.61
%80.90 （2）論修何法壞是修般若
「世尊！云何修諸法壞是修般若波羅蜜？」
佛言：「修色#86.62壞，是修般若波羅蜜；修受、想、行、識壞，是修般若波羅蜜。#86.63
修眼壞、耳、鼻、舌、身、意法壞，是修般若波羅蜜；修色法壞，聲、香、味、觸、法壞，是修般若波羅蜜。
修不淨觀壞，是修般若波羅蜜。修初禪壞，第二、第三、第四禪壞，是修般若波羅蜜；修慈、悲、喜、捨壞，是修般若波羅蜜；修無邊空#86.64處、無邊識處、無所有處、非有想非無想處壞，是修般若波羅蜜。
修念佛、念法、念僧、念戒、念捨、念天、念滅、念安般#86.65壞，是修般若波羅蜜。修無常相、苦相、無我相、空相、集相、因相、生相、緣相、閉相、滅相、妙相、出相、道相、正相、跡相、離相壞，是修般若波羅蜜。
修十二因緣壞，修#86.66我相、眾生相#86.67、壽命相壞#86.68乃至修知者、見者相壞，是修般若波羅蜜。
修常相、樂相、淨相、我相壞，是修般若波羅蜜。
修四念處乃至八聖道分壞，是修般若波羅蜜。
修空三昧、無相三昧、無作三昧壞，是修般若波羅蜜。
修八背捨、九次第定壞，是修般若波羅蜜。
修有覺有觀三昧#86.69、無覺有觀三昧、無覺無觀三昧壞，是修般若波羅蜜。
修苦聖諦、集聖諦、滅聖#86.70諦、道聖諦壞，是修般若波羅蜜。
修苦智、集智、滅智、道智壞，是修般若波羅蜜；修盡智、無生智壞，是修般若波羅蜜；修法智、比智、世智、他心智壞，是修般若波羅蜜。
修檀波羅@t25p661b蜜壞，是修般若波羅蜜；修尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜壞，是修般若波羅蜜。
修內空、外空、內外空、空空、大空、第一義空、有為空、無為空、畢竟空、無始空、散空、性空、諸法空、自相空、不可得空、無法空、有法空、無法有法空壞，是修般若波羅蜜。
~2482修佛十力、四無所畏、四無礙智、十八不共法壞，是修般若波羅蜜。
修須陀洹果、斯陀含果、阿那含果、阿羅漢果、辟支佛道壞，是修般若波羅蜜。修一切智壞，是修般若波羅蜜。修斷一切煩惱習壞，是修般若波羅蜜。」
%80.91 3、不念法實有是修般若
%80.92 （1）正述
須菩提白佛言：「世尊！云何名修色壞乃至修斷一切煩惱習壞，是修般若波羅蜜？」
佛告須菩提：「菩薩摩訶薩行般若波羅蜜時，不念有色法，是修般若波羅蜜；不念有#86.71受、想、行、識，乃至不念有壞#86.72一切煩惱習#86.73法，是為修般若波羅蜜。#86.74
%80.93 （2）釋因
何以故？有法念者，不修般若波羅蜜。#86.75
%80.94 （3）示念有之失：不得道果
須菩提！有法念者，不修檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜。
何以故？須菩提！是人著法，不行檀波羅蜜乃至般若波羅蜜。
如是著者，無有解脫、無有道、無有涅槃。
有法念者，不修四念處、四正勤、四如意足、五根、五力、七覺分、八聖道分、不修空三昧乃至不修一切種智。
何以故？是人著法故。」#86.76
%80.95 （4）論有法無法及取相之過失
%80.96 A、明有法、無法
須菩提白佛言：「世尊！何等是有法？何等是無法？」
佛告須菩提：「二者#86.77是有法，不二者是無法。」
~2483
%80.97 B、別明取相之失
%80.98 （A）取相為二，一切二皆是有法
「世尊！何等是二？」
佛言：「色相是二，受、想、行、識相是二，眼相乃至意相是二，色相乃至法相是二，檀波羅蜜乃至佛相、阿耨多羅三@t25p661c藐三菩提相，有為無為性相是二。#86.78
須菩提！一切相皆是二，一切二皆是有法；
%80.99 （B）明過失
%80.100 a、流轉生死苦
適#86.79有法便有生死，適有生死不得離生、老、病、死、憂悲苦惱。#86.80
%80.101 b、無三乘道果
以是因緣故，須菩提！當知二相者，無有檀波羅蜜乃至般若波羅蜜，無有道、無有果，乃至無有順忍，何況見色相乃至見一切種智相！若無修道，云何得須陀洹果乃至阿羅漢果、辟支佛道、阿耨多羅三藐三菩提及#86.81斷一切煩惱習？」
^86.2
%81.0 壹、明「無相無所有行」
%81.1 （壹）明大乘順忍之相
%81.2 一、取有無二相，不得大乘順忍，不能得一切種智
%81.3 （一）須菩提問
爾時，須菩提白佛言：「世尊！若有法相者，尚不得順忍，何況得道！
世尊！若無法相者，當得順忍不？
若乾慧地、若性地、若八人地、若@t25p664c見地、若薄地、若離欲地、若已辦地、若辟支佛地、若菩薩地、若佛地，若修道，因是修道當斷煩惱不？以是煩惱故，不得過聲聞、辟支佛地入菩薩位；若不入菩薩位，則不得一切種智；不得一切種智，則不能得斷一切煩惱習。
世尊！若無有法#86.144，是諸法則不生；若不生是諸法，則不能得一切種智。」#86.145
%81.4 （二）佛印可
佛告須菩提：「如是！如是！若無有法者，則有順忍乃至斷一切煩惱習。」#86.146
%81.5 二、論「離相般若行」
%81.6 （一）須菩提問
須菩提白佛言：「世尊！菩薩摩訶薩行般若波羅蜜時，有法相不？所謂色相乃至識相，眼相乃至意相，色相乃至法相，眼界相乃至意識界相，四念處相乃至一切種智相；#86.147若色相、若色斷相，乃至識相、識斷相，十二入、十八界亦如是；若無明相、若無~2498明斷相，乃至憂悲愁惱相、憂悲愁惱斷相；若欲相、若欲斷相，若瞋相、若瞋斷相，若癡相、若癡斷相，若苦相、若苦斷相，若集相、若集斷相，若滅#86.148相、若滅#86.149斷相，若道相、若道斷相，乃至一切種智相，斷一切煩惱習相。」
%81.7 （二）佛答
%81.8 1、不見有無相即是菩薩順忍，即是修道，亦是道果
佛言：「不也！須菩提！菩薩摩訶薩行般若波羅蜜時，無有法相、非法相，即是菩薩順忍。若無有法相、無有非法相，即是修道，亦是道果。#86.150
%81.9 2、知一切法無所有性，有法是菩薩道，無法是菩薩果
須菩提！菩薩摩訶薩，有法是菩薩道，無法是菩薩果。#86.151
以是因緣故，當知一切法無所有性。」#86.152
%81.10 （貳）佛引己所證，顯修行之方
%81.11 一、知一切法無所有性，成佛得自在
%81.12 （一）須菩提問
須菩提白佛言：「世尊！若一切法無所有性，佛云何知一切法無所有性故得成佛，於一切法得自在力？」
%81.13 （二）佛答
%81.14 1、印可諸法無有所性
佛告須菩提：「如是！如是！一切法無所有性。
%81.15 2、以無所有智合行一切法，斷一切著得菩提，隨三聚眾生善說法
%81.16 （1）修禪定而不著
我本行菩薩道修六波羅蜜，離諸欲、離惡不善法，有覺有觀，離生喜樂，入初禪，乃至入第四禪；於@t25p665a是諸禪及支#86.153取相，不念有是禪#86.154，不受禪味，不得是~2499禪，無染、清淨行四禪，我於是諸禪不受果報。#86.155
%81.17 （2）起五神通而不著
依四禪住，起五神通──身通、天耳、知他人心、宿命通、天眼證；於諸神通不#86.156取相，不念有是神通，不受神通味，不得是神通，我於是五神通不分別行。#86.157
%81.18 （3）成佛道，隨三聚眾生善說法
須菩提！我爾時用一念相應慧得阿耨多羅三藐三菩提，所謂是苦聖諦，是集、是滅#86.158、是道聖諦，成就十力、四無所畏、四無礙智、十八不共法，大慈大悲，得作佛，分別三聚眾生：正定、邪定、不定。」#86.159
%81.19 二、諸法無所有而佛能起禪定、神通，雖無眾生而能分別作三聚
%81.20 （一）須菩提問
須菩提白佛言：「云何世尊於諸法無所有性中起四禪、六神通，亦無眾生而分別作三聚？」#86.160
%81.21 （二）佛答
%81.22 1、通達五欲等無所有性故能入禪定
佛言#86.161須菩提：「若諸欲、惡不善法當有性──若自性、若他性，我本為菩薩行時，不能觀諸欲、惡不善法無所有性入初禪；以諸欲、惡不善法無所#86.162有性──若自性、若他性皆是無所有性故，我本行菩薩道時，離諸欲、惡不善法入初禪，乃至入第四禪。#86.163
~2500
%81.23 2、知神通無所有性故得菩提
須菩提！若諸神通有性──若自性、若他性，我不能知是神通無所有性，得阿耨多羅三藐三菩提。須菩提！以神通無有#86.164性──若自性、若他性皆無所有性，以是故，諸佛於神通知無所有性，得阿耨多羅三藐三菩提。」
^87.1
%81.72 貳、為始行菩薩開示修行次第#87.3
%81.73 （壹）須菩提問
須菩提言：「世尊！若菩薩摩訶薩知諸法無所有性，因四禪、五神通，得阿耨多羅三藐三菩提。世尊！新學菩薩摩訶薩#87.4云何於諸法無所有性中次第行、次第學、次第道，以是次第行、次第學、次第道，得阿耨多羅三藐三菩提？」#87.5
%81.74 （貳）佛答
%81.75 一、約發心明
%81.76 （一）但從聖人處聞一切法無所有
佛告須菩提：「菩薩摩訶薩若初從諸佛聞，若從多供養諸佛菩薩聞，若諸阿羅漢、若諸阿那含、若諸斯陀含、若諸須陀洹所聞：『得無所有故是佛，得無所有故是阿羅漢、阿那含、斯陀含、須陀洹，一切賢聖皆以#87.6得無所有故有名。一切有為作法無所有性，乃至無有如毫末#87.7許#87.8所有。』#87.9
~2506
%81.77 （二）雖知諸法畢竟空，為度眾生故求無上菩提
是菩薩摩訶薩聞是已，作是念：『若一切法無所#87.10有性，得無所有#87.11故是佛，乃至得無所有故是須陀洹；我若當得阿耨多羅三藐三菩提、若不得，一切法常無有性，我何以不發心得阿耨多羅三藐三菩提？得阿耨多羅三藐三菩提已，一切眾生行於有相，當令住無所有中。』
%81.78 （三）引過去菩薩次第行、次第學、次第道為證
須菩提！菩薩摩訶薩如是思惟已，發阿耨多羅三藐三菩提心，為度一切眾生故，菩薩摩訶薩所行次第行、次第學、次第道者，如過去諸菩薩摩訶薩所行道，得阿耨多羅三藐三菩提。#87.12
%81.79 二、約六度明
%81.80 （一）標舉
是新發意菩薩應學六波羅蜜，所謂檀波羅蜜、尸羅波羅蜜、羼提波羅@t25p666c蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜。
%81.81 （二）別明
%81.82 1、布施
%81.83 （1）正明
%81.84 A、修四種正行
是菩薩摩訶薩若行檀波羅蜜時，自行布施，亦教人行#87.13布施，讚歎行#87.14布施功德，歡喜讚歎行布施者；
%81.85 B、得大財富
以是布施因緣故，得大財富。
%81.86 C、離慳貪心，隨眾生意布施，得尊貴果
是菩薩遠離慳心，布施眾生飲食、衣服、香、華、瓔珞、房舍、臥具、燈燭，種種資生所須，盡給與之。
菩薩摩訶薩行是布施及持戒，生天、人中，得大尊貴。
%81.87 D、漸成五眾德
以是持戒、布施故，得禪定眾；以是布施、持戒、禪定故，得智慧眾、解脫眾、~2507解脫知見眾。#87.15
%81.88 E、入菩薩位
是菩薩因是布施、持戒、禪定眾、智慧眾、解脫眾、解脫知見眾故，過聲聞、辟支佛地，入菩薩位。#87.16
%81.89 F、嚴土熟生，成佛，轉法輪，以三乘法度眾生
入菩薩位已，得淨佛國土、成就眾生，得一切種智；得一切種智已，轉法輪；轉法輪已，以三乘法度脫眾生生死。
%81.90 （2）結：性空故，三次第不可得
如是，須菩提！菩薩以是布施，次第行、次第學、次第道──是皆不可得。何以故？自性無所有故。#87.17
%81.91 2、持戒
%81.92 （1）正明
%81.93 A、修四種正行
復次，須菩提！菩薩摩訶薩從初發意，自行持戒，教人持戒，讚歎持戒功德，歡喜讚歎行持戒者。
%81.94 B、得尊貴果
持戒因緣故，生天、人中，得大尊貴。
%81.95 C、攝五眾德，應機施教
見貧窮者施以財物，不持戒者教令持戒，亂意者教令禪定，愚癡者教令智慧，無解脫者教令解脫，無解脫知見者教令解脫知見。
%81.96 D、入菩薩位
以是持戒、禪定、智慧、解脫、解脫知見故，過聲聞、辟支佛地，入菩薩位；
%81.97 E、嚴土熟生，成佛，轉法輪，以三乘法度眾生
入菩薩位已，得淨佛國土；淨佛國土已，成就眾生；成就眾生已，得一切種智；得一切種智已，轉法輪；轉法輪已，以三乘法度脫#87.18眾生。
%81.98 （2）結：性空故，三次第不可得
如是，須菩提！菩薩以是持戒，次第行、次第學、次第道──是事皆不可得。何以故？一切法自性無所有故。
~2508
%81.99 3、忍辱
%81.100 （1）正明
%81.101 A、修四種正行
復次，須菩提！菩薩摩訶薩從初以來，自@t25p667a行羼提波羅蜜，教人行羼提，讚歎羼提功德，歡喜讚歎行羼提者。
%81.102 B、攝五眾德，應機施教
行羼提波羅蜜時，布施眾生各#87.19令滿足，教令持戒，教令禪定乃至解脫知見。
%81.103 C、入菩薩位
以是布施、持戒、禪定、智慧因緣故，過阿羅漢、辟支佛地，入菩薩位中；#87.20
%81.104 D、嚴土熟生，成佛，轉法輪，以三乘法度眾生
入菩薩位中已，得淨佛世界；淨佛世界已，成就眾生；成就眾生已，得一切種智；得一切種智已，轉法輪；轉法輪已，以三乘法度脫眾生。
%81.105 （2）結：性空故，三次第不可得
如是，須菩提！菩薩以羼提波羅蜜，次第行、次第學、次第道──是事皆不可得。何以故？一切法自性無所有故。
%81.106 4、精進
%81.107 （1）修四種正行
復次，須菩提！菩薩摩訶薩從初以來，自行毘梨耶波羅蜜#87.21，教人行毘梨耶，讚歎行毘梨耶功德，歡喜讚歎行毘梨耶者；
%81.108 （2）例結
乃至是事不可得，自性無所有故。
%81.109 5、禪定
%81.110 （1）正明
%81.111 A、修四種正行
復次，須菩提！菩薩摩訶薩從初以來，自入禪、入無量心、入無色定，亦教人入禪、入無量心、入無色定，讚歎入禪、入無量心、入無色定功德，歡喜讚歎行禪、無量心、無色定者。
%81.112 B、於諸定心中行施、教戒定慧
是菩薩住諸禪、定、無量心，布施眾生，各令滿足；教令持戒，教令禪定、智慧。
%81.113 C、入菩薩位
以是布施、禪定、智慧、解脫、解脫知見因緣故，過阿羅漢、辟支佛地，入菩薩位；
~2509
%81.114 D、嚴土熟生，成佛，轉法輪，以三乘法度眾生
入菩薩位已，淨佛世界；淨佛世界已，成就眾生；成就眾生已，得一切種智；得一切種智已，轉法輪；轉法輪已，以三乘法度脫一切眾生。
%81.115 （2）例結
乃至是事不可得，自性無所有故。
%81.116 6、般若
%81.117 （1）正明
%81.118 A、攝五眾德，應機施教
復次，須菩提！菩薩摩訶薩從初以來，行般若波羅蜜，布施眾生各令滿足，教令持戒、禪定、智慧、解脫、解脫知見。
%81.119 B、修四種正行
是菩薩行般若波羅蜜時，自行六波羅蜜，亦教他人令行六波羅蜜，讚歎六波@t25p667b羅蜜功德，歡喜讚歎行六波羅蜜者。
%81.120 C、入菩薩位
是菩薩以是檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜因緣及方便力，過聲聞、辟支佛地，入菩薩位；#87.22
%81.121 （2）例結
乃至是事不可得，自性無所有故。
%81.122 （三）總結
須菩提！是名初發意菩薩摩訶薩次第行、次第學、次第道。
%81.123 三、約六念明
%81.124 （一）總明
復次，須菩提！菩薩摩訶薩次第行、次第學、次第道，菩薩摩訶薩從初以來，以一切種智相應心，信解#87.23諸法無所有性，修六念，所謂念佛、#87.24念法、念僧、念戒、念~2510捨、念天。#87.25
%81.125 （二）別明無念為念
%81.126 1、念佛
%81.127 （1）正明
須菩提！云何菩薩摩訶薩修念佛？
%81.128 A、不念五陰
菩薩摩訶薩念佛，不以色念，不以受、想、行、識念。何以故？是色自性無，受、想、行、識自性無。
若法自性無，是為無所有。何以故？無憶故，是為念佛。#87.26
%81.129 B、不念相好
復次，須菩提！菩薩摩訶薩念佛，不以三十二相念，亦不念金色身、不念丈光、不念八十隨形好。何以故？是佛身自性無故。
若法無性，是為無所有。何以故？無憶故，是為念佛。
%81.130 C、不念五眾德
復次，須菩提！不應以戒眾念佛，不應以定眾、智慧眾、解脫眾、解脫知見眾念佛。何以故？是眾無有自性。
若法無自性，是為非法。無所有念，是為念佛。
%81.131 D、不念佛功德
復次，須菩提！不應以十力念佛，不應以四無所畏、四無礙智、十八不共法念佛，不應以大慈大悲念佛。何以故？是諸法自性無。
若法自性無，是為非法。無所念，是為念佛。
%81.132 E、不念十二因緣法
復次，須菩提！不應以十二因緣法念佛。何以故？是因緣法自性無。
若法自性無，是為非法。無所念，是為念佛。
%81.133 （2）結勸
如是，須菩提！菩薩摩訶薩行般若波羅蜜時，應念佛──是為菩薩初發意次第行、次第@t25p667c學、次第道。
是菩薩摩訶薩次第行、次第學、次第道中住，能具足四念處、四正勤、四如意足、~2511五根、五力、七覺分、八聖道分，修行空三昧、無相、無作三昧乃至一切種智，諸法性無所有故。
是菩薩知諸法性無所有，是中無有性、無無性。#87.27
%81.134 2、念法
須菩提！云何菩薩摩訶薩應修念法？
%81.135 （1）諸法性空故，不念一切法
須菩提！菩薩摩訶薩行般若波羅蜜時，不念善法、不念不善法，不念記法、無記法，不念世間法、不念出世間法，不念淨法、不念不淨法，不念聖法、不念凡夫法，不念有漏法、不念無漏法，不念欲界繫法、色界繫法、無色界繫法，不念有為法、無為法。
何以故？是諸法自性無。若法自性無，是為非法。無所念，是為念法。#87.28
%81.136 （2）結勸
念法中學無所有性故，乃至當得一切種智。
是菩薩得阿耨多羅三藐三菩提時，得諸法無所有性；是無所有性中，非有相、非無相。
如是，須菩提！菩薩摩訶薩應修念法，於是法中，乃至無少許念，何況念法！#87.29
%81.137 3、念僧
須菩提！菩薩摩訶薩云何應修念僧？
須菩提！菩薩摩訶薩念僧，無為法故分別有佛弟子眾，是中乃至無有少許念，何況念僧！#87.30
~2512如是，菩薩摩訶薩應修#87.31念僧。
%81.138 4、念戒
須菩提！菩薩摩訶薩云何應修念戒？
須菩提！菩薩摩訶薩從初發意已來，應念聖戒──無缺戒、無隙戒、無瑕戒、無濁戒、無著戒、自在戒、智者所讚戒、#87.32具足戒、隨定戒。
應念是戒無所有性，乃至無少許念，何況念戒！#87.33
%81.139 5、念捨
須菩提！菩薩摩訶薩從初發意已來應念捨──若自念捨、若念他捨，若捨財、若捨法、若捨煩惱；觀是捨不可得故#87.34，乃至無少許念，何況念捨！#87.35
如@t25p668a是，須菩提！菩薩摩訶薩應念捨。
%81.140 6、念天
須菩提！云何菩薩摩訶薩應念天？
須菩提！菩薩作是念：『四天王諸天所有信、戒、施、聞、慧，此間命終，生彼天處；我亦有是信、戒、施、聞、慧。乃至他化自在天所有信、戒、施、聞、慧，此間命終，生彼天處；我亦有是信、戒、施、聞、慧。』
如是，須菩提！菩薩摩訶薩應念是天無所有性中尚無少許念，何況念天！#87.36
%81.141 （三）總結
須菩提！菩薩摩訶薩行#87.37是六念，是名次第行、次第學、次第道。」
~2513
%81.142 參、為來世著空者，示性空不礙次第行
%81.143 （壹）須菩提問
爾時，須菩提白佛言：「世尊！若一切法無所有性，所謂念色乃至識、眼乃至意、色乃至法，是無所#87.38有性；眼界乃至意識界，是無所有性；檀波羅蜜乃至般若波羅蜜、內空乃至無法有法空、四念處乃至八聖道分、佛十力乃至一切種智，是無所有性。世尊！若一切法無所有性者，是則無道、無智、無果。」#87.39
%81.144 （貳）佛反質令答
佛告須菩提：「汝見是色性實有不？乃至一切種智實有不？」
須菩提言：「不見也！世尊！」
佛告須菩提：「汝若不見諸法實有，云何作是問？」
%81.145 （參）須菩提述問意
%81.146 一、自無所疑，愍來世著空者故問
須菩提言：「世尊！我於是法不敢有疑，但為當來世諸比丘求聲聞、辟支佛道、菩薩道者。是人當如是言：『若一切法無所有性，誰垢誰淨？誰縛誰解？』是不知不解故而破於戒、破正見、破威儀、破淨命；#87.40是人破此事故，當墮三惡道。世尊！我畏當來世有如是事，以是故問佛。
%81.147 二、重述已得道，淨信無有疑
世尊！我於是法中信，不疑不悔。」
^87.2
%82.0 壹、明無所有中起行
%82.1 （壹）明發菩提心
%82.2 一、須菩提問
須菩提白佛言：「世尊！若一切法性無所有，菩薩見何等利益故，為眾生求#87.76阿耨多羅三藐三菩提？」
%82.3 二、佛答
%82.4 （一）法性無所有，為眾生故發菩提心
佛告須菩提：「以#87.77一切法性無所有故，菩薩為眾生求阿耨多羅三藐三菩提。
%82.5 （二）著有所得者無道、無果、無菩提
何以故？須菩提！諸有得、有著者，難可解@t25p670c脫。
須菩提！諸得相者，無有道、無有果、無#87.78阿耨多羅三藐三菩提。」#87.79
%82.6 （貳）明修行得果
%82.7 一、略標無得道果
%82.8 （一）須菩提問
須菩提白佛言：「世尊！無得相者，有道、有果、有阿耨多羅三藐三菩提不？」
%82.9 （二）佛答
%82.10 1、無所得即是道、果、菩提
「須菩提！無所得即是道、即是果、即是阿耨多羅三藐三菩提，法性不壞故。
%82.11 2、著無所得則壞法性
若無所得法欲得道、欲得果、欲得阿耨多羅三藐三菩提，為欲壞法性。」#87.80
~2523
%82.12 二、別論修行得果
%82.13 （一）論「以無所得故有行道乃至遺法化世等」
%82.14 1、須菩提問
須菩提白佛言：「世尊！若無所得法即是道、即是果、即是阿耨多羅三藐三菩提，云何有菩薩初地乃至十地？云何有無生忍法？云何有報得神通？云何有報得布施、持戒、忍辱、精進、禪定、智慧，住是果報法中能成就眾生、能淨佛國土及供養諸佛衣服、飲食、香、華、瓔珞、房舍、臥具、燈燭、種種資生所須之具，乃至得阿耨多羅三藐三菩提，不斷是福德？乃至般涅槃後舍利及弟子得供養，爾乃滅盡？」
%82.15 2、佛答
佛告須菩提：「以諸法無所得相故，得菩薩初地乃至十地，有報得五神通、布施、持戒、忍辱、精進、禪定、智慧、成就眾生、淨佛國土，亦以善根因緣故，能利益眾生，乃至般涅槃後舍利及弟子得供養。」#87.81
%82.16 （二）論「無所得中布施乃至諸神通皆無差別」
%82.17 1、明正義
%82.18 （1）須菩提問
須菩提白佛言：「世尊！若諸法無所得相，布施、持戒、忍辱、精進、禪定、智慧、諸神通有何差別？」
%82.19 （2）佛答
%82.20 A、以無所得故不異
佛告須菩提：「無所得法，布施、持戒、忍辱、精進、禪定、智慧、神通無有差別。
%82.21 B、為令有所得者離執著故分別說
以眾生著布施乃至神通故分別說。#87.82
%82.22 2、論行法
%82.23 （1）須菩提問
「世尊！云何無所得法布施乃至神通無#87.83差別？」#87.84
~2524
%82.24 （2）佛答：行時不見三事
「須菩提！菩薩摩訶薩行般若波羅蜜時，不得布施，施者、受者皆不可得而行布施，#87.85不得戒而#87.86持戒，不得忍而行忍，不得精進而行精進，不得禪而行禪，不得智慧而行智慧；不得神通而@t25p671a行神通；不得四念處而行四念處，乃至不得八聖道分而行八聖道分；不得空三昧、無相#87.87、無作三昧而行空、無相、無作三昧；不得眾生而成就眾生，不得#87.88佛國土而淨佛國土；不得諸佛法而得阿耨多羅三藐三菩提。
%82.25 3、勸修
須菩提！菩薩摩訶薩應如是行無所得般若波羅蜜！
%82.26 三、顯益
菩薩摩訶薩行是無所得般若波羅蜜時，魔、若魔天不能破壞。」
%82.27 貳、明一念中具萬行#87.89
%82.28 （壹）論「能具眾善之法」
%82.29 一、須菩提問
須菩提白佛言：「世尊！云何菩薩摩訶薩行般若波羅蜜時，一念中具足行六波羅蜜、四禪、四無量心、四無色定、四念處、四正勤、四如意足、五根、五力、七覺分、八聖道分、三解脫門、佛十力、四無所畏、四無礙智、十八不共法、大慈大悲、三十二相、八十隨形好？」
%82.30 二、佛答：不離般若行
佛告須菩提：「菩薩摩訶薩所有布施，不遠離般若波羅蜜；所修持戒、忍辱、精進、禪定，不遠離般若波羅蜜；四禪、四無量心、四無色定、修四念處乃至八十隨形好，不遠離般若波羅蜜。」#87.90
~2525
%82.31 （貳）論「不離般若之法」
%82.32 一、須菩提問
須菩提白佛言：「世尊！云何菩薩摩訶薩不遠離般若波羅蜜故，一念中具足行六波羅蜜乃至八十隨形好？」
%82.33 二、佛答：不以二相行
佛言：「菩薩行般若波羅蜜時，所有布施不遠離般若波羅蜜不二相，持戒時亦不二相，修忍辱、勤精進、入禪定亦不二相，乃至八十隨形好亦不二相。」#87.91
%82.34 （參）論「云何不二相」
%82.35 一、明「能成不二之法」
%82.36 （一）須菩提問
須菩提白佛言：「世尊！云何菩薩摩訶薩布施時不二相，乃至修八十隨形好不二相？」
%82.37 （二）佛答
「須菩提！菩薩摩訶薩行般若波羅蜜時，欲具足檀波羅蜜，檀波羅蜜中攝諸波羅蜜及四念處乃至八十隨形好。」#87.92
%82.38 二、明「住無漏心，以一攝眾行」
%82.39 （一）須菩提問
「世尊！云何菩薩#87.93布施時攝諸無漏法？」#87.94
%82.40 （二）佛答
佛告須菩提：「若菩薩摩訶薩行般若波羅蜜時#87.95，住@t25p671b無漏心布施，於無漏心中不見相──所謂誰施？誰受？所施何物？
以是無相心、無漏心，斷愛、斷慳貪心而行布施，是時不見布施，乃至不見阿耨多羅三藐三菩提法。
是菩薩以無相心、無漏心持戒，不見是戒，乃至不見一切佛法。
~2526以無相心、無漏心忍辱，不見是忍，乃至不見一切佛法。
以無相心、無漏心精進，不見是精進，乃至不見一切佛法。
以無相心、無漏心入禪定，不見是禪定，乃至不見一切佛法。
以無相心、無漏心修#87.96智慧，不見是智慧，乃至不見一切佛法。
以無相心、無漏心修四念處，不見是四念處。
乃至八十隨形好。」
%82.41 參、明行無相、無作、無起具萬行#87.97
%82.42 （壹）須菩提問
「世尊！若諸法無相、無作，云何具足檀波羅蜜、尸#87.98波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜？云何具足四念處、四正勤、四如意足、五根、五力、七覺分、八聖道分？云何具足空三昧、無相、無作三昧、佛十力、四無所畏、四無礙智、十八不共法、大慈大悲？云何具足三十二相、八十隨形好？」#87.99
%82.43 （貳）佛約六度答
%82.44 一、約施度
%82.45 （一）標
佛告須菩提：「菩薩摩訶薩行般若波羅蜜，以無相心、無漏心布施，須食與食，乃至種種所須，盡給與之；若內、若外──若支解其身、若國城、妻子，布施眾生。#87.100
%82.46 （二）釋
%82.47 1、自體具足：觀十二空故離相
若有人來語菩薩言：『何用是布施為？是無所益！』
行般若波羅蜜菩薩作是念：『是人雖來訶我布施，我終不悔！我當勤行布施，不應不與。』施已，與一切眾生共之，迴向阿耨多羅三藐三菩提，亦不見是相──誰施？誰受？所施何物？迴向者誰？何等是迴向法？何等是迴向處──所謂阿耨多羅三藐三菩提？是相皆不可見。何以故？一切法皆#87.101@t25p671c以內空故空，外空故空，~2527內外空故空，空空、有為空、無為空、畢竟空、無始空、散空、性空、一切法空、自相空故空。
如是觀，作是念：『迴向者誰？迴向何處？用何法迴向？』是名正迴向。
%82.48 2、攝諸功德
爾時，菩薩能成就眾生、淨佛國土，能具足檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜，乃至三十七助道法，空、無相、無作三昧，乃至十八不共法。
是菩薩能#87.102如是具足檀波羅蜜而不受世間果報。
譬如他化自在諸天，隨意所須，即皆得之；菩薩亦如是，心生所願，隨意即得。
%82.49 3、供養諸佛，兼濟眾生
是菩薩摩訶薩以#87.103是布施果報故，能供養諸佛，亦能滿足一切眾生、天及人、阿修羅。#87.104是菩薩以檀波羅蜜攝取眾生，用方便力，以三乘法度脫眾生。
%82.50 （三）結
如是，須菩提！菩薩摩訶薩於無相、無得、無作諸法中具足檀波羅蜜。
%82.51 二、約戒度
%82.52 （一）佛自設問
須菩提！菩薩摩訶薩云何於無相、無得、無作法中具足尸羅波羅蜜？
%82.53 （二）標：持種種戒
須菩提！是菩薩摩訶薩行尸羅#87.105波羅蜜時，持種種戒，所謂聖無漏入八聖道分#87.106戒、自然戒#87.107、報得戒、受得戒、心生戒，如是等不缺、不破、不雜、不濁、不著，自~2528在戒，智所讚戒。#87.108
%82.54 （三）釋
%82.55 1、自體具足
用是戒，無所取──若色，若受、想、行、識；若三十二相、八十隨形好；若剎利大姓，若婆羅門大姓、居士大家；若#87.109四天王天、三十三天、夜摩天、兜率陀天、化樂天、他化自在天、梵眾天、光音天、遍淨天、廣果天、無#87.110想天、無煩#87.111天、無熱天、妙見天、喜見天、阿迦膩#87.112吒天、空處天、識處天、無所有處天、非有想非無想處天；若須陀洹果、若斯陀含果、若阿那含果、若阿羅漢果、若辟支佛道；若轉輪聖王、若天@t25p672a王。但為一切眾生共之，迴向阿耨多羅三藐三菩提，以無相、無得、無二迴向，為世俗法故，非第一實義。#87.113
%82.56 2、攝諸功德
是菩薩具足尸羅波羅蜜，以方便力起四禪，不味著故，得五神通。
%82.57 3、親近諸佛，兼濟眾生
因四禪得天眼；是菩薩住二種天眼：修得、報得。
~2529得天眼已，見東方現在諸佛，乃至得阿耨多羅三藐三菩提，如所見事不失；南西北方、四維、上下現在諸佛，乃至得阿耨多羅三藐三菩提，如所見不失。#87.114
是菩薩用天耳淨，過於人耳，聞十方諸佛說法；如所聞不失，能自饒益，亦益#87.115他人。
是菩薩以知他心智，知十方諸佛心及知一切眾生心，亦能饒益一切眾生。
是菩薩用宿命智，知過去諸業因#87.116緣；是諸#87.117業因緣不失故，是眾生在在處處所生悉知。
是菩薩用是漏盡智，令眾生得須陀洹果乃至阿羅漢果、辟支佛道，在在處處能令眾生入善法中。#87.118
%82.58 （四）結
如是，須菩提！菩薩摩訶薩於諸法無相、無得、無作，具足尸羅波羅蜜。」
%82.59 三、約忍度
%82.60 （一）須菩提問
「世尊！云何諸法無相、無作、無得，菩薩摩訶薩能具足羼提波羅蜜？」
%82.61 （二）佛標示二種忍
「須菩提！菩薩摩訶薩從初發意以來乃至坐道場，於其中間，若一切眾生來，以瓦石、刀杖加是菩薩，菩薩是時不起瞋心，乃至不生一念。
爾時，菩薩應修二種忍：一者、一切眾生惡口罵詈#87.119、若加刀杖瓦石，瞋心不起；二者、一切法無生無生法忍。#87.120
%82.62 （三）佛釋義
%82.63 1、自體具足
菩薩，若人來惡口罵詈或以瓦石刀杖加之，爾時，菩薩應如是思惟：『罵我者誰？~2530譏訶者誰？打擲者誰？誰有受者？』即#87.121時菩薩應思惟諸法實性，所謂畢竟空，無法、無眾生；諸法尚不可得，何況有眾@t25p672b生！如是觀諸法相時，不見罵者、不見割截者。是菩薩如是觀諸法相時，即得無生法忍。
云何名無生法忍？知諸法相常不生，諸煩惱從本已來亦常不生。#87.122
%82.64 2、攝諸功德
是菩薩摩訶薩住是二忍，能具足四禪、四無量心、四無色定，四念處乃至八聖道分，三解脫門，佛十力、四無所畏、四無礙智、十八不共法、大慈大悲。
是菩薩住是聖無漏出世間法，不共一切聲聞、辟支佛，具足聖神通。
%82.65 3、親近諸佛，兼濟眾生
住聖神通已，以天眼見東方諸佛，是人得念佛三昧，乃至阿耨多羅三藐三菩提，終不斷絕；南西北方、四維、上下亦如是。#87.123
是菩薩用天耳聞十方諸佛所說法，如所聞為眾生說。
是菩薩亦知十方諸佛心；及知一切眾生念，知已，隨其心而為#87.124說法。
是菩薩以宿命智知一切眾生宿世善根，為眾生說法，令其歡喜。
是菩薩以漏盡神通，教化眾生，令得三乘。
%82.66 4、行化利生，得果轉法輪
是菩薩摩訶薩行般若波羅蜜，以方便力成就眾生，具足一切種智，得阿耨多羅三藐三菩提，轉法輪。
%82.67 （四）結
如是，須菩提！菩薩摩訶薩無相、無得、無作法中，具足羼提波羅蜜。」
%82.68 四、約精進度
%82.69 （一）須菩提問
須菩提言：「世尊！菩薩摩訶薩云何於諸法無相、無作、無得，能具足毘梨耶波羅蜜？」
~2531
%82.70 （二）佛標示身精進、心精進
佛告須菩提：「菩薩摩訶薩行般若波羅蜜時，成就身精進、心精進，入初禪乃至入第四禪，受種種神通力，能分一身為多身，乃至手捫摸#87.125日月。
%82.71 （三）佛釋義
%82.72 1、自體具足
%82.73 （1）以身精進辨
成就身精進故，飛到東方過無量百千萬諸佛世界，供養諸佛飲食、衣服、醫藥、臥具、華、香#87.126、瓔珞種種所須，乃至阿耨多羅三藐三菩提，福德果報終不可#87.127盡。
是菩薩得阿耨多羅三藐三@t25p672c菩提時，一切世間天及人勤設供養衣服、飲食，乃至入無餘涅槃後，舍利及弟子得供養。
亦以是神通力故，至諸佛所，聽受法教，乃至阿耨多羅三藐三菩提，終不違失。
是菩薩修一切種智時，淨佛世界#87.128、成就眾生。
如是，須菩提！菩薩摩訶薩行般若波羅蜜，成就身精進，能具足毘梨耶波羅蜜。
%82.74 （2）以心精進辨
須菩提！云何菩薩成就心精進，能具足毘梨耶波羅蜜？
須菩提！菩薩摩訶薩心精進，以是心精進聖無漏，入八聖道分精進，不令身、口不善業得入。#87.129
亦不取諸法相若常、若無常，若苦、若樂，若我、若無我，若有為、若無為，若欲界、若色界、若無色界，若有漏性、若無漏性，若初禪乃至第四禪，若慈、悲、喜、捨，若無邊虛空處乃至非有想非無想處，若四念處、若#87.130四正勤、四如意足、五根、五力、七覺分、八聖道分，若空、無相、無作，若佛十力乃至十八不共法。
不取相若常、若無常，若苦、若樂，若我、若無我，若須陀洹果、斯陀含果、阿那含果、若阿羅漢果、若辟支佛道，若菩薩道、若阿耨多羅三藐三菩提，若是須陀洹、斯陀含、阿那含、阿羅漢，若是辟支佛，是菩薩，是佛。
不取相是眾生斷三結故得須陀洹，是眾生三毒薄故得斯陀含，是眾生斷下分結故得阿那含，是眾生斷上分結故得阿羅漢，是眾生以辟支佛道故作辟支佛，是眾生行道種智故名菩薩──亦不取是諸法#87.131相。
~2532何以故？不可以性取相，是性無故。#87.132
是菩薩以是心精進故，廣利益眾生，亦不得是#87.133眾生，是為菩薩具足毘梨耶波羅蜜。具足諸佛法、淨佛國土、成就眾生，不@t25p673a可得故。#87.134
%82.75 2、攝諸功德
是菩薩身精進、心精進成就故，攝取一切諸善法；是法亦不著#87.135故。#87.136
%82.76 3、兼濟眾生
從一佛國至一佛國，為利益眾生，所作神通，隨意無礙，若雨諸華、若諸名香、若作伎樂、若動大地、若放光明、若示七寶莊嚴國土、若現種種身、若放大智光明，~2533令知聖道，令遠離殺生乃至邪見；或以布施利益眾生，或以持戒，或#87.137支解身體、或以妻子、或以國土#87.138、或以己身給施，隨所方便，利益眾生。
%82.77 （四）結
如是，須菩提！菩薩摩訶薩行般若波羅蜜，無相、無作、無得諸法中，用身心精進，能具足毘梨耶波羅蜜。」
%82.78 五、約禪定
%82.79 （一）須菩提問
「世尊！云何菩薩摩訶薩行般若波羅蜜，住無相、無作、無得法中，能具足禪波羅蜜？」
%82.80 （二）佛標示
「須菩提！菩薩摩訶薩，除佛諸#87.139禪定，餘一切諸禪、三昧，皆能具足。
是菩薩離諸欲、諸惡不善法，離生喜樂，有覺有觀，入初禪；乃至入第四禪。以是慈、悲、喜、捨心，遍滿一方，乃至十方一切世間遍滿。是菩薩過一切色相，滅有對相，不念別異相故，入無邊虛#87.140空處；乃至入非有想非無想處。
是菩薩於禪波羅蜜中住，逆順入八背捨、九次第定，入空三昧，無相#87.141、無作三昧#87.142，或時入如電光三昧，或時入聖正三昧，#87.143或時入如金剛三昧。
%82.81 （三）佛釋義
%82.82 1、攝諸功德
是菩薩住禪波羅蜜中，修三十七助道法，用道種智入一切禪定，過乾慧地、性地、八人地、見地、薄地、離欲地、已辦地、辟支佛地，入菩薩位；入菩薩位已，具足佛地。是諸地中行，乃至阿耨多羅三藐三菩提，不中道取道果。
%82.83 2、親近諸佛，兼濟眾生
是菩薩住是禪波羅蜜中，從一佛國至一佛國，供養諸佛，從諸佛所植諸善根，淨佛國土。
從@t25p673b一佛國，至一佛國，利益眾生。以布施攝取眾生，或以持戒、或以三昧、~2534或以智慧、或以解脫、或以解脫知見攝取眾生；教眾生令得須陀洹果、斯陀含果、阿那含果、阿羅漢果，辟支佛道。諸有善法能令眾生得道，皆教令得。
%82.84 3、自體具足
是菩薩住此禪波羅蜜中，能生一切陀羅尼門，得四無礙智、報得神#87.144通。
是菩薩終不入母人胞胎，終不受五欲，無#87.145生不生；雖生，不為生法所污。何以故？是菩薩見一切作法如幻，而利益眾生，亦不得眾生及一切法，教眾生令得無所得處──是世俗法故，非第一實義。#87.146
住是禪波羅蜜，一切行禪、定、解脫、三昧，乃至阿耨多羅三藐三菩提，終不離禪波羅蜜。
%82.85 4、斷煩惱習，自利利他，為眾生作福田
是菩薩行如是道種智時，得一切種智，斷一切煩惱習；斷已，自益其身，亦益他人；自益益他已，為一切世間天及人、阿修羅作福田。
%82.86 （四）結
如是，須菩提！菩薩摩訶薩行般若波羅蜜時，能#87.147具足無相禪波羅蜜。」
%82.87 六、約般若
%82.88 （一）須菩提問
「世尊！云何菩薩摩訶薩行般若波羅蜜時，住無相、無作、無得法中，修具足般若波羅蜜？」
%82.89 （二）佛標示
「須菩提！菩薩摩訶薩行般若波羅蜜時，於諸法不見定實相。
%82.90 （三）佛釋義
%82.91 1、自體具足
是菩薩見色不定、非實相，乃至見識不定、非實相。不見色生，乃至不見識生；若不見色生乃至不見識生，一切法若有漏、若無漏，不見來處，不見去處，亦不見集處。如是觀時，不得色性乃至識性，亦不得有漏、無漏法性。#87.148
~2535是菩薩行般若波羅蜜時，信解一切諸法無所有相；如是信解已，行內空乃至無法有法空，於諸法無所著若色，若#87.149受想行識乃至阿耨多羅三藐三菩@t25p673c提。#87.150
%82.92 2、攝諸功德
是菩薩行無所有般若波羅蜜，能具足菩薩道──所謂六波羅蜜，乃至三十七助道法，佛十力、四無所畏、四無礙智、十八不共法、三十二相、八十隨形好。
%82.93 3、兼濟眾生
是菩薩住空淨佛道中，所謂六波羅蜜、三十七助道法、報得神通，以是法饒益眾生──宜以布施攝，教令布施；宜以戒攝，教令持戒；宜以禪定、智慧、解脫、解脫知見攝#87.151，教令#87.152修禪定、智慧、解脫、解脫知見；宜以諸道法教者，教令得須陀洹果、得斯陀含果、阿那含果、阿羅漢果、辟支佛道；宜以佛道化者，教#87.153令得菩薩道，具足佛道──如是等，隨其所應道地而教化之，各令得所。#87.154
是菩薩現種種神通力時，過無量恒河沙國土，度脫眾生，隨其所須，皆化給之，各令滿足。從一國土至一國土，見淨妙國土，以自莊嚴己佛國土。譬如他化自在天中，資生所須，隨意自至；亦如諸淨佛國，離於求欲。#87.155
%82.94 4、行化得果，一切法不受
是人以是報得檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般~2536若波羅蜜，報得五神通，行菩薩道#87.156種智，成就一切功德，當得阿耨多羅三藐三菩提。
是菩薩爾時不受色法#87.157乃至識，不受一切法若善若不善、若世間若出世間、若有漏若無漏、若有為若無為，如是一切法皆不受。
是菩薩得阿耨多羅三藐三菩提時，國土一切所有資生之物皆無有主。何以故？是#87.158菩薩行一切法不受，以不可得故。#87.159
%82.95 （四）結
如是，須菩提！菩薩摩訶薩無相法中，能具足般若波羅蜜。」#87.160
^88.1
%83.0 壹、須菩提以四事問
須菩提白佛言：「世尊！（1）云何無相、不可分別、自相空諸法中具足修六波羅蜜，所謂檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨#88.1耶波羅蜜、禪波羅蜜、般若波羅蜜？世尊！（2）云何無異法中而分別說異相？（3）云何般若波羅蜜攝檀、尸、羼、精進、禪？（4）云何行異相法，以一相道得果？」#88.2
%83.1 貳、佛答#88.3
%83.2 （壹）總說：住五陰如夢等行六度
佛告須菩提：「菩薩摩訶薩住五陰如夢、如響、如影、如焰、如幻、如化，#88.4住是中，行布施、持戒、修@t25p675b忍辱、勤精進、入禪定、修智慧。#88.5
%83.3 （貳）別釋
%83.4 一、約施度說
%83.5 （一）知五陰如夢等，能具足無相施度
知是五陰實如夢、如響、如影、如焰、如幻、如化──五陰如夢無相，乃至如化無相。何以故？夢無自性，響、影、焰、幻、化皆無自性。若法無自性，是法無相；~2542若法無相，是法一相，所謂無相。
以是因緣故，須菩提！當知菩薩布施無相、施者無相#88.6、受者無相。#88.7
%83.6 （二）攝諸功德
能如是知布施，是能具足檀波羅蜜乃至能具足般若波羅蜜，能具足四念處乃至八聖道分，能具足內空乃至無法有法空，能具足空三昧、無相#88.8、無作三昧，能具足八背捨、九次第定、五神通、五百陀羅尼門，能具足佛十力、四無所畏、四無礙智、十八不共法。
是菩薩住是報得無漏法中，飛到東方無量國土，供養諸佛衣服、飲食，乃至隨其所須而供養之。#88.9
%83.7 （三）利益眾生
亦利益眾生──應以布施攝者，而布施攝之；應以持戒攝者，教令持戒；應以忍辱、精進、禪定、智慧攝者，教令忍辱、精進、禪定、智慧而攝取之；乃至應以種種善法攝者，以種種善法而攝取之。
是菩薩成就是一切善法，受世間身，不為世間生死所污；為眾生故，於天、人中受尊貴富樂，以是尊貴富樂攝取眾生。#88.10
%83.8 （四）不住二乘，當得佛果
是菩薩知一切法無相故，知須陀洹果亦不於中住，知斯陀含果、阿那含果、阿羅漢果亦不於中住，知辟支佛道亦不於中住。
何以故？是菩薩用一切種智知一切法已，應當得一切種智，不與聲聞、辟支佛共。
%83.9 （五）結
如是，須菩提！菩薩摩訶薩知#88.11一切法無相已，知六波羅蜜無相，乃至知一切佛法無相。#88.12
%83.10 二、約戒度說
%83.11 （一）住五陰如夢等，能具足無相戒度
~2543
%83.12 1、善持一切戒
復次，須菩提！菩薩摩訶薩住五陰如夢、如響、如影、如焰、如幻、如化，能具@t25p675c足無相尸羅波羅蜜。是戒不缺、不破、不雜、不著，聖人所讚無漏戒，入八聖道分；住是戒中，持一切戒，所謂名字戒、自然戒#88.13、律儀戒、作戒、無作戒、威儀戒、非威儀戒。#88.14
%83.13 2、不作願生人中豪貴、諸天，不取二乘果
是菩薩成就諸戒，不作是願：『我以此戒因緣故，生剎利大姓、婆羅門大姓、居士大家，若小王家、若轉輪聖王家，若四天王天處生，若三十三天、夜摩天、兜率陀天、化樂天、他化自在天。』
不作是願：『我持戒因緣故，當得須陀洹果、斯陀含果、阿那含果、阿羅漢果、辟支佛道。』
何以故？一切法無相，所謂一相。無相法不能得無相法，有相法不能得有相法；無相法不能得有相法，有相法不能得無相法。#88.15
%83.14 （二）攝諸功德
如是，須菩提！菩薩摩訶薩行般若波羅蜜時，能具足無相尸羅波羅蜜而入菩薩位；入菩薩位已，得無生法忍；行道種智，得報得五神通；住五百陀羅尼門，得四無礙智。
%83.15 （三）親近諸佛，兼濟眾生
從一佛國至一佛國，供養諸佛，成就眾生、淨佛國土。雖入五道中，生死業報不能染#88.16污。
須菩提！譬如化轉輪聖王，雖坐臥行住，不見來處，不見去處，不見住處、坐處、臥處，而能利益眾生，亦不得眾生；菩薩亦如是。#88.17
須菩提！譬如須扇多佛，得阿耨多羅三藐三菩提，為三乘轉法輪，無有得菩薩記者；~2544化作化#88.18佛已，捨身#88.19壽命，入無餘涅槃。#88.20
%83.16 （四）結：具足戒度，攝取一切善法
須菩提！菩薩亦如是，行般若波羅蜜時，能具足尸羅波羅蜜；具足尸羅波羅蜜已，攝取#88.21一切善法。
%83.17 三、約忍度說
%83.18 （一）住五陰如夢等，能具足無相忍度
復次，須菩提！菩薩摩訶薩行般若波羅蜜時，住五陰如夢、如響、如影、如焰、如幻、如化，具足無相羼提波羅蜜。」
%83.19 （二）住生忍、法忍，能具足忍度，得無生法忍
%83.20 1、依二忍具足忍度
「世尊！云何菩薩摩訶薩具足無相羼@t25p676a提波羅蜜？」
「須菩提！菩薩摩訶薩住二忍中，能具足羼提波羅蜜。何等二忍？生忍、法忍。#88.22
從初發意乃至坐道場，於其中間，若一切眾生來罵詈麁惡語，或以瓦石、刀杖#88.23加是菩薩，是菩薩欲具足羼提波羅蜜故，乃至不生一念惡。#88.24
是菩薩如是思惟：『罵我者誰？害#88.25我者誰？以惡言加我、以瓦石刀杖害我者誰？』
何以故？是菩薩於一切法得無相忍故，云何作是念──『是人罵我、害我』？#88.26
~2545若菩薩摩訶薩如是行，能具足羼提波羅蜜。
%83.21 2、具足忍度故，得無生法忍
%83.22 （1）標舉
以是羼提波羅蜜具足故，得無生法忍。」
%83.23 （2）釋無生法忍
%83.24 A、須菩提問
須菩提白佛言：「世尊！云何為無生法忍？是忍何所斷、何所知？」
%83.25 B、佛答
%83.26 （A）乃至不生少許不善法，名「無生法忍」
佛告須菩提：「得法忍，乃至不生少許不善法，是故名無生法#88.27忍。
%83.27 （B）一切煩惱斷盡名「斷」，知一切法不生名「知」
一切菩薩所斷煩惱盡，是名斷；用智慧知一切法不生，是名知。」#88.28
%83.28 （3）兼論二乘忍與菩薩忍之異
%83.29 A、須菩提問
須菩提白佛言：「世尊！諸聲聞辟支佛無生法忍、菩薩無生法忍，有何等異？」#88.29
%83.30 B、佛答：二乘若智、若斷，是名菩薩忍
佛告須菩提：「諸須陀洹若智、若斷，是名菩薩忍；斯陀含若智、若斷，是名菩薩忍；阿那含若智、若斷，是名菩薩忍；阿羅漢若智、若斷，是名菩薩忍；辟支佛若智、若斷，是名菩薩忍。是為異。#88.30
%83.31 （三）攝諸功德
須菩提！菩薩摩訶薩成就是忍，勝一切聲聞、辟支佛。
住如#88.31是報得無生忍中，行菩薩道，能具足道種智；具足道種智故，常不離三十七助道法及空#88.32、無相、無作三昧，常不離五神通；
%83.32 （四）嚴土熟生，得一切種智
不離五神通故，能成就眾生、淨佛國土；成就眾生、淨佛國土已，當得一切種智。
~2546
%83.33 （五）結
如是，須菩提！菩薩摩訶薩具足無相羼提波羅蜜。
%83.34 四、約精進度說
%83.35 （一）住無相五陰如夢等，行身精進、心精進
復次，須菩提！菩薩摩訶薩住無相五陰如夢、如響、如影、如焰、如幻、如化，行身精進、心@t25p676b精進。
%83.36 （二）以身精進、心精進能具足精進度
%83.37 1、身精進
以身精進故起神通；起神通故，到十方國土，供養諸佛、饒益眾生；以身精進力教#88.33化眾生，令住三乘。
如是，須菩提！菩薩摩訶薩行般若波羅蜜，能具足無相精進波羅蜜。#88.34
%83.38 2、心精進
是菩薩以心精進、聖無漏精進，入八聖道分中，能具足毘梨耶波羅蜜。
%83.39 （三）攝諸功德
是毘梨耶波羅蜜皆攝一切善法──所謂四念處、四正勤、四如意足、五根、五力、七覺分、八聖道分，四禪、四無量心、四無色定、八解#88.35脫、九次第定，佛十力、四無所畏、四無礙智、十八不共法。
%83.40 （四）得一切種智，轉法輪度眾生
是#88.36菩薩行是法，應具足一切種智；具足一切種智已，斷一切煩惱習，具足滿三十二相，身放無等無量光明；放光明已，三轉十二行法輪；法輪轉故，三千大千世界#88.37六種震動，光明遍照三千大千世界；三千大千世界中眾生聞說法聲，皆以三乘法而得度脫。#88.38
%83.41 （五）結：具足精進度，能大饒益，具足一切種智
如是，須菩提！菩薩摩訶薩住精進波羅蜜中，能大饒益及能具足一切種智。
~2547
%83.42 五、約禪定度說
%83.43 （一）住五陰如夢等，能具足無相禪定度
%83.44 1、標舉
復次，須菩提！菩薩住無相五陰如夢、如響、如影、如焰、如幻、如化，能具足禪波羅蜜。」
%83.45 2、釋義
%83.46 （1）須菩提問
「世尊！云何菩薩住五陰如夢、如響、如影、如焰、如幻、如化，能具足禪波羅蜜？」
%83.47 （2）佛答
%83.48 A、除佛三昧外，餘三昧皆可證入
「須菩提！菩薩摩訶薩入初禪乃至入#88.39第四禪，入慈、悲、喜、捨無量心，入無邊虛空處乃至入非有想非無想處，入空三昧、無相#88.40、無作三昧，入如電光三昧，入如金剛三昧，入聖正三昧；除諸佛三昧，諸餘三昧──若共聲聞、辟支佛三昧，皆證皆入。
%83.49 B、不受三昧味，不受三昧果
%83.50 （A）正明
亦不受三昧味，亦不受三昧果。
%83.51 （B）釋因由
%83.52 a、知三昧無相無所有故不受味
何以故？是菩薩知是三昧無相、無所有性，當云何於無相法受無相法味、無所有法受無所有法味？
%83.53 b、不見人法故不受果
若不受味，@t25p676c則不隨禪定力生若色界、若無色界。
何以故？是菩薩不見是二界，亦不見是禪，亦不見入禪者，亦不見用法入禪者。#88.41
%83.54 C、結
若不得是法，即能具足無相禪波羅蜜。#88.42
%83.55 （二）攝諸功德
%83.56 1、能過二乘地
~2548
%83.57 （1）標舉
菩薩用是禪波羅蜜#88.43，能過聲聞、辟支佛地。」
%83.58 （2）釋因：善學空法故
%83.59 A、須菩提問
須菩提白佛言：「世尊！云何菩薩具足無相禪波羅蜜故能過聲聞、辟支佛地？」
%83.60 B、佛答：行空能入菩薩位
佛告須菩提#88.44：「菩薩#88.45善學內空，善學外空，乃至善學無法有法空；於是諸空，無法可住處──若須陀洹果，若斯陀含果、阿那含果、阿羅漢果，乃至一切種智；是諸空亦空。菩薩摩訶薩行如是諸空，能入菩薩位中。」#88.46
%83.61 （3）別辨菩薩位、非位
%83.62 A、正明
須菩提白佛言：「世尊！云何菩薩摩訶薩位？云何非位？」
「須菩提！一切有所得是非菩薩位，一切無所得是菩薩位。」#88.47
%83.63 B、論「有所得、無所得」
「世尊！何等是有所得？何等是無所得？」
%83.64 （A）非菩薩位──於法有所得
「須菩提！色是有所得，受、想、行、識是有所得，眼、耳、鼻、舌、身、意，乃至一切種智有所得──是非菩薩位。#88.48
%83.65 （B）菩薩位──於法不可示、不可說
須菩提！菩薩位者，是諸法不可示、不#88.49可說。
何等法不可示、不可說？
若色乃至一切種智。何以故？須菩提！色性是不可示、不可說，乃至一切種智性是不可示、不可說。
~2549須菩提！如是名菩薩位。#88.50
%83.66 2、不隨禪生
是菩薩入位中，一切禪定、三昧具足，尚不隨禪定、三昧力生，何況住婬、怒、癡，於中起罪業生！#88.51
%83.67 （三）成就眾生、嚴淨佛土
菩薩但住如幻法中饒益眾生，亦不得眾生及如幻法#88.52。
若無所得，是時，能成就眾生、淨佛國土。#88.53
%83.68 （四）結：具足禪度，能轉不可得法輪
如是，須菩提！是名菩薩具足無相禪波羅蜜，乃至能轉法輪，所謂不可得法#88.54輪。#88.55
%83.69 六、約般若度說
%83.70 （一）行般若度，知諸法如夢等
%83.71 1、標舉
復次，須菩提！菩薩摩訶薩行般若波羅蜜，知一切法如夢、如響、如焰、如影、如幻、如化。」
%83.72 2、釋義
%83.73 （1）須菩提問
須菩提白佛言：「世尊！菩@t25p677a薩摩訶薩云何知一切法如夢、如響、如影、如焰、如幻、如化？」
%83.74 （2）佛答
%83.75 A、不見「夢等法及能見法者」
「須菩提！菩薩摩訶薩行般若波羅蜜時，不見夢、不見見夢者，不見響、不見聞響者，不見影、不見見影者，不見焰、不見見焰者，不見幻、不見見幻者，不見~2550化、不見見化者。
何以故？是夢、響、影、焰、幻、化皆是凡夫愚人顛倒法故。阿羅漢不見夢、不見見夢者，乃至不見化、不見見化者；辟支佛、菩薩摩訶薩、諸佛亦不見夢#88.56、不見見夢者，乃至不見化、亦不見見化者。
何以故？一切法無所有性、不生、不定。#88.57
%83.76 B、諸法無實性故能修般若
若法無所有性、不生、不定，菩薩摩訶薩當云何行般若波羅蜜，是中取生相、定相？是處不然！
何以故？若諸法#88.58少多有性、有生、有定，不名修#88.59般若波羅蜜。#88.60
%83.77 C、善行般若度，不著一切法
如是，須菩提！菩薩摩訶薩行般若波羅蜜，不著色乃至不著識，不著欲、色、無色界，不著諸禪、解脫、三昧，不著四念處乃至八聖道分，不著空三昧、無相#88.61、無作三昧，不著檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜。
%83.78 （二）攝諸功德，得無上菩提度眾生
%83.79 1、具足菩薩十地而不生著
不著故，能具足菩薩初地，於初地中亦不生著。何以故？是菩薩不得是地，云何生貪著？
乃至十地亦如是。
%83.80 2、行般若亦不得般若，諸法與般若無二無別
是菩薩行般若波羅蜜，亦不得般若波羅蜜；若行般若波羅蜜時不得般若波羅蜜，是時見#88.62一切法皆入般若波羅蜜中，亦不得是法。何以故？是諸法與般若波羅蜜無二無別。
何以故？諸法入如、法性、實際故無分別。」#88.63
~2551
%83.81 3、空有無礙
%83.82 （1）於諸法實相中，一切無相無分別
%83.83 A、須菩提問
須菩提白佛言：「世尊！若諸法無相#88.64、無分別，云何說是善是不善、是有漏是無漏、是世間是出世間、是有為是無為？」
%83.84 B、佛反問
「須菩提！於#88.65汝@t25p677b意云何？諸法實相中，有法可說是善、是#88.66不善，乃至是有為、是無為，是須陀洹果乃至是阿羅漢、是辟支佛、是菩薩、是阿耨多羅三藐三菩提不？」
「世尊！不可說也！」
%83.85 C、佛正答
「須菩提！以是因緣故，當知一切法無相、無分別、無生、無定#88.67、不可示。#88.68
%83.86 （2）善學空無所得，能具足六度，得無上菩提度眾生
須菩提！我本行菩薩道時，亦無有法可得性──若色、若受想行識乃至若有為、若無為，須陀洹果乃至阿耨多羅三藐三菩提。#88.69
如是，須菩提！菩薩摩訶薩行般若波羅蜜，從初發意乃至阿耨多羅三藐三菩提，應善學諸法性。善學諸法性故#88.70，是名阿耨多羅三藐三菩提道。行是道，能具足六波羅蜜，成就眾生、淨佛國土；住是法中得阿耨多羅三藐三菩提，以三乘法度脫眾生，亦不著三乘。#88.71
%83.87 （三）勸修：以無相法為方便，修學般若波羅蜜
如是，須菩提！菩薩摩訶薩以無相法應學般若波羅蜜。」#88.72
^88.2
%84.0 壹、明菩薩希有法
%84.1 （壹）生身菩薩於一國土中方便化他
%84.2 一、須菩提問
須菩提白佛言：「世尊！若諸法如夢、如響、如影、如焰、如幻、如化，無有實事、無所有性、自相空者，云何分別是善法、是不善法，是世間法、@t25p678a是出世間法，是有漏法、是無漏法，是有為法、是無為法，是法能得須陀洹果，能得斯陀含果、阿那含果、阿羅漢果，能得辟支佛道，能得阿耨多羅三藐三菩提？」
%84.3 二、佛答
%84.4 （一）凡夫顛倒心故起三業
佛告須菩提：「凡夫愚人得夢、得見夢者，乃至得化、得見化者，起身口意善業、不善業、無記業，起福業、若起罪業、作不動業。
%84.5 （二）明菩薩住二空中為眾生說法
%84.6 1、二空破執示實相
是菩薩摩訶薩行般若波羅蜜，住二空中──畢竟空、無始空，為眾生說法，作是言：『諸眾生！是色空無所有，受、想、行、識空無所有；#88.84十二入、十八界空無所有。
色是夢，受、想、行、識是夢；十二入、十八界是夢。
色是響、是影、是焰、是幻、是化，受、想、行、識亦如是。
十二入、十八界是夢、是響、是影、是焰、是幻、是化。
是中無陰、入、界，無夢亦無見夢者，無響亦無聞響者，無影亦無見影者，無焰亦無見焰者，無幻亦無見幻者，無化亦無見化者。
%84.7 2、呵眾生顛倒取相
一切法無#88.85根本實性無所有，汝等於無陰中見有#88.86陰、無入見有入、無界見有界。是一切法皆從因緣和合生，以顛倒心起，屬業果報，汝等何以故於諸法空無根本中而取根本相？』#88.87
~2555
%84.8 （三）令離惡生善
%84.9 1、以福捨罪
是時，菩薩摩訶薩行般若波羅蜜，以方便力故，於慳法中拔出眾生，教行檀波羅蜜；持是布施功德，得大福報。
從大福報拔出，教令持戒；持戒功德，生天上尊貴處。
復拔出，令住初禪；初禪功德，生梵天處。
二禪、三禪、四禪、無邊空處、無邊#88.88識處、無所有處、非有想非無想處亦如是。
%84.10 2、以空捨福
眾生行是布施及布施果報，持戒及持戒果報，禪定及禪定果報，種種因緣#88.89拔出，安置無餘涅槃及涅槃道中，所謂四念處、四正勤、四如意足、五根、五力、@t25p678b七覺分、八聖道分，空解脫門、無相、無作解脫門，八背捨、九次第定，佛十力、四無所畏、四無礙智、十八不共法，安隱眾生，令住聖無漏法──無色、無形、無對法中。
%84.11 3、令證聖果
有可得須陀洹果者，安隱教化，令住須陀洹果；可得斯陀含果、阿那含果、阿羅漢果、辟支佛道者，令住斯陀含果、阿那含果、阿羅漢果、辟支佛道；可得阿耨多羅三藐三菩提者，亦安隱教化，令住阿耨多羅三藐三菩提中。」
%84.12 三、稱歎述成
%84.13 （一）須菩提領解稱歎
須菩提白佛言：「世尊！諸菩薩摩訶薩甚希有難及，能行是深般若波羅蜜，諸法無所有性，畢竟空、無始空，而分別諸法是善、是不善，是有漏、是無漏，乃至是有為、是無為。」#88.90
%84.14 （二）如來述成
佛告須菩提：「如是！如是！諸菩薩摩訶薩甚希有難及，能行是深般若波羅蜜，諸法無所有性，畢竟空、無始空，而分別諸法。
須菩提！汝等若知是菩薩摩訶薩希有難及法，則知一切聲聞、辟支佛不能報，何況~2556餘人！」#88.91
%84.15 （貳）法身菩薩於無量世界中度眾無邊
%84.16 一、正明法身菩薩利益眾生
%84.17 （一）總述菩薩以希有法攝取眾生
須菩提白佛言：「世尊！何等是菩薩摩訶薩希有難及法，諸聲聞、辟支佛所無有？」
佛告須菩提：「一心諦聽！有菩薩摩訶薩行般若波羅蜜，住報得六波羅蜜中及住報得五神通、三十七助道法，住諸陀羅尼、諸無礙智，到十方世界，可以布施度者，以布施攝之；可以持戒度者，以持戒攝之；可以忍辱、精進、禪定、智慧度者，隨其所應而攝取之。
可以初禪度者，以初禪攝取之；可以二禪、三禪、四禪、無邊空處、無邊識處、無所有處、非有想非無想處度者，隨其所應而攝取之。
可以慈、悲、喜、捨心度者，以慈、悲、喜、捨心攝取之。
可以四念處、四正勤、四@t25p678c如意足、五根、五力、七覺分、八聖道分，空三昧、無相、無作三昧度者，隨所#88.92攝之。」
%84.18 （二）別明以布施攝取眾生
%84.19 1、明外施
%84.20 （1）明平等施為得
「世尊！菩薩摩訶薩云何以布施饒益眾生？」
「須菩提！菩薩行般若波羅蜜時布施，隨其所須飲食、衣服、車馬、香華、瓔珞、種種所須，盡給與之。若供養佛、辟支佛、阿羅漢、阿那含、斯陀含、須陀洹等無有異；若施入正道中人及凡人，下至禽獸，皆無分別，等一布施。何以故？一切法不異、不分別故。
是菩薩無異、無#88.93別布施已，當得無分別法#88.94報，所謂一切種智。#88.95
%84.21 （2）明差別施為失
須菩提！若菩薩摩訶薩見乞匃#88.96者，若生是心：『佛是福田，我應供養；禽獸非福~2557田，不應供養。』是非菩薩法。何以故？菩薩摩訶薩發阿耨多羅三藐三菩提心，不作是念：『是眾生應以布施饒益，是不應布施。』
是眾生布施因緣故，應#88.97生剎利大姓、婆羅門大姓、居士大家，乃至以是布施因緣，以三乘法度之，令入無餘涅槃。#88.98
若眾生來從菩薩乞，亦不生異心分別：『應與是，不應與是。』
何以故？是菩薩為是眾生故發阿耨多羅三藐三菩提心；若分別簡擇，便墮諸佛、菩薩、辟支佛、學無學人、一切世間天及人訶責處：『誰請汝救一切眾生？汝為一切眾生舍、一切眾生護、一切眾生依，而分別簡擇應與、不應與？』
%84.22 2、明內施
%84.23 （1）明平等施
復次，若菩薩摩訶薩行般若波羅蜜時，若人、若非人來，欲求乞菩薩身體支節#88.99，是時不應生二心：『若與？若不與？』何以故？是菩薩摩訶薩為眾生故受身，眾生來取，何可不與？
『我以饒益眾生故受是身，眾生不乞，自應與之，何況乞而不與！』
菩薩摩訶薩行般若波羅蜜，@t25p679a應如是學。
%84.24 （2）正明內施
復次，須菩提！菩薩摩訶薩見有乞者，應生是念：『是中誰與、誰受？所施何物？是一切法自性皆不可得，以畢竟空故；空相法，無與、無奪。』#88.100
何以故？畢竟空故，內空故，外空、內外空、大空、第一義空、自相空故。
住是諸空布施，是時具足檀波羅蜜。具足檀波羅蜜故，若斷內外法時，作是念：『截我者誰？割我者誰？』
~2558
%84.25 二、佛舉自所見為證，明菩薩以三事教化眾生
%84.26 （一）化三惡道
%84.27 1、化地獄道；承事諸佛，聞法受持
復次，須菩提！我以佛眼見東方如恒河沙等諸菩薩摩訶薩入大地獄，令火滅湯#88.101冷，以三事教化：一者、神通，二者、知他心，三者、說法。#88.102是菩薩以神通力，令大地獄火滅湯冷；知他心；以慈、悲、喜、捨，隨意說法。#88.103
是眾生於菩薩生清淨心，從地獄得脫，漸以三乘法得盡苦際。
南西北方、四維、上下亦如是。
復次，須菩提！我以佛眼觀十方世界，見如恒河沙等國土中諸菩薩為諸佛給使#88.104，供養#88.105諸佛，隨意愛樂恭敬；若諸佛所說，盡能受持，乃至阿耨多羅三藐三菩提，終不忘失。#88.106
%84.28 2、化畜生道
復次，須菩提！我以佛眼觀十方如恒河沙等國土中諸菩薩摩訶薩，為畜生故，捨其壽命，割截身體，分散諸方。諸有眾生食是諸菩薩摩訶薩肉者#88.107，皆愛敬菩薩；以愛敬故，即得離畜生道，值遇諸佛，聞佛說法，如說修行，漸以三乘──聲聞、辟支佛、佛法於無餘涅槃而般涅槃。#88.108
如是，須菩提！諸菩薩摩訶薩所益甚多──教化眾生令發阿耨多羅三藐三菩提心，如說修行，乃至於無餘涅槃而般涅槃。
%84.29 3、化餓鬼道
復次，須菩提！我以佛眼見十方如恒河沙等國土中諸菩薩摩訶薩除諸餓鬼飢渴苦，是諸餓鬼皆愛敬菩薩；以愛@t25p679b敬故，得離餓鬼道，值遇諸佛，聞諸佛說法，~2559如說修行，漸以三乘──聲聞、辟支佛、佛法而般涅槃，乃至無餘涅槃。
如是，須菩提！菩薩摩訶薩為度眾生故，行大悲心。
%84.30 （二）化天道
%84.31 1、化欲界天
復次，須菩提！我以佛眼見諸菩薩摩訶薩在四天王天上說法，在三十三天、夜摩天、兜率陀天、化樂天、他化自在天上說法；諸天聞菩薩說法，漸以三乘而得滅度。
須菩提！是諸天眾中有貪著五欲者，是菩薩示現火起，燒其宮殿，而為說法，作是言：『諸天！一切有為法悉皆無常，誰得安者？』
%84.32 2、化諸梵天
復次，須菩提！我以佛眼觀十方世界，見如恒河沙等國土中諸梵天著於邪見，諸菩薩摩訶薩教令遠離邪見，作是言：『汝等云何於空相虛妄諸法中而生邪見？』
如是，須菩提！菩薩摩訶薩住大慈心，為眾生說法。
%84.33 （三）結
須菩提！是為諸菩薩希有難及法。
%84.34 三、詳論菩薩以四攝利益眾生
%84.35 （一）總標
復次，須菩提！我以佛眼觀十方世界如恒河沙等國土中，諸菩薩摩訶薩以四事攝取眾生。
何等為#88.109四？布施、愛語、利益、同事。
%84.36 （二）別釋
%84.37 1、布施攝
%84.38 （1）總說
云何菩薩以布施攝取#88.110眾生？
須菩提！菩薩以二種施攝取眾生：財施、法施。
%84.39 （2）別釋
%84.40 A、財施
%84.41 （A）正明財施
何等財施攝取眾生？
須菩提！菩薩摩訶薩以金、銀、琉璃、頗梨#88.111、真珠、珂貝#88.112、珊瑚等諸寶物，或以飲食、衣服、臥具、房舍、燈燭、華、香、瓔珞，若男、若女，若牛、羊、象、馬、車乘，若以己身，給施眾生；語眾生言：『汝等若有所須，各來取之；如取己物，莫得疑難！』
~2560
%84.42 （B）明財施已法施
是菩薩施已，教三歸依：歸依佛、歸依法、歸依僧；或教受五戒，或教一日戒；或教初禪乃至教非有想非無想定，或教慈、悲、喜、捨，或教念佛、念法、念僧、念戒、念捨、念天，或@t25p679c教不淨觀，或教安那般那觀，或相、或觸；或教四念處、四正勤、四如意足、五根、五力、七覺分、八聖道分，#88.113空三昧，無相#88.114、無作三昧，八背捨、九次第定，佛十力、四無所畏、四無礙智、十八不共法、大慈大悲、三十二相、八十隨形好；或教須陀洹果、斯陀含果、阿那含果、阿羅漢果，或教辟支佛道，或教阿耨多羅三藐三菩提。
%84.43 （C）結
如是，須菩提！菩薩摩訶薩行般若波羅蜜，以方便力教眾生，財施已，後#88.115教令得無上安隱涅槃。
須菩提！是名菩薩摩訶薩希有難及法。
%84.44 B、法施
%84.45 （A）總標
須菩提！菩薩云何以法施攝取眾生？
須菩提！法施有二種：一者、世間，二者、出世間。
%84.46 （B）別釋
%84.47 a、明世間法施
%84.48 （a）略明世間法施
何等為世間法施？
敷演#88.116、顯示世間法，所謂不淨觀、安那般那念、四禪、四無量心、四無色定。如是等世間法，及諸餘共凡夫所行法，是名世間法施。
%84.49 （b）廣述──因世間法施，得出世間法施
%84.50 Ⅰ、明所化事行
是菩薩如是世間法施已，以種種因緣教化，令遠離世間法；遠離世間法已，以方便力，令得聖無漏法及聖無漏法果。
%84.51 Ⅱ、明所化教乘
%84.52 （Ⅰ）聖無漏法、聖無漏法果
何等是聖無漏法？何等是聖無漏法果？
聖無漏法者，三十七助道法、三解脫門。
聖無漏法果者，須陀洹果乃至阿羅漢果，辟支佛道，阿耨多羅三藐三菩提。#88.117
~2561
%84.53 （Ⅱ）明菩薩乘之道果
%84.54 ⅰ、正明
復次，須菩提！菩薩摩訶薩聖無漏法：須陀洹果中智慧乃至阿羅漢果中智慧、辟支佛道中智慧、三十七助道法中智慧、六波羅蜜中智慧乃至大慈大悲中智慧──如是等一切法，若世間若出世間智慧、若有漏若無漏、若有為若無為，是法中一切種智，是名菩薩摩訶薩聖無漏#88.118法。#88.119
何等為聖無漏法果？斷一切煩惱習，是名聖無漏法果。」
%84.55 ⅱ、釋疑
須菩提白@t25p680a佛言：「世尊！菩薩摩訶薩得一切種智不？」
佛言：「如是！如是！須菩提！菩薩摩訶薩得一切種智。」#88.120
須菩提言#88.121：「菩薩與佛有何等異？」
佛言：「有異。菩薩摩訶薩得一切種智，是名為佛。
所以者何？菩薩心與佛心無有異。
菩薩住是一切種智中，於一切法無不照明。#88.122
%84.56 （c）結明意趣
是名菩薩摩訶薩世間法施。
~2562須菩提！菩薩摩訶薩因世間法施，得出世間法施。
如是，須菩提！菩薩摩訶薩教眾生令得世間法已，以方便力教令得出世間法。
%84.57 b、明出世法施
%84.58 （a）標舉
須菩提！何等是菩薩出世間法不共凡夫法同？
所謂四念處、四正勤、四如意足、五根、五力、七覺分、八聖道分，三解脫門、八背捨、九次第定，佛十力、四無所畏、四無礙智、十八不共法、三十二相、八十隨形好，五百陀羅尼門──是名出世間法。
%84.59 （b）別釋
%84.60 Ⅰ、三十七道品#88.123
%84.61 （Ⅰ）四念處#88.124
須菩提！云何為四念處？
菩薩摩訶薩觀內身循#88.125身觀、觀外身循身觀、觀內外身循身觀，勤精進，以一心智慧觀身、觀#88.126身集因緣、觀身滅、觀身集生滅；行是道，無所依，於世間無所#88.127愛。
受、心、法念處，亦如是。#88.128
%84.62 （Ⅱ）四正勤#88.129
須菩提！云何為四正勤？
未生惡不善法，為不生故，勤、生欲、精進；
已生惡不善法，為斷故，勤、生欲、精進；
未生善法，為生故，勤、生欲、精進；
已生諸善法，為增長修具足故，勤、生欲、精進──是名四正勤。#88.130
%84.63 （Ⅲ）四如意足#88.131
須菩提！云何為四如意足？欲三昧斷行成就初如意足，精進三昧、心三昧、思惟三昧斷行成就如意足。#88.132
~2563
%84.64 （Ⅳ）五根#88.133
云何為五根？信根、精進根、念根、定根、慧根。
%84.65 （Ⅴ）五力
云何為五力？信力、精進力、念力、定力、慧力。
%84.66 （Ⅵ）七覺分#88.134
云何為七覺分？念覺分、擇法覺分、精進覺分、喜覺分、除息#88.135覺分、定覺@t25p680b分、捨覺分。
%84.67 （Ⅶ）八聖道分#88.136
云何為八聖道分？正見、正思惟、正語、正業、正命、正精進、正念、正定。
%84.68 Ⅱ、三三昧#88.137
云何為三三昧？空三昧門，無相#88.138、無作三昧門。
云何為空三昧？以空行、無我行攝心，是名空三昧。
云何為無相三昧？以寂滅行、離行攝心，是為無相三昧。
云何為無作三昧？無常行、苦行攝心，是為無作三昧。
%84.69 Ⅲ、八背捨#88.139
云何為八背捨？內#88.140色相外觀色，是初背捨#88.141；內無色相外觀色，是二背捨；淨背捨，是三背捨；過一切色相，滅一切#88.142對相，不念一切異相故，觀無邊虛空，入無邊空處；乃至過一切非有想非無想處，入滅受想背捨。是名八背捨。
%84.70 Ⅳ、九次第定#88.143
云何九次第定？行者離欲、惡不善法#88.144，有覺有觀，離生喜樂，入初禪；第二、第三、第四禪；乃至過非有想非無想處，入滅受想定。是名九次第定。
~2564
%84.71 Ⅴ、佛德
%84.72 （Ⅰ）十力#88.145
云何為佛十力？（1）是處、不是處，如實知；（2）知#88.146眾生過去、未來、現在諸業諸受法#88.147，知造業處，知因緣，知報；（3）諸禪定、解脫、三昧、定垢淨分別相，如實知；（4）知他眾生諸根上下相；（5）知他眾生種種欲解；（6）知一切#88.148世間種種無數性；（7）知一切到道相；（8）知種種宿命，一世乃至無量劫，如實知；（9）天眼見眾生，乃至生善惡道；（10）漏盡故，無漏心解脫，如實知。是為佛十力。
%84.73 （Ⅱ）四無所畏#88.149
云何為佛#88.150四無所畏？
（1）佛作誠言：『我是一切正智人。』若有沙門、婆羅門，若天、若魔、若梵、若復餘眾如實言：『是法不知。』乃至不見是微畏相。『以是故，我得安隱、得無所畏，安住聖主處，在大眾中師子吼，能轉梵輪；諸沙門、婆羅門，若天、若魔、若梵、若復餘眾實不能轉。』一無畏也。
（2）佛作誠言：『我一切漏盡。』若有#88.151沙@t25p680c門、婆羅門，若天、若魔、若梵、若復餘眾如實言：『是漏不盡。』乃至不見是微畏相。『以是故，我得安隱、得無所畏，安住聖主處，在大眾中作師子吼，能轉梵輪；諸沙門、婆羅門，若天、若魔、若梵、若復餘眾實不能轉。』二無畏也。
（3）佛作誠言：『我說障法。』若有沙門、婆羅門，若天、若魔、若梵、若復餘眾如實言：『受是法不障道。』乃至不見是微畏相。『以是故，我得安隱、得無所畏，安住聖主處，在大眾中師子吼，能轉梵輪；諸沙門、婆羅門，若天、若魔、若梵、若復餘眾實不能轉。』三無畏也。
（4）佛作誠言：『我所說聖道，能出世間；隨是行，能盡苦。』若有沙門、婆羅門，若天、若魔、若梵、若復餘眾如實言：『行是道不能出世間、不能盡苦。』乃至不見是微畏相。『以是故，我得安隱、得無所畏，安住聖主處，在大眾中師子吼，能轉梵輪；諸沙門、婆羅門，若天、若魔、若梵、若復餘眾實不能轉。』四無畏也。
%84.74 （Ⅲ）四無礙智#88.152
~2565云何為四無礙智？一者、義無礙智，二者、法無礙智，三者、辭無礙智，四者、樂說無礙智。
（1）云何為#88.153義無礙智？緣義智慧，是為義無礙智。
（2）云何為#88.154法無礙智？緣法智慧，是為法無礙智。
（3）云何為辭無礙智？緣辭智慧，是為辭無礙智。
（4）云何為樂說無礙智？緣樂說智慧，是為樂說無礙智。
%84.75 （Ⅳ）十八不共法#88.155
云何為十八不共法？
一者、諸佛身無失，二者#88.156、口無失，三、念無失，四、無異想#88.157，五、無不定心，六、無不知已#88.158捨心，七、欲無減#88.159，八、精進無減，九、念無減，十、慧無減，十一、解脫無減，十二、解脫知見無減，十三、一切身業隨智慧行，十四、一切口業隨智慧行，十五、一切意業隨智慧行，@t25p681a十六、智慧知過去世無礙，十七、智慧知未來世無礙，十八、智慧知現在世無礙。
%84.76 （Ⅴ）三十二相#88.160
云何三十二相？
一者、足下安平，立平如奩#88.161底；#88.162二者、足下千輻輞輪，輪相具足；三者、手足指長勝於餘人；四者、手足柔軟勝餘身分；五者、足跟廣具足滿好；六者、手足指合縵網勝於餘人；七者、足趺#88.163高平好，與跟相稱；#88.164八者、伊泥延鹿𨄔，𨄔#88.165纖好，如伊泥延鹿王；九者、平住兩手摩膝；十者、~2566陰藏相，如馬王、象王；十一者、身縱廣等，如尼俱盧樹#88.166；十二者、一一孔一毛生，色青、柔軟、右旋；十三者、毛上向，青色柔軟#88.167右旋；十四者、金色相，其色微妙勝閻浮檀金；十五者、身光面一丈；十六者、皮薄細滑不受塵垢，不停蚊蜹#88.168；十七者、七處滿：兩足下、兩手中、兩肩上、項中皆滿字相分明；十八者、兩腋下滿；十九者、上身如師子；二十者、身廣端直；二十一者、肩圓好；二十二者、四十齒；二十三者、齒白齊密而根深；二十四者、四牙最白而大；二十五者、方頰#88.169車如師子；二十六者、味中得上味，咽中二處津液流出；二十七者、舌大、軟、薄，能覆面至耳髮際；二十八者、梵音深遠，如迦蘭頻伽聲；二十九者、眼色如金精#88.170；#88.171三十者、眼睫#88.172如牛王；三十一者、眉間白毫相，軟白如兜羅綿#88.173；三十二者、頂髻肉#88.174成。
是三十二相，佛身成就。
光明遍照三千大千世界#88.175，若欲廣照，則#88.176遍滿十方無量阿僧祇世界，為眾生故受丈光；若放無量光明，則無日月、時節、歲數。#88.177
佛音聲遍滿三千大千世界，若欲大聲，則遍滿十方無量阿僧祇世界；隨眾#88.178多~2567少，音聲遍至。#88.179@t25p681b
^89.1
%84.191 （Ⅵ）八十隨形好
云何為#89.3八十隨形好？
一者、無見頂；#89.4二者、鼻直高好，孔不現；#89.5三者、眉如初生月，紺#89.6琉璃色；#89.7
四者、耳輪埵#89.8成；#89.9五者、身堅實#89.10，如那羅延#89.11；#89.12
~2580六者、骨際#89.13如鉤鎖#89.14；#89.15七者、身一時迴如象王；#89.16八者、行時足去地四寸，而印文現；#89.17
九者、爪#89.18如赤銅色，薄而潤澤；#89.19十者、膝骨堅著圓好；#89.20
十一者、身淨潔；十二者、身柔軟；十三者、身不曲；十四者、指長纖圓；
十五者、指文#89.21莊嚴；#89.22十六者、脈深；#89.23十七者、踝不現；#89.24十八者、身潤澤；#89.25
十九者、身自持#89.26，不逶迤#89.27；#89.28二十者、身滿足；#89.29
~2581二十一者、識滿足；#89.30二十二者、容儀#89.31備足；二十三者、住處安，無能動者；#89.32
二十四者、威震一切；#89.33二十五者、一切樂觀；#89.34
二十六者、面不大長；#89.35二十七者、正容貌，不撓#89.36色；#89.37二十八者、面具足滿；#89.38
二十九者、脣赤如頻婆果色；#89.39三十者、音響深；#89.40
三十一者、臍#89.41深圓好；#89.42三十二者、毛右旋；
三十三者、手足滿；#89.43三十四者、手足如意；#89.44
~2582三十五者、手文明直；三十@t25p684c六者、手文長；三十七者、手文不斷；#89.45
三十八者、一切惡心眾生見者和悅；#89.46三十九者、面廣姝#89.47；#89.48四十者、面淨滿#89.49如月；#89.50
四十一者、隨眾生意，和悅與#89.51語；#89.52四十二者、毛孔出香氣；#89.53四十三者、口出無上香；
四十四者、儀容如師子；#89.54四十五者、進止#89.55如象王；#89.56四十六者、行法如鵝王；#89.57
四十七者、頭如摩陀羅#89.58果#89.59；#89.60四十八者、一切聲分具足；#89.61四十九者、牙~2583利；#89.62
五十者、舌色赤；五十一者、舌薄；#89.63
五十二者、毛紅色；五十三者、毛潔淨；#89.64
五十四者、廣長眼；#89.65五十五者、孔門相具足#89.66；#89.67
五十六者、手足赤白如蓮華色；#89.68
五十七者、臍#89.69不出；#89.70五十八者、腹不現；#89.71五十九者、細腹；
六十者、身不傾動；#89.72六十一者、身持重#89.73；六十二者、其身分大；#89.74六十三者、身長；
六十四者、手足淨潔#89.75軟澤；#89.76六十五者、邊光各一丈；#89.77六十六者、光照~2584身而行；#89.78
六十七者、等視眾生；#89.79六十八者、不輕眾生；
六十九者、隨眾生音聲不過不減；#89.80七十者、說法不差#89.81；七十一者、隨眾生#89.82語言而為說法；#89.83七十二者、一發#89.84音報眾聲；#89.85七十三者、次第有因緣說法；#89.86
七十四者、一切眾生不能盡觀相#89.87；#89.88七十五者、觀者無厭足；#89.89
七十六者、髮長好；#89.90七十七者、髮不亂；#89.91七十八者、髮旋好；#89.92七十九者、髮色好#89.93如青珠；#89.94
八十者、手足有德相。#89.95
須菩提！是#89.96八十隨形好，佛身成就。
~2585
%84.192 （3）結
如是，@t25p685a須菩提！菩薩摩訶薩以二施攝取眾生，所謂財施、法施，是為菩薩希有難及事。
%84.193 2、愛語攝
云何為菩薩摩訶薩愛語攝取眾生？
菩薩摩訶薩以六波羅蜜為眾生說法，作是言：『汝行六波羅蜜，攝一切善法。』
%84.194 3、利行攝
云何為菩薩摩訶薩利行攝取眾生？
菩薩摩訶薩長夜教眾生，令行六波羅蜜。#89.97
%84.195 4、同事攝
云何為菩薩摩訶薩同事攝取眾生？
菩薩摩訶薩以五神通力故種種變化，入五道中，與眾生同事。#89.98
%84.196 （三）結
以此四事而攝取之。
%84.197 貳、明「菩薩雖能廣利，不存化功」
%84.198 （壹）明菩薩於空有無礙
%84.199 一、論「於空法中度眾生」
%84.200 （一）明化生事：勸學四十二字門，善知字法、無字法
復次，須菩提！菩薩摩訶薩行般若波羅蜜時，教化眾生：『善男子！當善學分別諸字，亦當善知一字乃至四十二字。一切語言，皆入初字門；一切語言，亦入第二字門；乃至第四十二字門，一切語言皆入其中。一字皆入四十二字，四十二字亦入一字。』是眾生應如是善學四十二字。
善學四十二字已，能善說字法；善說字法#89.99已，善說無字法。
須菩提！如佛善知字法#89.100、善知字、善知無字，為無字法故說字法。
何以故？須菩提！過一切名字故#89.101，名為佛法。」#89.102
~2586
%84.201 （二）論「空中行化」
%84.202 1、須菩提難
須菩提白佛言：「世尊！若眾生畢竟不可得，法亦不可得，法性亦不可得，畢竟空故#89.103、無始空故。世尊！菩薩摩訶薩行般若波羅蜜，行禪波羅蜜、毘梨耶波羅蜜、羼提波羅蜜、尸羅波羅蜜、檀波羅蜜時，行四禪、四無量心、四無色定，三十七助道法，十八空，行空、無相、無作三昧，八背捨、九次第定，佛十力、四無所畏、四無礙智、十八不共法、三十二相、八十隨形好，云何住報得五神通為眾生說法？#89.104
眾生實不可得；眾生不可得#89.105故，色不可得，乃至識亦不可得；五眾@t25p685b不可得故，六波羅蜜乃至八十隨形好皆不可得。
是不可得中，無眾生、無色乃至無#89.106八十隨形好。世尊！云何菩薩摩訶薩行般若波羅蜜，為眾生說法？
世尊！菩薩行般若波羅蜜時，菩薩尚不可得，何況當有菩薩法！」
%84.203 2、佛答
%84.204 （1）印人法二空
佛告須菩提：「如是！如是！如汝所言。
眾生不可得故，當知是內空、外空、內外空、空空、大空、第一義空、有為空、無為空、畢竟空、無始空、散空、諸法空、自相空、性空、不可得空、無法空、有法空、無法有法空#89.107。#89.108
~2587眾生不可得故#89.109，當知五陰空、十二入空#89.110、十八界空，十二因緣空、四諦空，我空，壽者、命者、生者、養者、育者、眾數者、人者、作者、使作者、起者、使起者、受者、使受者、知者、見者皆空。
眾生不可得故，當知四禪空、四無量心空、四無色定空，當知四念處空乃至八聖道分空，空空、無相空、無作空，八背捨空、九次第定空。
眾生不可得故，當知佛十力空、四無所畏空，四無礙智空、十八不共法空，當知須陀洹果空、斯陀含果空、阿那含果空、阿羅漢果空、辟支佛道空，當知菩薩地空，當知阿耨多羅三藐三菩提空。
%84.205 （2）明「菩薩如實見空而為眾生說，不壞法相」
%84.206 A、標宗
須菩提！菩薩摩訶薩如是見一切法空，為眾生說法，不失諸空相。#89.111
是菩薩如是觀時，知一切法無礙；知一切法無礙已，不壞諸法相，不二不分別，但為眾生如實說法。#89.112
%84.207 B、舉喻
譬如佛所化人，化人復化作無量千萬億人，有教令布施者，有教持戒、有教忍辱、有教精進、有教禪定、有教智慧、有教四禪、四無量心、四無色定者。於汝意云何#89.113？佛所化人有分別破壞諸法不？」
須菩提言：「不也！世尊！是化人無心、無心數法，云何@t25p685c分別破壞諸法？」
%84.208 （3）諸法畢竟淨、不縛不脫故，為眾生如應說法
「以是故，須菩提！當知菩薩摩訶薩行般若波羅蜜，為眾生如應說法，拔出眾生於顛倒地，令眾生各得如所應住地，以不縛不脫法故。
何以故？須菩提！是色不縛不脫，受、想、行、識不縛不脫；色無縛無脫不是色，受、想、行......識無縛無脫不是識。
何以故？色畢竟清淨故，受、想、行、識乃至一切法若有為、若無為，亦畢竟清淨故。#89.114
~2588
%84.209 （4）以空無所住而說法，則清淨無過
如是，須菩提！菩薩摩訶薩為眾生說法，亦不得眾生及一切法。
一切法不可得故，菩薩以不住法故，住諸法相中，所謂色空，乃至有為、無為法空。#89.115
何以故？色乃至有為、無為法自性不可得故，無有住處。
無所有法不住無所有法，所有法不住所有法#89.116，自性法不住自性法，他性法不住他性法。
何以故？是一切法皆不可得故。不可得法當住何處？#89.117
如是，須菩提！菩薩摩訶薩行般若波羅蜜，以是諸空，能如是說法，如是行般若波羅蜜，於諸佛及聲聞、辟支佛無有過。
何以故？諸佛#89.118、菩薩、辟支佛、阿羅漢得是法已，為眾生說法，亦不轉諸法相。
何以故？如、法性、實際不可轉故。
所以者何？諸法性無故。」#89.119
%84.210 二、論「若諸法無異，云何分別有業果」
%84.211 （一）諸法與法性平等無異
須菩提白佛言：「世尊！若法性、如、實際不轉，色與法性異不？色與如、實際異不？受、想、行、識，乃至有為、無為法，世間、出世間，有漏、無漏異不？」#89.120
~2589佛言：「不也！色不異法性、不異如、不異實際#89.121；受、想、行、識，乃至有漏、無漏亦不異。」#89.122
%84.212 （二）依二諦明有無業果之別
%84.213 1、須菩提問
須菩提白佛言：「世尊！若『色不異法性、不異如、不異實際，受、想、行、識，乃至有漏、無漏不異』者，云何分別黑法有黑報，所謂地獄、餓鬼、畜生；白法有白報，所@t25p686a謂天#89.123及人；黑白法有黑白報；不黑不白法有不黑不白報，所謂須陀洹果、斯陀含果、阿那含果、阿羅漢果、辟支佛道、阿耨多羅三藐三菩提？」#89.124
%84.214 2、佛答：依世俗諦有分別，第一義中無分別
佛告須菩提：「世諦故，分別說有果報，非第一義；第一義中不可說因緣果報。
何以故？是第一義，實無有相，無有分別，亦無言說，所謂色乃至有漏、無漏法，不生不滅相、不垢不淨，畢竟空、無始空故。」#89.125
　%84.215 三、辨「於勝義中凡聖無別」
%84.216 （一）須菩提難
須菩提白佛言：「世尊！若『以世諦故分別說有果報，非第一義』者，一切凡夫人應有須陀洹果、斯陀含果、阿那含果、阿羅漢果、辟支佛道、阿耨多羅三藐三菩提！」#89.126
%84.217 （二）佛答
%84.218 1、凡夫不知二諦故無道果
~2590佛告須菩提：「於汝意云何？凡夫人為知是世諦法#89.127、是第一義諦#89.128不？若知，是凡夫人應是須陀洹果乃至阿耨多羅三藐三菩提。
須菩提！以凡夫人實不知世諦、不知第一義諦、不知道、不知分別道果，云何當有諸果？
%84.219 2、聖人知二諦故有道果
須菩提！聖人知世諦、知第一義諦，有道、有修道，以是故聖人差別有諸果。」#89.129
%84.220 （貳）不存化功故得聖果
%84.221 一、論修道得果
%84.222 （一）須菩提問
須菩提白佛言：「世尊！修道得果不？」
%84.223 （二）佛答
%84.224 1、依四句破著心
佛言：「不也！須菩提！修道不得果，不修道亦不得果，亦不離道得果，亦不住道中得果。#89.130
%84.225 2、雖為眾生施設道果差別，而不分別取相
如是，須菩提！菩薩摩訶薩行般若波羅蜜時，為眾生故分別果，亦不分別是有為性、無為性。」#89.131
%84.226 二、論三乘諸果差別
%84.227 （一）須菩提問
「世尊！若不分別有為性、無為性得諸果者，云何世尊自說：『三結盡，名須陀洹果；婬、怒、癡薄故，名斯陀含果；五此間結盡，名阿那含果；五彼間結盡，名阿羅漢果；所有集法皆滅散相，名辟支佛道；一切煩惱習斷故，名阿耨多羅三藐三菩提』？
世尊！我當云何知不分別有為性、無為性得諸果？」#89.132
~2591
%84.228 （二）佛反問答
%84.229 1、明三乘道果是無為
佛告須菩提：「@t25p686b汝以須陀洹果、斯陀含果、阿那含果、阿羅漢果、辟支佛道、阿耨多羅三藐三菩提，是諸果是有為、是無為？」
須菩提言：「世尊！皆是無為！」
%84.230 2、明無為中無分別
「須菩提！無為法中有分別不？」
「不也！世尊！」
%84.231 3、明無相中無二無別
「須菩提#89.133！若善男子、善女人通達一切法若有為、若無為一相，所謂無相，是時有分別若有為、若無為不？」
「不也！世尊！」
%84.232 三、論菩薩以無所著法自行化他無礙
%84.233 （一）正明
「如是，須菩提！菩薩摩訶薩為眾生說法，不分別諸法，所謂內空故，乃至無法有法空故。是菩薩自得無所著法，亦教人令得無所著法──若檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜，初禪乃至第四禪，慈、悲、喜、捨，無邊虛#89.134空處乃至非有想非無想處，若四念處乃至一切種智。
是菩薩自不著故，亦教他#89.135令得無所著，無所著故無所礙。#89.136
%84.234 （二）舉喻
譬如佛所化人布施，亦不受布施報，但為度眾生故；乃至行一切種智，不受一切種智報。
%84.235 （三）合法：善達諸法相
菩薩摩訶薩亦如是，行六波羅蜜，乃至一切法──有漏無漏、有為無為，不住亦不受報，但為度眾生故。何以故？是菩薩摩訶薩善達一切諸法相故。」#89.137
^89.2
#89.163
%85.0 壹、能善達法相，復起利他行#89.164
%85.1 （壹）明菩薩善達法相
%85.2 一、舉化人喻
%85.3 （一）如化人不行諸法
%85.4 1、須菩提問
須菩提白佛言：「世尊！云何菩薩善達諸法相？」#89.165
%85.5 2、佛答#89.166
佛告須菩提：「譬如化人不行婬、怒、癡，不行色乃至識，不行內、外法，不行諸煩惱結使，不行有漏法、無漏法，世間法、出世間法，有為法、無為法，亦無聖果；菩薩亦如是，無有是事，亦不分別是法，是名善#89.167達諸法相。」
%85.6 （二）如化人內無所修
須菩提言：「世尊！化人云何有修道？」#89.168
佛言：「化人修道，不垢不淨，亦不在五道生#89.169死。須菩提！於汝意云何？佛#89.170所化~2598人，有根本實事、有垢有淨不？」
須菩提言：「不也！佛所化人，無有根本實事，亦無垢#89.171無淨，亦不在五道生死。」
「如是，須菩提！菩薩摩@t25p688a訶薩善達諸法相，亦如是。」#89.172
%85.7 二、舉菩薩妙悟例萬法如化
%85.8 （一）正明一切法如化
須菩提言：「世尊！一切色如化不？一#89.173切受、想、行、識如化不？」
佛言：「一切色如化，一切受、想、行、識如化。」
%85.9 （二）以菩薩所見證成
「世尊！若一切色如化、一切受想行識如化、一切法如化，化人無色、無受想行識、無垢無淨、無五道生死亦無解脫處，菩薩有何等功用？」
佛告須菩提：「於汝意云何？菩薩摩訶薩本行菩薩道時，頗見有眾生從地獄、餓鬼、畜生、人、天#89.174中得解脫不？」
須菩提言#89.175：「不也！世尊！」
佛言：「如是！如是！須菩提！菩薩摩訶薩不見眾生從三界得解脫。何以故？菩薩摩訶薩見知一切法如幻、如化。」#89.176
%85.10 （貳）為益眾生故起行
%85.11 一、須菩提問
「世尊！若菩薩摩訶薩見知一切法如幻、如化，為何事故行六波羅蜜、四禪、四無量心、四無色定、三十七助道法，乃至行大慈大悲、淨佛國土、成就眾生？」
%85.12 二、佛答
佛告須菩提：「若眾生自知諸法如幻、如化，菩薩摩訶薩終不於阿僧祇劫為眾生行菩薩道。須菩提！以眾生自不知諸法如幻、如化，以是故，菩薩摩訶薩於無量阿僧祇劫~2599行六波羅蜜，成就眾生、淨佛國土，得阿耨多羅三藐三菩提。」
%85.13 貳、眾生住著名相虛妄分別中，菩薩以方便力令遠離
%85.14 （壹）略說
%85.15 一、須菩提問
須菩提白佛言：「世尊！若一切法如夢、如響#89.177、如影、如焰、如幻、如化，眾生在何處住，菩薩行六波羅蜜而拔出之？」
%85.16 二、佛答
「須菩提！眾生但住名相虛妄憶想分別中，是故菩薩行般若波羅蜜，於名相虛妄中拔出眾生。」#89.178
%85.17 （貳）別釋
%85.18 一、須菩提問
須菩提白佛言：「世尊！何等是名？何等是相？」
%85.19 二、佛答
%85.20 （一）釋「名」
%85.21 1、於諸法施設名稱
佛言#89.179：「此名強作假施設，所謂此色、此受想行識，#89.180此男、此女，此大、此小，此地獄、此畜生、此餓鬼，此人、此天，此有為、此無為，此須陀洹果、斯陀含果、阿那含果、阿羅漢果、辟支佛道，@t25p688b此佛道。
須菩提！一切和合法皆是假名，以名取諸法，是故為名。#89.181
%85.22 2、凡愚著於假名法，菩薩示空令其遠離
一切有#89.182為法但有名相，凡夫愚人於中生著。菩薩摩訶薩行般若波羅蜜，以方便力故，於名字中教令遠離，作是言：『諸眾生！是名但有空#89.183名，虛妄憶想#89.184分別中生，汝等莫著虛妄憶想！此事本末皆無，自性空故，智者所#89.185不著。』
如是，須菩提！菩薩摩訶薩行般若波羅蜜，以方便力故，為眾生說法。#89.186
~2600
%85.23 3、結
須菩提！是為名。
%85.24 （二）釋「相」
%85.25 1、凡愚著心取二相
何等為相？
須菩提！有二種相，凡夫人所著處。何等為二？一者、色相，二者、無色相。
須菩提！何等名『色相』？諸#89.187所有色，若麁若細、若好若醜，皆是空；是空法中憶想分別著心，是名為『色相』。#89.188
何等是『無色相』？諸無色法，憶想分別，著心取相故生煩惱，是名『無色相』。
%85.26 2、菩薩示無相令遠離
是菩薩摩訶薩行般若波羅蜜，以方便力故，教眾生遠離是相，著無相法中，令不墮二法，所謂是相、是無相。如是，須菩提！菩薩摩訶薩行般若波羅蜜，教化#89.189眾生遠離相，令住無相性中。」#89.190
%85.27 參、知諸法但有名相故，能得大利益
%85.28 （壹）論「若諸法但有名相，云何能自利利人」
%85.29 一、須菩提問
須菩提白佛言：「世尊！若一切法但有名相，云何菩薩行般若波羅蜜能自饒益，亦教他人令得善利？云何菩薩具足諸地，從一地至一地，教化眾生令得三乘？」
%85.30 二、佛答
%85.31 （一）反顯：若法定有，則無二利
佛告須菩提：「若諸法根本定#89.191有、非但名相者#89.192，菩薩行般若波羅蜜時，不能自益，~2601亦不能利益他人。#89.193
%85.32 （二）正明：諸法但名相故，方有二利
須菩提！諸法無有根本實事、但有名相，是故菩薩行般若波羅蜜時，能具足禪波羅蜜，無相故；毘梨耶波羅蜜、羼提波羅蜜、尸羅波羅蜜、檀波羅蜜，無相故；#89.194具足四禪波羅蜜、四無量心波羅蜜、四無色定波羅蜜，無相故；具@t25p688c足四念處波羅蜜，無相故；乃至具足八聖道分波羅蜜，無相故；具足內空波羅蜜，無相故；乃至具足無法有法空波羅蜜，無相故；足#89.195具八#89.196背捨波羅蜜，無相故；具足九次第定波羅蜜，無相故；具足佛十力波羅蜜，無#89.197相故；乃至具足十八不共法波羅蜜，無相故。
是菩薩，無相故，自具足是善#89.198法，亦教他人令具足善法，無相故。#89.199
%85.33 （三）引證：若諸法實有如毫釐許，則不能得菩提，亦不能化他
須菩提！若諸法相當實有如毫#89.200釐#89.201許者，菩薩摩訶薩行般若波羅蜜時，不能知諸法無相、無憶念得阿耨多羅三藐三菩提、亦教眾生令得無漏法。何以故？一切無漏法無相、無憶念故。
如是，須菩提！菩薩摩訶薩行般若波羅蜜，以無漏法利益眾生。」#89.202
%85.34 （貳）正以諸法無相故，分別有三乘道果
%85.35 一、須菩提問
須菩提白佛言：「世尊！若一切法無相、無憶念，云何數是聲聞法、是辟支佛法、是~2602菩薩法、是佛法？」#89.203
%85.36 二、佛答
%85.37 （一）以反問明三乘不異無相法
佛告須菩提：「於汝意云何？無相法與聲聞法異不？」
「不也！世尊#89.204！」
「無相法與辟支佛法、菩薩法、佛法異不？」
「不也！世尊！」
%85.38 （二）正明無相法即是三乘法
佛告須菩提：「無相法即是須陀洹果、斯陀含果、阿那含果、阿羅漢果、辟支佛法、菩薩法、佛法？」
須菩提言：「如是！世尊！」#89.205
%85.39 （三）結
「須菩提！以是因緣故，當知一切法皆是無相。#89.206
%85.40 肆、學一切法無相，能增益諸善法
%85.41 （壹）總明增益善法
%85.42 一、一切善法皆入三解脫門
須菩提！菩薩摩訶薩學是一切法無相，#89.207得增益善法，所謂六波羅蜜，四禪、四無量心、四無色定，四念處乃至十八不共法。何以故？菩薩不以餘法為要，如三解脫門，所謂空、無相、無作。所以者何？一切善法皆入三解脫門。何以故？一切法自相空，是名空解脫門；一切法無相，是名無相解脫門；一切法無作無起相，是名無作解脫門。#89.208
~2603
%85.43 二、學三解脫門即攝一切善法
若菩薩摩訶薩學三解@t25p689a脫門，是時能學五陰相，能學十二入相，能學十八界相，能學四聖諦、十二分因緣法，能學內空、外空乃至無法有法空，能學六波羅蜜、四念處乃至八聖道分，能學佛十力、四無所畏、四無礙智、十八不共法。」
%85.44 （貳）別論得無相則能通達一切法
%85.45 一、須菩提略問
須菩提白佛言：「世尊！云何菩薩摩訶薩行般若波羅蜜，能學五受陰相？」#89.209
%85.46 二、佛廣答
%85.47 （一）約「知五陰相、生滅、如」明
佛告須菩提：「菩薩行般若波羅蜜，知色相，知色生滅，知色如。#89.210
云何知色相？知色畢竟空，內分#89.211異、虛、無實，譬如水沫無堅固，是為知色相。#89.212
云何知色生滅？色生時無所從來、去無所至，若不來不去，是為知色生滅相。#89.213
云何知色如？是色如不生不滅、不來不去、不增不減#89.214、不垢不淨，是為#89.215知色如。須菩提！如名如實不虛，如前，後、中亦爾，常不異，是為知色如。#89.216
~2604云何知受相？云何知受生滅？云何知受如？
菩薩知諸受相#89.217如水中泡，一起一滅，是為知受相。#89.218
知受生滅者，是受無所從來、去無所至，是為知受生滅。
知受如者，是如不生不滅、不來不去、不增不減、不垢不淨，是為知#89.219受如。
云何知想相？云何知想生滅？云何知想如？
知想相者，是想如焰，水#89.220不可得，而妄生水想#89.221，是為知想相。#89.222
知想生滅者，是想無所從來，去無所至，是為知想生滅。
知想如者，諸想如不生不滅、不來不去、不增不減、不垢不淨，不轉於實相，是為知想如。
云何知行相？云何知行生滅？云何知行如？
知行相者，行如芭蕉，葉葉除却，不得堅實，是為知行相。#89.223
知行生滅者，諸行生無所從來，去無所至，是為知行生滅。
知行如者，諸行不生不滅、不來不去、不增不減、@t25p689b不垢不淨，是為知行如。
云何知識相？云何知識生滅？云何知識如？
知識相者，如幻師幻作四種兵，無有實，識亦如是#89.224。#89.225
   ~2605知識生滅者，是識生時無所從來，滅時無所去，是為知識生滅。
知識如者，知識不生不滅、不來不去、不垢不淨、不增不減，是為知識如。
%85.48 （二）約「知十二入、十八界空」明
云何知諸#89.226入？眼、眼性空，乃至意、意性空；色、色性空，乃至法、法性#89.227空。
云何知界？眼#89.228、眼界空，色、色界空，眼識、眼識界空；乃至意識界亦如是。
%85.49 （三）約「知四諦不二、四諦如」明
云何知四聖諦？
知苦聖諦時，遠離二法，知#89.229苦諦#89.230不二不別，是名苦聖諦。#89.231集、滅#89.232、道亦如是。
云何知苦如#89.233？苦聖諦即是如，如即#89.234是苦聖諦。集、滅、道亦如是。#89.235
%85.50 （四）約「知十二因緣不生相」明
云何知十二因緣？知十二因緣不生相，是名知十二因緣。」#89.236
%85.51 （參）雖分別諸法而不壞法性
%85.52 一、須菩提問
須菩提白佛言：「世尊！若菩薩摩訶薩行般若波羅蜜時，各各分別知諸法，將無以色性壞法性，乃至一切種智性壞法性耶？」#89.237
~2606
%85.53 二、佛答
佛告須菩提：「若法性外更有法者，應壞法性。法性外法不可得，是故不壞。
何以故？須菩提！佛及佛弟子知法性外法不可得故，不#89.238說法性外有法。
如是，須菩提！菩薩摩訶薩行般若波羅蜜，應學法性。」#89.239
%85.54 伍、若學法性即遍學一切法
須菩提白佛言：「世尊！菩薩摩訶薩若學法性，為無#89.240所學？」
佛告須菩提：「菩薩摩訶薩若#89.241學法性，則學一切法。何以故？一切法即是法性。」#89.242
須菩提白佛言：「世尊！何#89.243因緣故一切法即是法性？」
佛言：「一切法皆入無相無為性中，以是因緣故，學法性則學一切法。」#89.244
%85.55 陸、一切法雖即是法性，要須修行方能成就
%85.56 （壹）須菩提問
須菩提白佛言：「世尊！若一切法即是法性，菩薩摩訶薩何以學般若波羅蜜#89.245、禪波羅蜜、毘梨耶波羅蜜、@t25p689c羼提波羅蜜、尸羅波羅蜜、檀波羅蜜？
菩薩摩訶薩何以學初禪，第二、第三、第四禪？
菩薩摩訶薩何以學慈、悲、喜、捨？
何以學無邊虛空處、無邊識處、無所有處、非有想非無想處？
何以學四念處、四正勤、四如意足、五根、五力、七覺分、八聖道分？
何以學空、無相、無作解脫門？
~2607何以學八背捨、九次第定，佛十力、四無所畏、四無礙智、十八不共法？
何以學六神通？
何以學三十二相、八十隨形好？
何以學生剎利大姓、婆羅門大姓、居士大#89.246家？
何以學生四天王天處、三十三天、夜摩天、兜率陀天、化樂天、他化自在天？
何以學生梵天王住處、光音天、遍淨天、廣果天、無想定、淨居天？
何以學生無邊空處、生無邊識處、生無所有處、生非有想非無想處？#89.247
何以學初發意地，第二、第三、第四、第五、第六、第七、第八、第九、第十地#89.248？
何以#89.249學聲聞地、辟支佛地、菩薩法位？#89.250
何以學成就眾生、淨佛國土？
何以學諸陀羅尼？
何以學樂說法？
何以學阿耨多羅三藐三菩提，學已得一切種智、知一切法？
世尊！諸法法性中無是分別！世尊！將無菩薩墮非道中？何以故？世尊！法性中無如是分別。法性中無色，無受、想、行、識，諸法性亦不遠離色、受、想、行、識。色即是法性，法性即是色；受、想、行、識亦爾，#89.251一切法亦如是。」
%85.57 （貳）佛答
%85.58 一、雖分別諸法，而不壞法性
%85.59 （一）標宗
佛告須菩提：「如是！如是！如汝所言：『色即是法性，受、想、行、識即是法性。』須菩提！菩#89.252薩摩訶薩行般若波羅蜜時，若法性外見有法者，為不求阿耨多羅三藐三菩提。菩薩摩訶薩行般若波羅蜜時，知一切法性即是阿耨多羅三藐三@t25p690a菩提；以是故，菩薩摩訶薩行般若波羅蜜時，知一切法即是法性已，以無名相之法以名相#89.253說，所謂是色，是受、想、行、識，乃至是阿耨多羅三藐三菩提。#89.254
~2608
%85.60 （二）舉喻明理
須菩提！譬如工幻師、若幻師#89.255弟子，多人處立，幻作種種形色──男、女，象、馬，端嚴園林，及諸廬#89.256館#89.257、流泉#89.258、浴池、衣服、臥具、香華、瓔珞、餚饍、飲食，作眾伎樂，以樂眾人。
又復幻作人，令布施、持戒、忍辱、精進、禪定、修智慧。
是幻師復幻作剎利大姓、婆羅門大姓、居士大家，四天王天處、須彌山三十三天、夜摩天、兜率陀天、化樂天、他化自在天以示眾人，復幻作梵眾天乃至非有想非無想天，復#89.259幻作須陀洹、斯陀含、阿那含、阿羅漢、辟支佛。
菩薩摩訶薩從初發意行檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜，行初地乃至行十地，入菩薩位，遊戲神通，成就眾生，淨佛國土，遊戲諸禪、解脫、三昧，行佛十力、四無所畏、四無礙智、十八不共法、大慈大悲，具足佛身三十二相、八十隨形好，以示眾人。#89.260
是中無智之人歎：『未曾有！是人多能，巧為眾事，娛#89.261樂眾人，種種形色，乃至三十二相、八十隨形好莊嚴佛身。』
其中有智之士思惟言：『未曾有也！是中無有實事，而以無所有法娛樂眾人，令有形相，無事事相，無有有相』。#89.262
~2609
%85.61 二、以方便力知眾生空、法空而廣修自利利他行
如是，須菩提！菩薩摩訶薩不見離法性有法，行般若波羅蜜，以方便力故，雖不得眾生，而自布施，亦教人布#89.263施，讚歎布#89.264施法，歡喜讚歎行布施者；自持戒，亦教人持戒......；自忍辱，亦教人忍辱......；自精進，亦教人精進......；自行禪，亦教人行禪......；自@t25p690b修智慧，亦教人修智慧，讚歎修智慧法，歡#89.265喜讚歎修智慧者。
自行十善，亦教人#89.266行十善，讚歎行十善法，歡喜讚歎行十善者。
自受行五戒，亦教他人受行五戒#89.267，讚歎五戒法，歡喜讚歎受行五戒者。
自受八戒齋，亦教他人受八戒齋，讚歎八戒齋法，歡喜讚歎行八戒齋者。
自行初禪，乃至自行第四禪。......
自行慈、悲、喜、捨。......
自行無邊空處乃至非有想非無想處，亦教他人行。......
自行四念處乃至八聖道分。......
自行三解脫門，佛十力，......乃至自行十八不共法，亦教他人行十八不共法，讚歎十八不共法，歡喜讚歎行十八不共法者。
%85.62 三、法性本常空，前中後無異故，菩薩行般若能成滿二利行
須菩提！若法性前、後、中有異者，是菩薩摩訶薩不能以方便力示法性、成就眾生。
須菩提！以法性前、後、中無異，是故是#89.268菩薩#89.269行般若波羅蜜，為利益眾生故#89.270，行菩薩道。」#89.271
^90.1
%86.0 壹、為安立眾生令住於實際故行般若#90.1
%86.1 （壹）眾生雖畢竟空，而菩薩為實際故行般若
%86.2 一、須菩提難
須菩提白佛言：「世尊！若眾生畢竟不可得，菩薩為誰故行般若波羅蜜？」
%86.3 二、佛答
%86.4 （一）菩薩為實際故行般若
佛告須菩提：「菩薩為實際故行般若波羅蜜。
%86.5 （二）實際、眾生際不異故，為利益眾生行般若
須菩提！實際、眾生際異者，菩薩不行般若波羅蜜。
須菩提！實際、眾生際不異，以是故，菩薩摩訶薩為利益眾生故行般若波羅蜜。
%86.6 （三）令眾生住實際中，而不壞實際
復次，須菩提！菩薩摩訶薩行般若波羅蜜時，以不壞實際法，立眾生於實際中。」
%86.7 （貳）以方便力安立眾生於實際，而眾生際、實際不一、不異
%86.8 一、須菩提難：若眾生際、實際不異，云何安立實際令住於實際
須菩提白佛言：「世尊！若實際即是眾生際，菩薩則為建立實際於實際。
世尊！若建立實際於實際，則為建立自性於自性。
世尊！不得建立自性於自性。
世尊！云何菩薩摩訶薩行般若波羅蜜時，建立眾生於實際？」#90.2
%86.9 二、佛答
佛告須菩提：「實際不可建立於實際，自性不可建立於自性。
須菩提！今菩薩摩訶薩行般若波羅蜜時，以方便力故，建立眾@t25p693a生於實際；實~2619際亦不異眾生際，實際、眾生際無二無別。」#90.3
%86.10 貳、廣明菩薩建立之法#90.4
%86.11 （壹）就因行明令住六度
%86.12 一、須菩提問
須菩提白佛言：「世尊！何等是諸菩薩摩訶薩方便力？用是方便力，菩薩摩訶薩行般若波羅蜜時，建立眾生於實際，亦不壞實際相？」
%86.13 二、佛答
%86.14 （一）令住布施
%86.15 1、教布施，說空令離著
佛告須菩提：「若菩薩摩訶薩行般若波羅蜜時，以方便力故，建立眾生於布施。
建立已，說布施先後際相#90.5，作是言：『如是布施，前際空、後際空、中際亦空，施者亦空、施報亦空、受者亦空。
%86.16 2、不念不著，得甘露果
諸善男子！是一切法實際中不可得，汝等莫念布施異、施者異、施報異、受者異。
若汝等不念布施異、施者異、施報異、受者異，是時，布施能取甘露味、得甘露味果。#90.6
%86.17 3、諸法自性空故不著一切法
汝善男子！以是布施故，莫著色，莫著受、想、行、識。
何以故？是布施、布施相空，施者、施者空，施報、施報空，受者、受者空，空中布施不可得、施者不可得、施報不可得、受者不可得。
何以故？是諸法畢竟自性空故。』
%86.18 （二）令住持戒
%86.19 1、教捨十惡，知諸法無自性
復次，須菩提！菩薩摩訶薩行般若波羅蜜時，以方便力故，教眾生持戒；語眾生言：『汝善男子！除捨殺生法，乃至除捨邪見#90.7。
~2620何以故？善男子！如汝所分別法，是諸法無如是性。#90.8
汝善男子當諦思惟：何等是眾生而欲奪命？用何等物奪命？乃至邪見亦如是。』
須菩提！菩薩摩訶薩如是方便力成就眾生。
%86.20 2、說空離著入涅槃
是菩薩摩訶薩即為眾生說布施、持戒果報，是布施、持戒果報自性空；知布施、持戒果報自性空已，是中不著；不著故心不散，能生智慧；以是智慧斷一切結使煩惱#90.9，入無餘涅槃。
%86.21 3、依世俗說得涅槃，不依勝義
是世俗法，非第一實義。何以故？空中無有滅、亦無使滅者。
諸法畢竟空，即是涅槃。#90.10@t25p693b
%86.22 （三）令住忍辱
%86.23 1、明教法
%86.24 （1）教修忍辱除瞋恚
復次，須菩提！菩薩摩訶薩見眾生瞋恚惱心，教言：『汝善男子！來修行忍辱，作忍辱人，當樂忍辱。
%86.25 （2）說空離著知性空
汝所瞋者自性空故。
汝來！善男子！如是思惟：「我於何所法中瞋？誰為瞋者？所瞋者誰？」是法皆空，是性空法無不空時。#90.11是空非諸佛作，非辟支佛、聲聞作，非菩薩摩訶薩作，非諸天、鬼神、龍王、阿修羅、緊那羅、摩睺羅伽，非四天王天乃至非他化自在天、非梵眾天乃至非淨居天、非無邊空處乃至非有想非無想處諸天所作。
汝當如是思惟：「所瞋誰？誰是瞋者？何等是瞋事？」是一切法性空，性空法中無有所瞋。』#90.12
%86.26 （3）次第示導令得無上菩提
如是，須菩提！菩薩摩訶薩行般若波羅蜜時，以是因緣，建立眾生於性空，次第漸漸示、教、利、喜，令得阿耨多羅三藐三菩提。
~2621
%86.27 （4）依世俗說得菩提，不依勝義
是世俗法，非第一實義。何以故？是性空中無有得者、無有得法、無有得處。
%86.28 2、為利益眾生行般若，而眾生不可得
須菩提！是名實際性空法。
菩薩摩訶薩為眾生故行是法，眾生亦不可得。何以故？一切法離眾生相。#90.13
%86.29 （四）令住精進
%86.30 1、教身精進、心精進令滅惡生善
復次，須菩提！菩薩摩訶薩行般若波羅蜜時，方便力故，見眾生懈怠，教令身精進、心精進；作是言：『諸善男子！諸法性空中無懈怠法、無懈怠者、無懈怠事；是一切法性皆空，無過性空者。
汝等生身精進、心精進，為生善法故，莫懈怠！善男子#90.14！若布施、若持戒、若忍辱、若精進、若禪定、若智慧，若諸禪定、解脫、三昧，若四念處乃至八聖道分，若空解脫門，無相、無作解脫門，乃至十八不共法中，莫懈怠！#90.15
%86.31 2、說空令離著
諸善男子！是一切法性空中，當知無礙相，無礙法中無懈怠者、無懈怠法。』
如是，須菩提！菩薩摩@t25p693c訶薩行般若波羅蜜時，教眾生令住性空，不墮二法。
何以故？是性空無二無別故，是無二法則無可著#90.16處。#90.17
~2622
%86.32 3、教眾生無分別
復次，須菩提！菩薩摩訶薩行性空般若波羅蜜時，教眾生令精進，作是言：『諸善男子！勤精進，若布施、若持戒、若忍辱、若精進、若禪定、若智慧，若禪定、解脫、三昧，若四念處乃至八聖道分，若空解脫門，無相、無作解脫門，若佛十力、若四無所畏、若四無礙智、若十八不共法、若大慈大悲。是諸法，汝等莫念二相、莫念不二相。
何以故？是法性皆空，是性空法不應用二相念、不應用不二相念。』
%86.33 4、以方便力成就眾生令得聖果
如是，須菩提！菩薩摩訶薩行般若波羅蜜，以方便力故，成就眾生。成就眾生已，次第教令得須陀洹果、斯陀含果、阿那含果、阿羅漢果、辟支佛道，入#90.18菩薩位，令得阿耨多羅三藐三菩提。
%86.34 （五）令住禪定
%86.35 1、明教法
%86.36 （1）教修禪定除亂心
復次，須菩提！菩薩摩訶薩行般若波羅蜜時，見眾生亂心，以方便力，為利益眾生故，作是言：『諸善男子！當修禪定！汝莫生亂想，當生一心。#90.19
%86.37 （2）說空離著不分別
何以故？是法性皆空，性空中無有法可得若亂、若一心。#90.20
~2623
%86.38 （3）行性空故，隨所願而得道果
汝等住是三昧，所有作業若身、若口、若意，若布施、若持戒、若行忍辱、若勤精進、若行禪定、若修智慧，若行四念處乃至若行八聖道分，若諸解脫#90.21、次第定，若行佛十力、四無所畏、四無礙智、十八不共法、大慈大悲、三十二相、八十隨形好，若聲聞道、若辟支佛道、若菩薩道、若佛道，若須陀洹果、斯陀含果、阿那含果、阿羅漢果、辟支佛道、若一切種智，若成就眾生、若淨佛國土，汝等皆當應隨所願得；行#90.22性空故。』
%86.39 2、明教利益
如是，須菩提！若菩薩摩@t25p694a訶薩行般若波羅蜜方便力，為利益眾生故，從初發意，終不懈廢，常求善法，利益眾生；從一佛國至一佛國，供養諸佛，從諸佛聞法，捨身、受身，乃至阿耨多羅三藐三菩提，終不忘失。
是菩薩常得諸陀羅尼，諸根具足，所謂身根、語根、意根。
何以故？是菩薩摩訶薩常修一切種智；修一切種智故，一切諸道皆修──若聲聞道、若辟支佛道、若菩薩神通道；行神通道菩薩，常利益眾生，終不忘失。
是菩薩住報得神通，利益眾生，入生死五道，終不耗減。
%86.40 3、結
如是，須菩提！菩薩摩訶薩行般若波羅蜜住性空，以禪定利益眾生。
%86.41 （六）令住般若
%86.42 1、正教般若
%86.43 （1）明教法
%86.44 A、教觀法性空
復次，須菩提！菩薩摩訶薩行般若波羅蜜，住性空，以方便力故，利益眾生，作是言：『汝等諸善男子！觀一切法性空！
%86.45 B、趣甘露味果
善男子！汝等當作諸業──若身業、若口業、若意業，取甘露味，得甘露果。#90.23
%86.46 C、性空中無有退
性空中無有法退。何以故？性空不退，亦無退者；以性空非法亦非非法，於無所有法中，云何當有退？』#90.24
~2624
%86.47 （2）歎勤修不懈廢
須菩提！菩薩摩訶薩行般若波羅蜜時，如是教眾生常不懈廢。
%86.48 2、別攝萬行
%86.49 （1）明自行化他
是菩薩自行十善，亦教他人行十善；五戒、八戒亦如是。
自行初禪，亦教他人令行初禪；乃至第四禪亦如是。
常自行慈心，亦教他人令行慈心；乃至捨心亦如是。
自行無邊空處，亦教他人令行無邊空處；乃至非有想非無想處亦如是。
自行四念處，亦教他人令行四念處；乃至八聖道分，佛十力乃至八十隨形好亦如是。
自於須陀洹果中生智慧，亦不住是中，亦教他人令得須陀洹果；乃至阿羅漢果亦如是。
自於辟支佛道中生@t25p694b智慧，亦不住是中，亦教他人令得辟支佛道。
自生阿耨多羅三藐三菩提道，亦教他人令得阿耨多羅三藐三菩提道。
%86.50 （2）歎能精進行
如是，須菩提！菩薩摩訶薩行般若波羅蜜方便力故，終不懈怠。」
%86.51 （貳）就果德明令住一切種智#90.25
%86.52 一、令於一切種智得實觀照
%86.53 （一）諸法雖空，不妨行因得果
%86.54 1、須菩提問
須菩提白佛言：「世尊！若諸法性常空，常空中眾生不可得，法、非法亦不可得，菩薩摩訶薩云何求一切種智？」
%86.55 2、佛答
%86.56 （1）標宗
%86.57 A、由性空故，自成菩提，亦為眾生說性空法
%86.58 （A）明有不可得，一切法性空
佛告須菩提：「如是！如是！如汝所言：『諸法性皆空，空中眾生不可得，法、非法亦不可得。』
須菩提！若一切法性不空，菩薩摩訶薩不依性空成阿耨多羅三藐三菩提、為眾生說性空法。#90.26
~2625須菩提！色性空，受、想、行、識性空；菩薩摩訶薩行般若波羅蜜時，說五陰性空法，說十二入、十八界性空法；說四禪、四無量心、四無色定、四念處乃至八聖道分性空法；說三解脫門、八背捨、九次第定、佛十力、四無所畏、四無礙智、十八不共法、大慈大悲、三十二相、八十隨形好性空法；說須陀洹果、斯陀含果、阿那含果、阿羅漢果、辟支佛道，一切種智斷煩惱習性空法。
%86.59 （B）明空亦不可得，空亦復自空
須菩提！若內空性不空、外空乃至無法有法空性不空者，則壞空性。
是性空不常不斷。何以故？是性空無住處，亦無所從來，亦無所從去。
須菩提！是名u法住相u。
是中無法，無聚無散、無增無減、無生無滅、無垢無淨，是為諸法相。#90.27
%86.60 B、見一切法性空故，於菩提得不退轉
菩薩摩訶薩住#90.28是中發阿耨多羅三藐三菩提心，不見法有所發，無發無住，是名法住相。#90.29
是菩薩摩訶薩行般若波羅蜜時，見一切法性空，不轉阿耨多羅三藐三菩提。何以故？是菩薩不見有法能障礙，當何處生疑？是名阿耨多羅三藐@t25p694c三菩提。#90.30
%86.61 （2）釋因：由悟性空故，能化眾生，除諸顛倒
%86.62 A、法說：明性空無所有
性空不得眾生、不得我、不得人、不得壽、不得命，乃至不得知者、見者；性空中色不可得，受、想、行、識不可得，乃至八十隨形好不可得。
%86.63 B、譬說：如佛作化人為眾生說法
須菩提！譬如佛化作四眾：比丘、比丘尼、優婆塞、優婆夷，常為是諸眾說法，千萬億劫不斷。」
~2626佛告須菩提：「是諸化眾，當得須陀洹果、斯陀含果、阿那含果、阿羅漢果，得阿耨多羅三藐三菩提記不？」
須菩提言：「不也！世尊！何以故？是諸化眾無有根本實事#90.31故。一切諸法性空，亦無根本實事，何等是眾生得須陀洹果乃至阿羅漢果、得阿耨多羅三藐三菩提記？」
%86.64 C、合說
%86.65 （A）正明拔眾生顛倒
「須菩提！菩薩摩訶薩亦如是，為眾生說性空法，是眾生實不可得，以眾生墮顛倒故，拔眾生令住不顛倒。#90.32
%86.66 （B）顛倒與不顛倒雖一相，而顛倒多、不顛倒少
顛倒即是無顛倒；顛倒、不顛倒雖一相，而多顛倒、少不顛倒。#90.33
%86.67 （C）無顛倒中無眾生、無諸法
無顛倒處中，則無我、無眾生，乃至無知者、見者；無顛倒處中，亦無色，無受、想、行、識，無十二入，乃至無阿耨多羅三藐三菩提──是為諸法性空。
%86.68 （D）以性空破顛倒想
菩薩摩訶薩住是中，行般若波羅蜜時，於眾生相顛倒中拔出眾生，所謂無眾生有眾生相中拔出，乃至知者、見者相中拔出。於無色色相中、無受想行識受想行識相中拔出眾生。#90.34十二入、十八界乃至一切有漏法亦如是。
%86.69 （二）由性空故，自證佛果，巧便化他
%86.70 1、菩薩為性空故求菩提，前中後際本常空
須菩提！亦有諸無漏法，所謂四念處、四正勤、四如意足、五根、五力、七覺分、八聖道分；如是等法，雖無漏，亦不如第一義相。
第一義相者，無作、無為、無生、無相、無說，是名第一義，亦名性空，亦名諸佛道。#90.35
~2627是中不得眾生，乃至不得知者、見者；不得色、受、想、行、識，乃至不得八十隨@t25p695a形好。
何以故？菩薩摩訶薩非為道法故求阿耨多羅三藐三菩提心，為諸法實相性空故求阿耨多羅三藐三菩提。#90.36
是性空，前際亦是性空，後際亦是性空，中際亦是性空；常性空，無不性空時。
%86.71 2、歎性空能成化他行
菩薩摩訶薩行是性空般若波羅蜜，為眾生著眾生相欲拔出故，求道種智。求道種智時，遍行一切道──若聲聞道、若辟支佛道、若菩薩道。
是菩薩具足一切道，拔出眾生於邪想著，淨佛國土已，隨其壽命，得阿耨多羅三藐三菩提。#90.37
%86.72 3、由悟性空故得道果
%86.73 （1）正明
須菩提！過去十方諸佛道性空，未來、現在十方諸佛道亦性空；離性空，世間無道、無道果。要從親近諸佛，聞是諸法性空，行是法，不失薩婆若。」#90.38
%86.74 （2）歎述
%86.75 A、須菩提領解稱歎
須菩提白佛言：「世尊！甚希有！諸菩薩摩訶薩行是性空法，亦不壞性空相──所謂色與性空異，受、想、行、識與性空異，#90.39乃至阿耨多羅三藐三菩提與性空異。
世尊！但色即是性空，性空即是色；乃至阿耨多羅三藐三菩提，阿耨多羅三藐三菩提即是性空，性空即是阿耨多羅三藐三菩提。」#90.40
~2628
%86.76 B、佛釋：知諸法本空，不壞諸法相
%86.77 （A）法
佛告須菩提：「如是！如是！若色與性空異，若受、想、行、識與性空異，乃至阿耨多羅三藐三菩提與性空異，菩薩摩訶薩不能得一切種智。
須菩提！今色不異性空，乃至阿耨多羅三藐三菩提不異性空；以是故，菩薩摩訶薩知一切法性空，發意求阿耨多羅三藐三菩提。何以故？是中無有法若實、若常，但凡夫著色、受、想、行、識。
凡夫取色相，取受、想、行、識相；有我心著內外物故，受後身色、受、想、行、識，是故不得脫生老病死愁憂苦惱，往來五@t25p695b道。
以是事故，菩薩摩訶薩行性空波羅蜜，不壞色等諸法相若空、若不空。何以故？是色性空相不壞色，所謂是色、是空。#90.41
%86.78 （B）譬
譬如虛空不壞虛空，內虛空不壞外虛空，外虛空不壞內虛空。
%86.79 （C）合
如是，須菩提！色不壞色空相，色空相不壞色。何以故？是二法無有性能有所壞，所謂是空、是非空。#90.42
乃至阿耨多羅三藐三菩提亦如是。」
%86.80 二、雖諸法性空無別，而菩薩離分別取捨，具足萬行得菩提#90.43
%86.81 （一）歎菩提寂滅，離分別取捨
%86.82 1、正述歎
%86.83 （1）須菩提問
須菩提白佛言：「世尊！若一切法空無分別，云何菩薩摩訶薩從初發意已來作是願『我當得阿耨多羅三藐三菩提』？世尊！若一切法無分別，云何菩薩發心言『我當得阿耨多羅三藐三菩提』？
世尊！若分別諸法，不能得阿耨多羅三藐三菩提。」
%86.84 （2）佛答：分別取二相者不得菩提，不二、不分別者能得
佛告須菩提：「如是！如是！若菩薩摩訶薩行二相者，無阿耨多羅三藐三菩提；若分別作二分者，無阿耨多羅三藐三菩提。若不二、不分別諸法，則是阿耨多羅三~2629藐三菩提。
菩提是不二相、不壞相。
須菩提！是菩提不色中行，不受、想、行、識中行，乃至菩提亦不菩提中行。
何以故？色即是菩提、菩提即是色，不二、不分別；乃至十八不共法亦如是。
是菩提非取故行、非捨故行。」#90.44
%86.85 2、舉喻釋疑
%86.86 （1）化人喻
須菩提白佛言：「世尊！若菩薩摩訶薩菩提非取故行、非捨故行，菩薩摩訶薩菩提何處行？」
佛告須菩提：「於汝意云何？如佛所化人在何處行──若取中行？若捨中行？」
須菩提言：「世尊！非取中行，非捨中行。」
佛言：「菩薩摩訶薩菩提亦如是，非取中行、非捨中行。
%86.87 （2）阿羅漢夢喻
須菩提！於汝意云何？阿羅漢夢中菩提何處行──若取中行？若捨中行？」
「不也！世尊！非取中行、非捨中行。世@t25p695c尊！阿羅漢畢竟不眠，云何夢中菩提若取中行、若捨中行？」#90.45
「須菩提！菩薩摩訶薩阿耨多羅三藐三菩提亦如是，非取中行、非捨中行，所謂色中行乃至一切種智中行。」
%86.88 （二）菩提雖寂滅，須具萬行乃得
%86.89 1、須菩提問
「世尊！將無菩薩摩訶薩不行十地，不行六波羅蜜，不行三十七助道法，不行十四空，不行諸禪定、解脫、三昧，不行佛十力乃至八十隨形好、住五神通、淨佛國土、成就眾生，得阿耨多羅三藐三菩提？」
%86.90 2、佛答
%86.91 （1）具足萬行乃得菩提，知諸法常空寂
佛告須菩提：「如是！如是！如汝所言。今菩薩雖菩提無處行，若不具足十地，六波羅蜜，四禪、四無量心、四無色定，四念處乃至八聖道分，空、無相、無作解脫，佛十力乃至八十隨形好、常捨法、不錯謬法──不具足是諸法，終不得阿耨~2630多羅三藐三菩提。
是菩薩摩訶薩住色相中，住受、想、行、識相中，乃至住阿耨多羅三藐三菩提相中，能具足十地，乃至得阿耨多羅三藐三菩提。是相常寂滅，無有法能增能減、能生能滅、能垢能淨、能得道、能得果。#90.46
%86.92 （2）依世諦故說得菩提，非第一義
世諦法故，菩薩摩訶薩得阿耨多羅三藐三菩提，非第一實義。
何以故？第一實義中，無有色乃至無有阿耨多羅三藐三菩提，亦無行阿耨多羅三藐三菩提者。是一切法，皆以世諦故說，非第一義。
須菩提！菩薩摩訶薩從初發意已來，行阿耨多羅三藐三菩提，菩提亦不增、眾生亦不減，菩薩亦無增減。
%86.93 （3）以須菩提所證聲聞道，例證佛菩提
%86.94 A、反問成
須菩提！於意云何：若人初得道時，住無間三昧，得無漏根，若成就須陀洹果、斯陀含果、阿那含果、阿羅漢果，汝爾時有所得若夢、若心、若道、若道果不？」
須菩提言：「世尊！不@t25p696a得也！」#90.47
佛告須菩提：「云何當知得阿羅漢道者？」
「世尊！世諦法故分別名阿羅漢道。」#90.48
%86.95 B、正述成
佛語須菩提：「世諦故說名菩薩，說名色、受、想、行、識乃至一切種智。是菩提中無法可得若增、若減，以諸法性空故。
諸法性空尚不可得，何況得初地心乃至十地心、六波羅蜜、三十七助道法、空三昧、無相、無作三昧乃至一切佛法當有所得，無有是處！
如是，須菩提！菩薩摩訶薩行阿耨多羅三藐三菩提，得阿耨多羅三藐三菩提，利益眾生。」#90.49
^91.1
%87.0 壹、以方便力故具足菩薩道，能得佛道、度眾生#91.1
%87.1 （壹）明以方便力行菩薩道而得佛果
%87.2 一、須菩提問
須菩提白佛言：「世尊！若菩薩摩訶薩行六波羅蜜、十八空、三十七助道法、佛十力、四無所畏、四無礙智、十八不共法，不具足菩薩道，不能得阿耨多羅三藐三菩提。
世尊！菩薩摩訶薩當云何具足菩薩道，能得阿耨多羅三藐三菩提？」
%87.3 二、佛答
%87.4 （一）舉布施度明方便行，不得三事亦不離三事
佛告須菩提：「若菩薩摩訶薩行般若波羅蜜時，以方便力故，行檀波羅蜜，不得施、不得施者、不得受者，亦不遠離是法行檀波羅蜜，是則照明菩薩道。#91.2
如是，須菩提！菩薩以方便力故具足菩薩道；具足已，能得阿耨多羅三藐三菩提。
%87.5 （二）例餘
   持戒、忍辱、精進、禪定、智慧，乃至十八不共法亦如是。」
%87.6 （貳）以方便力學般若無取著得無上菩提
%87.7 一、習般若之法
%87.8 （一）舍利弗問
舍利弗白佛言：「世尊！云何菩薩摩訶薩習般若波羅蜜？」
%87.9 （二）佛答：諸法性無故，不壞法、不隨法
佛告舍利弗：「若菩薩摩訶薩行般若波羅蜜，以方便力故，不壞色、不隨色。
何以故？是色性無故不壞、不隨，乃至識亦如是。
~2645舍利弗！菩薩摩訶薩行般若波羅蜜，以方便力故，檀波羅蜜不壞、不隨。何以故？檀波羅蜜性無故。乃至十八不共法亦如是。」#91.3
%87.10 二、由習般若得無上菩提#91.4
%87.11 （一）舍利弗問
舍利弗白佛言：「世尊！若諸法無自性可壞、可隨者，云何菩薩摩訶薩能習#91.5般若波羅蜜諸菩薩摩訶薩所學處？#91.6何以故？菩薩摩訶薩不學般若波羅蜜，不能得阿耨多羅三藐三菩提。」
%87.12 （二）佛答
%87.13 1、要有方便力方可證得
佛告舍利弗：「如汝所言：『菩@t25p700a薩不學般若波羅蜜，不能得阿耨多羅三藐三菩提。』不離方便力故可得。#91.7
%87.14 2、諸法皆不可得故不應取
舍利弗！若菩薩摩訶薩行般若波羅蜜，若有一法可得，應當取；若不可得，何所取？所謂此是般若波羅蜜、是禪波羅蜜、是毘梨耶波羅蜜、是羼提波羅蜜、是尸羅波羅蜜、是檀波羅蜜，#91.8是色、受、想、行、識，乃至是阿耨多羅三藐三菩提。
舍利弗！是般若波羅蜜不可取相，乃至一切諸佛法不可取相。
舍利弗！是名不取般若波羅蜜乃至佛法，是菩薩摩訶薩所應學。
~2646
%87.15 3、諸法無性故不可得
菩薩摩訶薩於是中學時，學相亦不可得，何況般若波羅蜜、佛法、菩薩法、辟支佛法、聲聞法、凡夫人法！何以故？舍利弗！諸法無一法有性。#91.9
如是無性諸法，何等是凡夫人、須陀洹、斯陀含、阿那含、阿羅漢、辟支佛、菩薩、佛？
若無是諸賢聖，云何有法？以是法故，分別說是凡夫人、須陀洹、斯陀含、阿那含、阿羅漢、辟支佛、菩薩、佛？」
%87.16 三、論「諸法無性，云何分別凡夫乃至佛」
%87.17 （一）舍利弗問
舍利弗白佛言：「世尊！若諸法無性、無實、無根、無本，云何知是凡夫人乃至是佛？」#91.10
%87.18 （二）佛答
%87.19 1、明凡夫顛倒著相
佛告舍利弗：「凡夫人所著處色，有性、有實不？」
「不也！世尊！但以顛倒心故。受、想、行、識，乃至十八不共法亦如是。」#91.11
%87.20 2、明菩薩見法無性而能發菩提心
「舍利弗！菩薩摩訶薩行般若波羅蜜時，以方便力故，見諸法無性、無根本故，能發阿耨多羅三藐三菩提心。」
%87.21 四、知諸法性空無根本可住故不退懈
舍利弗白佛言：「云何菩薩摩訶薩行般若波羅蜜時，以方便力故，見諸法無性、無根本故，發阿耨多羅三藐三菩提心？」#91.12
佛告舍利弗：「菩薩摩訶薩行般若波羅蜜時，不見諸法根本住中#91.13退沒、生懈怠心。#91.14
~2647舍利弗！諸法根本實無我、無所有、@t25p700b性常空；但顛倒愚癡故，眾生著陰、入、界。
%87.22 （參）以般若成就故，能度眾生而無所度#91.15
%87.23 一、以方便力為眾生說法
%87.24 （一）方便說法
%87.25 1、為說世間善法
是菩薩摩訶薩見諸法無所有、性常空、自性#91.16空時，行般若波羅蜜，自立如幻師，為眾生說法#91.17──慳者為說布施法，破戒者為說持戒法，瞋者為說忍辱法，懈怠者為說精進法，亂想者為說禪定法，愚癡者為說智慧法。
%87.26 2、為說出世法
令眾生住布施乃至智慧，然後為說聖法能出苦；用是法故，得須陀洹果乃至得阿羅漢果、辟支佛道，乃至得阿耨多羅三藐三菩提。」#91.18
%87.27 （二）無有所得之過失
舍利弗白佛言：「世尊！菩薩摩訶薩得是眾生無所有，教令布施、持戒乃至智慧，然後為說聖法能出苦；以是法故，得須陀洹果乃至阿耨多羅三藐三菩提？」#91.19
佛告舍利弗：「菩薩摩訶薩行般若波羅蜜時，無有所得過罪。何以故？舍利弗！是菩薩摩訶薩行般若波羅蜜時不得眾生，但空法相續故名為眾生。#91.20
%87.28 （三）安住二諦中，以方便力為眾生說法
舍利弗！菩薩摩訶薩住二諦中為眾生說法：世諦、第一義諦。
舍利弗！二諦中眾生雖不可得，菩薩摩訶薩行般若波羅蜜，以方便力故，為眾生說法。眾生聞是法，今世吾我尚不可得，何況當得阿耨多羅三藐三菩提及所用法！
~2648如是，舍利弗！菩薩摩訶薩行般若波羅蜜時，以方便力故，為眾生說法。」#91.21
%87.29 二、舍利弗稱歎菩薩心曠大
舍利弗白佛言：「世尊！是菩薩摩訶薩心曠#91.22大！無有法可得若一相、若異相、若別相，而能如是大誓莊嚴。用是莊嚴故，不生欲界、不生色界、不生無色界，不見有為性#91.23、不見無為性，而於三界中度脫眾生，亦不得眾生。
何以故？眾生不縛不解；眾生不縛不解故，無垢無淨；無垢無淨故，無@t25p700c分別五#91.24道；無分別五道故，無業無煩惱；無業無煩惱故，亦不應有果報──以是果報故生三界中。」#91.25
%87.30 三、佛答
%87.31 （一）標宗
%87.32 1、舉失
佛告舍利弗：「如是！如是！如汝所言。若眾生先有後無，諸佛、菩薩則有過罪。諸法五道生死亦如是，若先有後無，諸佛、菩薩則有過罪。
%87.33 2、顯得
舍利弗！今有佛、無佛，諸法相常住不異，是法相中尚無我、無眾生、無壽命，乃至無知者、無見者，何況當有色、受、想、行、識！若無是法，云何當有五道往來，拔出眾生處？
舍利弗！是諸法性常空，以是故，諸菩薩摩訶薩從過去佛聞是法相，發阿耨多羅三藐三菩提意。是中無有法我當得，亦無有眾生定著處法不可出，但以眾生顛倒故著。#91.26
以是故，菩薩摩訶薩發大誓#91.27莊嚴，常不退阿耨多羅三藐三菩提。是菩薩不疑：『我~2649當不得阿耨多羅三藐三菩提？』我必當得阿耨多羅三藐三菩提，得阿耨多羅三藐三菩提已，用實法利益眾生，令出顛倒。
%87.34 （二）舉喻合法
舍利弗！譬如幻師幻作百千萬億人，與種種飲食令飽滿，歡喜唱言：『我得大福！我得大福！』於汝意云何？是中有人食飲飽滿不？」
「不也！世尊！」
佛言：「如是！舍利弗！菩薩摩訶薩從初發意已#91.28來，行六波羅蜜、四禪、四無量心、四無色定、四念處乃至八聖道分、十四空#91.29、三解脫門、八背捨#91.30、九次第定、佛十力乃至十八不共法，具足菩薩道，成就眾生、淨佛國土，無眾生法可度。#91.31」
%87.35 貳、明二種要行：成就眾生，淨佛國土#91.32
%87.36 （壹）略明
須菩提白佛言：「世尊！何等是菩薩摩訶薩道？菩薩行是道，能成就眾生、淨佛國土？」
佛告須菩提：「菩薩摩訶薩從初發意已來，行檀波羅蜜，行尸羅、羼@t25p701a提、毘梨耶、禪、般若波羅蜜，乃至行十八不共法，成就眾生、淨佛國土。」#91.33
%87.37 （貳）廣明
%87.38 一、成就眾生
%87.39 （一）正明成就眾生
%87.40 1、別約六度廣化眾生
%87.41 （1）行施度成就眾生
~2650
%87.42 A、須菩提問
須菩提白佛#91.34言：「世尊！云何菩薩摩訶薩行檀波羅蜜成就眾生？」
%87.43 B、佛答
%87.44 （A）教眾生行布施且莫著布施，令得聖果
佛告須菩提：「有菩薩摩訶薩行檀波羅蜜時，自布施，亦教眾生布施，作是言：『諸善男子！汝等莫著布施！汝著布施故當更受身，受#91.35身故多受眾苦。
諸善男子！諸法相中無所施、無施者、無受者，是三法性皆空；是性空法不可取，不可取相是性空。』#91.36
如是，須菩提！菩薩摩訶薩行檀波羅蜜時，布施眾生，是中不得布施、不得施者、不得受者。何以故？無所得檀波羅蜜是名為檀波羅蜜。
是菩薩不得是三法故，能教眾生，令得須陀洹果，乃至令得阿羅漢果、辟支佛道、阿耨多羅三藐三菩提。
如是，須菩提！菩薩摩訶薩行檀波羅蜜時，成就眾生。
%87.45 （B）以四種正行修布施，生富貴處；以四攝法攝取眾生，令修道得果
是菩薩自行布施，亦教他人行布施，讚歎布施法，歡喜讚歎行布施者。
是菩薩如是布施已，生剎利大姓、婆羅門大姓、居士大家#91.37，若作小王、若轉輪聖王，是時，以四事攝取眾生。何等四？布施、愛語、利行、同事。
是四事攝眾生已，眾生漸漸住於戒、四禪、四無量心、四無色定，四念處乃至八聖道分，空、無相、無作三昧，得入正位中，得須陀洹果乃至得阿羅漢果，若得辟支佛道，若教令得阿耨多羅三藐三菩提，作是言：『諸善男子！汝等當發阿耨多羅三藐三菩提心，是阿耨多羅三藐三菩提易得耳！
何以故？無有定法眾生所著處，但顛倒故眾生著。是故汝當#91.38自離生死，亦當教他離生死；汝等當發心，能自利益，亦當@t25p701b得利益他人。』#91.39
須菩提！菩薩摩訶薩應如是行檀波羅蜜！
~2651
%87.46 （2）重明住果成就眾生
是行檀波羅蜜因緣故，從初發意已來，終不墮惡道，常作轉輪聖王。何以故？隨其所種，得大果報。
是菩薩作轉輪聖王時，見有乞者，作#91.40是念：『我不#91.41為餘事故受轉輪聖王果，但為利益一切眾生故。』
是時，作是言：『此是汝物，汝自取之，莫有所難，我無所惜！我為眾生故受生死，憐愍汝等故具足大悲。』
行是大悲，饒益眾生，亦不得實定眾生相#91.42，但有假名故可說是眾生；是名字亦空，如嚮#91.43聲，實不可說相。#91.44
須菩提！菩薩摩訶薩應如是行檀波羅蜜，於眾生中無所惜，乃至不惜自身#91.45肌#91.46肉，何況外物#91.47！以是法故，能出眾生生死。何等是法？所謂檀波羅蜜、尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜乃至十八不共法，令眾生從生死中得脫。
%87.47 （3）住施度攝餘五度，成就眾生
%87.48 A、約攝戒度說
復次，須菩提！菩薩摩訶薩住檀波羅蜜中布施已，作是言：『諸善男子！汝等來持戒，我當供給汝等，令無乏短，衣、食、臥具乃至資生所須，盡當給汝；汝等乏少故破戒，我當給汝所須，令無所乏，若飲食乃至七寶。汝等住是戒律儀中，漸漸當得盡苦，成#91.48於三乘而得度脫──若聲聞乘、辟支佛乘、佛乘。』
%87.49 B、約攝忍度說
復次，須菩提！菩薩摩訶薩住檀波羅蜜中，若見眾生瞋惱，作是言：『諸善男子！汝等以何因緣故瞋惱？我當與汝所須；汝等所欲，從我取之，悉當給汝，令無所乏──若飲食、衣服乃至資生所須。』
是菩薩住檀波羅蜜中，教眾生忍辱，作是言：『一切法中無有堅實，汝等所瞋，是因緣空無堅實，皆從@t25p701c虛妄憶想生，汝#91.49無有根本。汝#91.50瞋恚壞心，惡口~2652罵詈，刀杖相加，以至害命！#91.51
汝等莫以是虛妄法起瞋故，墮地獄、畜生、餓鬼中及餘惡道，受無量苦。
汝等莫以是虛妄無實諸法故而作罪業；以是罪業故，尚#91.52不得人身，何況得生佛世！諸人！佛世難值、人身難得，汝等莫失好時！若失好時，則不可救。』#91.53
是菩薩摩訶薩如是教化眾生，自行忍辱，亦教他人令行忍辱，讚歎忍辱法，歡喜讚歎行忍辱者。
是菩薩令眾生住忍辱中，漸以三乘得盡眾苦。
如是，須菩提！菩薩摩訶薩住檀波羅蜜，令眾生住忍辱。
%87.50 C、約攝精進度說
須菩提！云何菩薩摩訶薩住檀波羅蜜，令眾生精進？
須菩提！菩薩見眾生懈怠，作如#91.54是言：『汝等何以懈怠？』
眾生言：『因緣少故。』
是菩薩行檀波羅蜜時，語諸人言：『我當令汝因緣具足，若布施、若持戒、若忍辱。如是等因緣，令汝具足。』#91.55
是眾生得菩薩利益因緣故，身精進、口精進、心精進；身精進、口精進、心精進故，一切善法具足，修聖無漏法；修聖無漏法故，當得須陀洹果乃至阿羅漢果、辟支佛道，若得阿耨多羅三藐三菩提。
如是，須菩提！菩薩摩訶薩行檀波羅蜜時，住精進波羅蜜，攝取眾生。
%87.51 D、約攝禪定度說
須菩提！云何菩薩摩訶薩行檀波羅蜜時，教化眾生令修禪波羅蜜？」
佛告須菩提：「菩薩見眾生亂心，作是言：『汝等可修禪定！』
~2653眾生言：『我等因緣不具足故。』
菩薩言：『我當與汝等作因緣，以是因緣故，令汝心不隨覺觀，亦#91.56不馳散。』#91.57
眾生以是因緣故斷覺觀，入初禪、二禪、三禪、四禪，行慈、悲、喜、捨心。
眾生以是禪、無量@t25p702a心因緣故，能修四念處乃至八聖道分；修三十七助道法時，漸入三乘而得#91.58涅槃，終不失道。
如是，須菩提！菩薩摩訶薩行檀波羅蜜時，以禪波羅蜜攝取眾生，令行禪波羅蜜。
%87.52 E、約攝般若度說
須菩提！云何菩薩摩訶薩行檀波羅蜜，以般若波羅蜜攝取眾生？
須菩提！菩薩見眾生愚癡，無有智慧，作是言：『汝等何以故不修智慧？』
眾生言：『因緣未具#91.59故。』
菩薩住檀波羅蜜中，作是言：『汝等所須得智慧具，從我取之，所謂布施、持戒、忍辱、精進、入禪定。是因緣具足已，汝等如是思惟：「思惟般若波羅蜜時，有法可得不？若我、若眾生、若壽命、乃至知者、見者可得不？若色、受、想、行、識，若欲界、色界、無色界，若六波羅蜜，若三十七助道法，若須陀洹果，若斯陀含、阿那含、阿羅漢果、辟支佛道，若阿耨多羅三藐三菩提可得不？」』#91.60
是眾生如是思惟時，於般若波羅蜜中，無有法可得可著處；若不著諸法，是時不見法有生有滅、有垢有淨；不分別──是地獄、是畜生、是餓鬼、是阿修羅眾、是天、是人，是持戒、是破戒，是須陀洹、是斯陀含、是阿那含、是阿羅漢、是辟支佛、是佛。
如是，須菩提！菩薩摩訶薩行檀波羅蜜時，以般若波羅蜜攝取眾生。
%87.53 2、以六度、道品成就眾生
須菩提！云何菩薩摩訶薩住檀#91.61波羅蜜中，以尸羅波羅蜜、羼提波羅蜜、毘梨耶波~2654羅蜜、禪波羅蜜、般若波羅蜜，乃至以#91.62三十七助道法，攝取眾生？
須菩提！菩薩摩訶薩住#91.63檀波羅蜜中，以供養具利益眾生。
以是利益因緣故，眾生能修四念處、四正勤、四如意足、五根、五力、七覺分、八聖道分；眾生行是三十七@t25p702b助道法，於生死中得解脫。
如是，須菩提！菩薩摩訶薩以無漏聖法攝取眾生。#91.64
%87.54 3、明展轉傳化
%87.55 （1）舉施度
復次，須菩提！菩薩摩訶薩教化眾生時，如是言：『諸善男子！汝等從我取所須物──若飲食、衣服、臥具、香華乃至七寶等種種資生所須，汝當以是攝取眾生，汝等長夜利益安樂。莫作是念：「是物非我所有。」我長夜為眾生故，集此諸物；汝等當取是物，如#91.65己物#91.66無異。』
教化眾生令行布施、持戒、忍辱、精進、禪定、智慧，乃至令得三十七助道法、佛十力乃至十八不共法，亦令得無漏法果#91.67，所謂須陀洹乃至阿羅漢果、辟支佛道、阿耨多羅三藐三菩提。
如是，須菩提！菩薩摩訶薩行檀波羅蜜時，應如是教化眾生，令得離三惡道及#91.68一切生死往來苦。#91.69
~2655
%87.56 （2）例餘度
%87.57 A、舉持戒
復次，須菩提！菩薩摩訶薩住尸羅波羅蜜教化眾生，作是言：『眾生！汝等少#91.70何因緣故破戒？我#91.71當與汝作具足因緣──若布施乃至智慧及種種資生所須。』
是菩薩住尸羅波羅蜜，利益眾生，令行十善#91.72，遠離十不善道。
是諸眾生持諸戒，不破戒、不缺戒、不濁戒、不雜戒、不取戒，漸以三乘而得盡苦。#91.73
%87.58 B、例餘四度
尸#91.74羅波羅蜜為首，如檀波羅蜜說，餘四波羅蜜亦如是。」
^92.1
#92.5
$$壹、以方便力故具足菩薩道，能得佛道、度眾生（承上卷91〈81 釋照明品〉）
$$貳、明二種要行：成就眾生，淨佛國土（承上卷91〈81 釋照明品〉）
$$（壹）略明（承上卷91〈81 釋照明品〉）
$$（貳）廣明（承上卷91〈81 釋照明品〉）
$$一、成就眾生（承上卷91〈81 釋照明品〉）
$$（一）正明成就眾生（承上卷91〈81 釋照明品〉）
%87.145 （二）菩薩自住勝道，教眾生無住，共證菩提#92.6
%87.146 1、菩薩自住勝道
%87.147 （1）明菩薩所行道
%87.148 A、須菩提心念
爾時，須菩提作是念：「何等是菩薩摩訶薩道？菩薩住是道，能作如是大#92.7莊嚴#92.8？」
%87.149 B、佛答
%87.150 （A）生身菩薩所行
佛知須菩提心所念，告須菩提：「六波羅蜜是菩薩摩訶薩道，三十七助道法是菩薩摩訶薩道，十八空是菩薩摩訶薩道，八背捨#92.9、九次第定是菩薩摩訶薩道，佛十力乃至十八不共法是菩薩摩訶薩道。
~2667
%87.151 （B）法身菩薩所行
一切法亦是菩薩摩訶薩道。@t25p705c
須菩提！於汝意云何？頗#92.10有法菩薩所不學能得阿耨多羅三藐三菩提不？須菩提！無有法菩薩所不應學者。
何以故？菩薩不學一切法，不能得一切種智。」
%87.152 （2）菩薩住空無戲論道，為眾生故分別諸法
%87.153 A、須菩提問
須菩提白佛言：「世尊！若一切法空，云何言『菩薩學一切法』？將無世尊無戲論中作戲論耶？所謂是此、是彼，是世間法、是出世間法，是有漏法#92.11、是無漏法，是有為法、是無為法，是凡夫人法、是阿羅漢法、是#92.12辟支佛法、是佛法！」#92.13
%87.154 B、佛答
%87.155 （A）述成：以諸法空故，能得無上道
佛告須菩提：「如是！如是！一切法實空。
須菩提！若一切法不空者#92.14，菩薩摩訶薩不能#92.15得阿耨多羅三藐三菩提。
須菩提！今一切法實空故，菩薩摩訶薩能得阿耨多羅三藐三菩提。#92.16
%87.156 （B）釋義：眾生不知空故，菩薩巧為說
須菩提！如汝所言，若一切法空，將無佛於無戲論中作戲論：分別此彼，是世間法、是出世間法，乃至是佛法？
須菩提！若世間眾生知一切法空，菩薩摩訶薩不學一切法、得一切種智。
須菩提！今眾生實不知一切法空，以是故，菩薩摩訶薩得阿耨多羅三藐三菩提已，分別諸法為眾生說。
%87.157 2、菩薩照明勝妙道
%87.158 （1）由因緣和合，有名字諸法
須菩提！於是菩薩道，從初已來，#92.17應如是思惟：『一切諸法中定性不可得，但從~2668和合因緣起法故有名字諸法。#92.18
%87.159 （2）明諸法性空無所著
我當思惟諸法實性無所著──若六波羅蜜性、若三十七助道法、若須陀洹果乃至阿羅漢果、若辟支佛道、若阿耨多羅三藐三菩提。
何以故？一切法#92.19、一切法性空，空不著空，空亦不可得，何況空中有著！』#92.20
%87.160 3、悲濟眾生無住著
%87.161 （1）學一切法，觀眾生心行
須菩提！菩薩摩訶薩如是思惟，#92.21不著一切法而學一切法。
住是學中，觀眾生心行──是眾生心在何處行？知眾生虛妄不實中行。
是時，菩薩作@t25p706a是念：『是眾生著不實虛妄法，易度耳#92.22！』#92.23
%87.162 （2）教化眾生莫執著，自亦無住著
%87.163 A、方便示導眾生行菩薩道亦莫執著
是時，菩薩摩訶薩住般若波羅蜜時#92.24，以方便力故，如是教化言：『汝諸眾生！當行布施，可得饒財#92.25，亦莫恃#92.26布施果報#92.27而自高#92.28。何以故？是中無堅實法。持戒、禪定、智慧，亦如是。諸眾生！行是法，可得須陀洹果乃至阿羅漢果、辟支佛道、佛道──莫念有是法！』如是教化，行菩薩道而無所著，是中無有堅實故。#92.29
~2669
%87.164 B、行道得果亦不住
%87.165 （A）正明
若如是教化，是#92.30名行菩薩道，於諸法無所著故。何以故？一切法無所#92.31著相，以性無故、性空故。#92.32
須菩提！是菩薩摩訶薩如是行菩薩道時，無所住。是菩薩用不住法故，行檀波羅蜜亦不住是中，行尸羅波羅蜜亦不住是中，行羼提波羅蜜亦不住是中，行毘梨耶波羅蜜亦不住是中，行禪波羅蜜亦不住是中，行般若波羅蜜亦不住是中。#92.33
行初禪亦不住是中。何以故？是初禪初禪相空，行禪者亦空，所用法亦空；第二、第三、第四禪亦如是。慈悲喜捨、四無色定、八背捨、九次第定亦如是。
得須陀洹果亦不住是中，得斯陀含果、阿那含果、阿羅漢果亦不住是中，得辟支佛道亦不住是中。#92.34」
%87.166 （B）釋不住因緣
須菩提白佛言：「世尊！何因緣故不住是中？」
佛言：「二因緣故，不住是中。何等二？一者、諸道果性空，無住處，亦無所用法，亦無住者；二者、不以少事為足，作是念：『我不應不得須陀洹果，我必應當得須陀洹果，我但不應是中住；乃至辟支佛道，我不應不得，我必應當得，我但不應是中住。乃至得阿耨多羅三藐三菩提，不應住。何以故？我從初發意已來，更無餘心，一心向阿@t25p706b耨多羅三藐三菩提。』#92.35
%87.167 4、了悟無生，共證菩提
%87.168 （1）以一心專向，能生菩提道
須菩提！菩薩一心向阿耨多羅三藐三菩提中，#92.36遠離餘心，所作身、口、意業皆應阿耨多羅三藐三菩提。
~2670須菩提！是菩薩摩訶薩住是一心，能生菩提道。」#92.37
%87.169 （2）雖諸法無生，愍眾生不知故起菩提道
須菩提白佛言：「世尊！若一切諸法不生，云何菩薩摩訶薩能生菩提道？」
佛告須菩提：「如是！如是！一切法無生。云何無生？無所作、無所起者，一切法不生故。」
須菩提白佛言：「世尊！有佛、無佛，諸法法相不常住耶？」
佛言：「如是！如是！有佛、無佛，是諸法法相常住。以眾生不知是法住法相，為是故，菩薩摩訶薩為眾生故生菩提道，用是道拔出眾生生死。」
%87.170 （3）道與菩提，不一亦不異
%87.171 A、用生道等三句#92.38不得菩提
須菩提白佛言：「世尊！用生道得菩提？」
佛言：「不也！」
「世尊！用不生道得菩提？」
佛言：「不也！」
「世尊！用不生非不生道得菩提？」
佛言：「不也！」#92.39
%87.172 B、明因果不異
須菩提言：「世尊！云何當得菩提？」
佛言：「非用道得菩提，亦不用非道得菩提。須菩提！菩提即是道，道即是菩提。」
%87.173 C、破不異難
%87.174 （A）須菩提難
須菩提白佛言：「世尊！若菩提即是道、道即是菩提者，今菩薩未作佛#92.40，應當~2671得阿耨多羅三藐三菩提！
云何說諸佛、多陀阿伽度、阿羅呵、三藐三佛陀#92.41有三十二相、八十隨形好、十力、四無所畏、四無礙智、十八不共法、大慈大悲？」#92.42
%87.175 （B）佛答
%87.176 a、總相答：破人法異見
佛告須菩提：「於汝意云何？佛得菩提不？」
「不也！世尊！佛不得菩提。何以故？佛即是菩提，菩提即是佛。」#92.43
%87.177 b、破因果不異
「如須菩提所問：『菩薩時亦應得菩提！』
須菩提！是菩薩摩訶薩具足六波羅蜜、三十七助道法，具足佛十力、四無所畏、四無礙智、十八不共法，具足住如金剛三昧，用一念相應慧得阿耨多羅三藐三菩提，是#92.44時名為@t25p706c佛，一切法中#92.45得自在。」#92.46
%87.178 二、淨佛國土#92.47
%87.179 （一）明淨土因
%87.180 1、明無惡因
~2672
%87.181 （1）略標：無三業障惡
須菩提白佛言：「世尊！云何菩薩摩訶薩淨佛國土？」
佛言：「有菩薩從初發意已來，自除身麁業、除口麁業、除意麁業，亦淨他人身、口、意麁業。」
%87.182 （2）別釋麁業相
%87.183 A、須菩提問
「世尊！何等是菩薩摩訶薩身麁業、口麁業、意麁業？」
%87.184 B、佛答
%87.185 （A）十不善業
佛告須菩提：「不善業──若殺生乃至邪見，是名菩薩摩訶薩身、口、意麁業。
%87.186 （B）六蔽心
復次，須菩提！慳貪心、破戒心、瞋心、懈怠心、亂心、愚癡心，是名菩薩意麁業。
%87.187 （C）戒不淨
復次，戒不淨，是名菩薩身、口麁業。
%87.188 （D）隨世間心──遠離出世之觀行
復次，須菩提！若菩薩#92.48遠離四念處行，是名菩薩麁業；遠離四正勤、四如意足、五根、五力、七覺分、八聖道分，空三昧、無相、無作三昧，亦名菩薩麁業。
%87.189 （E）貪二乘果
復次，須菩提！菩薩摩訶薩貪須陀洹果#92.49，乃至貪阿羅漢果證、辟支佛道，是名菩薩摩訶薩麁業。」
^93.1
$$二、淨佛國土（承上卷92）
$$（一）明淨土因（承上卷92）
$$1、明無惡因（承上卷92）
$$（1）略標：無三業障惡（承上卷92）
$$（2）別釋麁業相（承上卷92）
$$A、須菩提問（承上卷92）
$$B、佛答（承上卷92）
$$（A）十不善業（承上卷92）
$$（B）六蔽心（承上卷92）
$$（C）戒不淨（承上卷92）
$$（D）隨世間心──遠離出世之觀行（承上卷92）
$$（E）貪二乘果（承上卷92）
%87.281 （F）取相生著
復次，須菩提！菩薩取色相、受想行識相，眼相、耳鼻舌身意相，色、聲、香、味、觸、法相，男相、女相，欲界相、色界相、無色界相，善法相、不善法相，有為法相、無為法相──是名菩薩麁業。
%87.282 （G）總結：遠離麁業
菩薩摩訶薩皆遠離如是麁業相。
%87.283 2、菩薩淨佛國土之善根因緣
%87.284 （1）總明：自他共行六度，回向淨佛土
自布施，亦教他人布施，須食與食、須衣與衣，乃至種種資生所須，盡給與之；亦教他人種種布施。持是福德與一切眾生共之，迴向淨佛國土故。
持戒、忍辱、精進、禪定、智慧亦如是。#93.1
~2685
%87.285 （2）別明發願#93.2
%87.286 A、因色、聲、香、味、觸發願
%87.287 （A）七寶願［色］
是菩薩摩訶薩或以三千大千國土#93.3滿中珍寶，施與三尊，@t25p709c作是願言：『我以善根因緣故，令我國土皆以七寶成。』#93.4
%87.288 （B）天樂願［聲］
復次，須菩提！菩薩摩訶薩以天妓#93.5樂樂佛及塔，作是願言：『以是善根因緣#93.6，願我國土中常聞天樂。』
%87.289 （C）天香願［香］
復次，須菩提！菩薩摩訶薩以三千大千國土滿中天香供養諸佛#93.7及塔，作是願#93.8言：『以是善根因緣，令我國土中常有天香。』
%87.290 （D）百味食願［味］
復次，須菩提！菩薩摩訶薩以百味食施佛及僧，作是願言：『以是善根因緣故，令我國土中眾生皆得百味食。』
%87.291 （E）天香細滑願［觸］
復次，須菩提！菩薩摩訶薩以天香細滑施佛及僧，作是願言：『以是善根因緣故，令我國土中一切眾生受天香細滑。』#93.9
%87.292 （F）隨意五欲願
復次，須菩提！菩薩摩訶薩以隨意五欲施佛及僧并一切眾生，作是願言：『以是善根因緣故，令我國土中弟子及一切眾生皆得隨意五欲。』
是菩薩以隨意五欲共一切眾生，迴向淨佛國土，作是願言：『我得佛時，是國土中如天五欲應心而至。』#93.10
~2686
%87.293 B、因法以發願
復次，須菩提！菩薩摩訶薩行般若波羅蜜時，作是願言：『我當自入初禪，亦教一切眾生入初禪，第二、第三、第四禪，慈、悲、喜、捨心，乃至三十七助道法亦如是；我得阿耨多羅三藐三菩提時，令一切#93.11眾生不遠離四禪，乃至不遠離三十七品#93.12助道法。』
%87.294 C、滿足眾願，自他皆成就一切善法、得身端正
如是，須菩提！菩薩摩訶薩能淨佛國土。
是菩薩隨爾所時行菩薩道，滿足是諸願；是菩薩自成就一切善法，亦成就一切眾生善法；是菩薩受身端正#93.13，所化眾生亦得端正。所以者何？福德因緣厚故。#93.14
%87.295 （3）勸學
須菩提！菩薩摩訶薩應如是淨佛國土。
%87.296 （二）明淨佛國土之殊勝
%87.297 1、無諸下劣事
是國土中，乃至無三惡道之名，亦無邪@t25p710a見、三毒、二乘──聲聞、辟支佛之名；耳不聞有無常、苦、空之聲，亦無我所有乃至無諸結使煩惱之名，亦無分別諸果之名。#93.15
%87.298 2、常聞勝妙法
%87.299 （1）常聞諸法實相之音
風吹七寶之樹，隨所應度而出音聲，所謂空、無相、無作，如諸法實相之音#93.16──『有佛無佛，一切法一切法相空，空中無有相，無相中#93.17則無作』──出如是法音，若晝、若夜，若坐、若臥、若立、若行，常聞此法。#93.18
~2687
%87.300 （2）眾生聞佛名，必至無上菩提
是菩薩得阿耨多羅三藐三菩提時，十方國土中諸佛讚歎；眾生聞是佛名，必至阿耨多羅三藐三菩提。#93.19
%87.301 （3）聞法皆信受
是菩薩得阿耨多羅三藐三菩提時說法，眾生聞者，無有不信而生疑，言：『是法？是非法？』何以故？諸法實相中，皆是法，無有非法。#93.20
諸有薄福之人，於諸佛及弟子#93.21不種善根、不隨善知識，沒在我見中，乃至沒在一切種種見中，墮在邊見──若斷、若常。如是人以邪見故，非佛言佛、佛言非佛，非法言法、法言非法；如是人破法故，身壞命終，墮惡道地獄中。
諸佛得阿耨多羅三藐三菩提時，見此眾生往來五道，令離邪聚，立正定聚中，更不墮惡道。
%87.302 3、無雜穢心，必定得無上菩提
如是，須菩提！菩薩摩訶薩淨佛國土中眾生，無雜穢心：若世間法、若出世間法，若有漏、若無漏，若有為、若無為；乃至是國土#93.22中眾生，畢竟#93.23至#93.24阿耨多羅三藐三菩提。#93.25
%87.303 （三）結
須菩提！是為菩薩摩訶薩淨佛國土。」
^93.2
%88.0 壹、自行德成#93.103
%88.1 （壹）明菩薩畢定作佛
%88.2 一、總標
須菩提白佛言：「世尊！是菩薩摩訶薩為畢定？為不畢定？」#93.104
佛告須菩提：「菩薩摩訶薩畢定，非不畢定。」
%88.3 二、別釋
%88.4 （一）約所行道辨：但於佛道中畢定
「世尊！何處畢定？為聲聞道中？為辟支佛道中？為佛道中？」
佛言：「菩薩摩訶薩非聲聞、辟支佛道中畢定，是佛道中畢定。」
%88.5 （二）約求道者辨：三種菩薩皆畢定
須菩提白佛言：「世尊！為初發意菩薩畢定#93.105？為最後身菩薩畢定？」
佛言：「初發意菩薩亦畢定，阿鞞跋致菩薩亦畢定，最#93.106後身菩薩亦畢定。」#93.107
%88.6 （貳）明畢定菩薩斷眾惡業故不墮八難#93.108
~2700「世尊！畢定菩薩墮惡道中生不？」
「不也！須菩提！於汝意云何？若八人，若須陀@t25p713a洹、斯陀含、阿那含、阿羅漢、辟支佛，生惡道中不？」
「不也！世尊！」
「如是，須菩提！菩薩摩訶薩從初發意已來，布施、持戒、忍辱、精進、行禪定、修智慧，斷一切不善業；若墮惡道、若生長壽天、若不得修善法處、若生邊國、若生惡邪見家、無作見家，是中無佛名、無法名、無僧名，無有是處！
須菩提！初發意菩薩於阿耨多羅三藐三菩提以深心行十不善道，無有是處！」#93.109
%88.7 貳、化他德成#93.110
%88.8 （壹）為利益眾生故受畜生身
%88.9 一、須菩提問
「世尊！若菩薩摩訶薩有如是善根功德成就，如佛自說本生受不善果報，是時善根為何所在？」#93.111
%88.10 二、佛答
佛告須菩提：「菩薩摩訶薩為利益眾生故，隨而受身，以是身利益眾生。須菩提！菩薩摩訶薩作畜生時，有是#93.112方便力，若怨賊欲來殺害，以無上忍辱、無上慈悲心捨身，不惱怨賊；汝諸聲聞、辟支佛，無有是力。
以是故，須菩提！當知菩薩摩訶薩欲具足大慈悲心、為憐愍利益眾生，故受畜生身。」#93.113
~2701
%88.11 （貳）菩薩行般若，以方便力起神通，隨意受身，嚴土熟生#93.114
%88.12 一、菩薩成就白淨無漏法，現受畜生身而不染
%88.13 （一）具足一切善根
須菩提白佛言：「世尊！菩薩摩訶薩住何等善根中受如是諸身？」#93.115
佛告須菩提：「菩薩摩訶薩從初發意乃至道場，於其中間，無有善根不具足者；具足已，當得阿耨多羅三藐三菩提。
以是故，菩薩摩訶薩從初發意，應當學具足一切善根；學善根已，當得一切種智，當斷一切煩惱習。」#93.116
%88.14 （二）方便受畜生身而不染
%88.15 1、舉佛化現為例
須菩提白佛言：「世尊！云何菩薩摩訶薩成就如是白淨無漏法，而生惡道畜生中？」#93.117
佛告須菩提：「於汝意云何？佛成就白淨#93.118無漏法不？」
須菩提言：「佛一切白淨無漏法成就。」
「須菩提！若佛自化作畜生身，作佛事，度眾生，實是畜生不？」
須菩提言：「不也！」
佛言：「菩薩摩訶薩亦如@t25p713b是，成就白淨無漏法，為度眾生故受畜生身，用是身教化眾生。」
%88.16 2、舉阿羅漢做變化身為例
佛告須菩提：「如阿羅漢作變化身，能使眾生歡喜不？」
須菩提言：「能！」
佛言：「如是！如是！須菩提！菩薩摩訶薩用是白淨無漏法，隨所#93.119度眾生而受身，~2702以是身利益眾生，亦不受苦#93.120。
%88.17 3、舉幻師幻作為例
「須菩提！於汝意云何？幻師幻作種種形──若象、馬、牛、羊、男、女等，以示眾人。須菩提！是象、馬、牛、羊、男、女等有實不？」
須菩提言：「不實也！世尊！」
佛言：「如是，須菩提！菩薩摩訶薩白淨無漏法成就，現作種種身以示眾生故，以是身饒益一切，亦不受眾苦。」#93.121
%88.18 （三）結歎
須菩提白佛言：「世尊！菩薩摩訶薩大方便力，得聖無漏智慧，而隨所應度眾生身，而作種種形以度眾生！#93.122
^94.1
$$貳、化他德成（承上卷93〈83 釋畢定品〉）
$$（壹）為利益眾生故受畜生身（承上卷93〈83 釋畢定品〉）
$$（貳）菩薩行般若，以方便力起神通，隨意受身，嚴土熟生（承上卷93〈83 釋畢定品〉）
$$一、菩薩成就白淨無漏法，現受畜生身而不染（承上卷93〈83 釋畢定品〉）
%88.65 二、菩薩住無所得般若空中起神通，為眾生隨意受身
%88.66 （一）明由般若起方便
%88.67 1、住無所得空中，得無上菩提
「世尊！菩薩摩訶薩住何等白淨法，能作如是方便力#94.3而不受染污？」#94.4
佛言：「菩薩用般若波羅蜜作如是方便力，於十方如恒河沙等國土中饒益眾生，亦不貪著是身。何以故？著者、著法、著處──是三法皆不可得，自性空故。
空不著空，空中無著者，亦無著處。何以故？空中，空相不可得。
須菩提！是名不可得空。
菩薩住是空#94.5中，能得阿耨多羅三藐三菩提。」#94.6
%88.68 2、住般若則住一切法
「世尊！菩薩但住般若波羅蜜中得阿耨多羅三藐三菩提，不住餘法中耶？」
~2710「須菩提！頗有@t25p715b法不入般若波羅蜜者不？」
「世尊！若般若波羅蜜自性空，云何一切法皆入般若波羅蜜中？世尊！空中無有法若入、若不入。」
「須菩提！一切法、一切法相空不？」
「世尊！空。」
「須菩提！若一切法、一切法相空，云何言『一切法不入空中』？」
%88.69 （二）明方便起神通諸行
%88.70 1、須菩提問
須菩提白佛言：「世尊！云何菩薩摩訶薩行般若波羅蜜時，住一切法空中，能起神通波羅蜜；#94.7住是神通波羅蜜中，到十方如恒河沙等國土，供養現在諸佛，聞諸佛說法，於諸佛所種善根？」
%88.71 2、佛答
%88.72 （1）菩薩行般若，遍觀國土、諸佛皆空，能以方便起神通
佛告須菩提：「菩薩摩訶薩行般若波羅蜜時，觀是十方如恒河沙等國土皆空，是國土中諸佛亦性空，但假名字故，諸佛現身所假名字亦空。
若十方國土及諸佛性不空者，空為有偏；以空不偏故，一切法、一切法相空。以是故，一切法、一切法相空。#94.8
是故菩薩摩訶薩行般若波羅蜜，用方便力，生神通波羅蜜；住是神通波羅蜜中，起天眼、天耳、如意足、知他心智#94.9、宿命智#94.10，知眾生生死。#94.11
%88.73 （2）起神通，自他行成
%88.74 A、明自行成
~2711
%88.75 （A）神通波羅蜜是菩提道，能令自他見善法亦無所著
若菩薩遠離神通波羅蜜，不能得饒益眾生，亦不能得阿耨多羅三藐三菩提。是菩薩摩訶薩神通波羅蜜，是阿耨多羅三藐三菩提#94.12道。
何以故？用是天眼自見諸善法，亦教他人令得諸善法，於善法亦不著，諸善法自性空故。空無所著，若著則受味，是空中無有味。#94.13
%88.76 （B）觀一切法空，不起有漏業，為眾生說法亦不著眾生
是菩薩摩訶薩行般若波羅蜜時，能生如是天眼，用是眼#94.14觀一切法空；見是法空，不取相、不作業；亦為#94.15人說是法，亦不得眾生相、不得眾生名。#94.16
%88.77 （C）得無礙般若，起無礙神通
如是菩薩摩訶薩用無所得法故起神通波羅蜜，用是神通波羅蜜，神通所應作者@t25p715c能作。#94.17
%88.78 B、化他行成
%88.79 （A）略明：遊戲神通，廣演道法，饒益眾生
%88.80 a、總說
是菩薩用天眼通過於人眼，見十方國土；見已，飛到十方，饒益眾生──或以布施、或以持戒、或以忍辱、或以精進、或以禪定、或以智慧，饒益眾生；或以三十七助道法，或以諸禪、解脫、三昧，或以聲聞法、或以辟支佛法、或以菩薩法、或以佛法，饒益眾生。
%88.81 b、別辨
%88.82 （a）教修六度
%88.83 Ⅰ、教布施
為慳者如是說#94.18法：『諸眾生！當行布施。貧窮是苦惱法！貧窮之人自不能益，何能益他？以是故，汝等當勤布施，自身得樂，亦能令他得樂；莫以貧窮故共相食噉，不得離三惡道。』
~2712
%88.84 Ⅱ、教持戒
為破戒者說法：『諸眾生！破戒法大苦惱！破戒之人自不能益，何能益他？破戒法受苦果報──若在地獄，若在餓鬼，若在畜生。汝等墮三惡道中，自不能救，何能救人？以是故，汝等#94.19不應隨破戒心，死時有悔。』
%88.85 Ⅲ、教忍辱
若有共相瞋諍者，說如是法：『諸眾生！莫共相瞋！瞋亂心人，不順善法。汝等今共相瞋亂心，或墮地獄，若餓鬼、畜生中。以是故，汝等不應生一念瞋恚心，何況多！』
%88.86 Ⅳ、教精進、禪定、智慧
為懈怠眾生說法，令得精進。
散亂眾生，令得禪定。
愚癡眾生，令得智慧亦如是。
%88.87 （b）教除三毒
行婬欲者，令觀不淨；瞋恚者，令觀慈心；愚癡眾生，令觀十二因緣。
%88.88 （c）教入正道
行非道眾生，令入正道，所謂聲聞道、辟支佛道、佛道。為是眾生如是說法：『汝等所著是法性空，性空法中不可得著，不著相是空相。』
%88.89 c、舉喻勸修
如是，須菩提！菩薩摩訶薩行般若波羅蜜時，住神通波羅蜜中，為眾生作利益。
須菩提！菩薩若遠離神通，不能隨眾生意善說#94.20法。以是故，須菩提！菩薩摩訶薩行般若波羅蜜時，應起神通。
須菩提！譬如鳥無翅不能高@t25p716a翔；菩薩無神通，不能隨意教化眾生。
以是故，須菩提！菩薩摩訶薩行般若波羅蜜，應起諸神通；起諸神通已，若欲饒益眾生，隨意能益。
%88.90 （B）廣說：以神通饒義一切眾生，應機施教，隨意受身而無染
%88.91 a、以通化導
%88.92 （a）天眼通
是菩薩用天眼見如恒河沙等諸國土及見是國土中眾生；見已，用神通力往到其所，知眾生心，隨其所應而為說法──或說布施，或說持戒，或說禪定，乃至或說涅槃法。
%88.93 （b）天耳通
是菩薩用天耳聞二種音聲：若人、若非人。用天耳聞十方諸佛所說法，皆能受持；如所聞法為眾生說──或說布施，乃至或說涅槃。
~2713
%88.94 （c）他心通
是菩薩淨他心智，用他心智知眾生心，隨其所應而為說法──或說布施，乃至或說涅槃。
%88.95 （d）宿命通
是菩薩宿命智憶念種種本生處，亦自憶、亦憶他人；用是宿命智，念過去在在處處諸佛名字及弟子眾；有眾生信樂宿命者，為現宿命事而為說法──或說布施，乃至或說涅槃。
%88.96 （e）神足通
用如意神通力到種種無量諸佛國土，供養諸佛，從諸佛種善根，還來本國。
%88.97 （f）漏盡通
是菩薩漏盡神通智證，用是漏盡神通智證故，為眾生隨應說法──或說布施，乃至或說涅槃。
%88.98 b、用神通力，隨意受身，苦樂不染
如是，須菩提！菩薩摩訶薩行般若波羅蜜時，應如是起諸#94.21神通。
菩薩用修是神通故，隨意受身，苦樂不染；譬如佛所化人，作一切事，苦樂不染。#94.22
%88.99 三、以神通嚴土熟生，滿菩提願，轉法輪度眾生
%88.100 （一）以遊戲神通嚴土熟生，得無上菩提
菩薩摩訶薩行般若波羅蜜時，應如是遊戲神通，能淨佛國土、成就眾生。
復次，須菩提！菩薩摩訶薩不淨佛國土、不成就眾生，不能得阿耨多羅三藐三菩提。
何以故？因緣不具足故，不能得阿耨多羅三藐三菩提。」
%88.101 （二）一切善法皆是無上菩提因緣
%88.102 1、總説
須菩提白佛言：「世尊！何等是菩薩摩訶薩因緣具足已，得阿耨多羅@t25p716b三藐三菩提？」
佛告須菩提：「一切善法是菩薩阿耨多羅三藐三菩提因緣。」#94.23
%88.103 2、別辨
%88.104 （1）約施度明
~2714
%88.105 A、以無分別心行布施，自利利他
須菩提白佛言：「世尊！何等是善法，以是善法故，得阿耨多羅三藐三菩提？」
佛告須菩提：「菩薩從初發意已來，檀波羅蜜是善法因緣，是中無分別是施者、是受者，性空故。用是檀波羅蜜，能自利益，亦能利益眾生──從生死拔出，令得涅槃#94.24。是諸善法皆是菩薩摩訶薩阿耨多羅三藐三菩提因緣。#94.25
%88.106 B、三世菩薩，得度生死
行是道，過去、未來、現在諸菩薩摩訶薩得度生死──已度、今度、當度。#94.26
%88.107 （2）例餘法
尸羅波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜，四禪、四無量心、四無色定，四念處乃至八聖道分，十八空，八背捨、九次第定，陀羅尼門，佛十力、四無所畏、四無礙智、十八不共法──如是等功德，皆是阿耨多羅三藐三菩提道。
%88.108 （3）結
須菩提！是名善法。
%88.109 （三）具足諸善法，成佛度眾生
菩薩摩訶薩具足是善法已，當得一切種智；得一切種智已，當轉法輪；轉法輪已，當度眾生。」
^94.2
%89.0 壹、佛與菩薩所行雖同，而有已得、當得之異
%89.1 （壹）須菩提問
須菩提白佛言：「世尊！若是諸法是菩薩法，何等是佛法？」#94.48
%89.2 （貳）佛答
%89.3 一、印可所問
佛告須菩提：「如汝所問『是諸法是菩薩法，何等是佛法』者。
%89.4 二、正答
%89.5 （一）標宗：得一切種智、斷煩惱習乃名為佛，而菩薩未成滿
須菩提！菩薩法亦是佛法。
若知一切種#94.49，是得一切種智，斷一切煩惱習，菩薩當得是法；佛以一念相應慧知一切法已，得阿耨多羅三藐三菩提。
須菩提！是為菩薩、佛之差別。#94.50
%89.6 （二）舉喻：如向道、得果之異
譬如向道、得果異，是二人俱為聖人#94.51。
%89.7 （三）合法
如是，須菩提！菩薩摩訶薩無礙道中行，是名菩薩摩訶薩；解脫道中無一切闇蔽#94.52，是為佛。」#94.53
%89.8 貳、一切法自相空雖不二，然迷悟有別
%89.9 （壹）須菩提問
須菩提白佛言：「世尊！若一切法自相空，自相空法中，云何有差別之異──是地獄、~2723是餓鬼、是畜生、是天、是人，是性地人#94.54、是八地人#94.55、是須陀洹人、是斯陀含、阿那含、阿羅漢人、是辟支佛、是菩薩、是多陀阿伽度、阿羅呵、三藐三佛陀？
世尊！如諸人不可得，業因緣亦不可得，果報亦不可得！」
%89.10 （貳）佛答
%89.11 一、自相空中無別
佛言：「如是！如是！如汝所言，自相空法中，無眾生、無業因緣、無果報。
%89.12 二、因迷悟不同而有差別
%89.13 （一）眾生迷故造業受報
須菩提！眾生不知是諸法自相空，是@t25p718c眾生作業因緣──若善、若惡、若無動：罪業因緣故，墮三惡道中；
福業因緣故，在人、天中生；
無動業因緣故，色、無色界中生。
%89.14 （二）菩薩悟故得道饒益眾生
是菩薩摩訶薩行檀波羅蜜乃至十八不共法時，盡受行是助道法#94.56；如金剛三昧得阿耨多羅三藐三菩提；得已，饒益眾生。是利常不失故，不墮五#94.57道生死中。」
%89.15 參、佛不得五道生死，為眾生故證得菩提，廣說四諦、實諦
%89.16 （壹）諸法自相空中無業果差別
須菩提白佛言：「世尊！佛得阿耨多羅三藐三菩提已，得五道生死不？」#94.58
佛言：「不得也！須菩提！」
「世尊！得業若黑、若白#94.59、若不黑不白不？」#94.60
佛言：「不也！」
%89.17 （貳）愍眾生不知性空故，菩薩發心求道
%89.18 一、須菩提問
「世尊！若不得，云何說是地獄、餓鬼、畜生、人、天、須陀洹乃至阿羅漢、辟支佛、菩薩、諸佛？」#94.61
~2724
%89.19 二、佛答
%89.20 （一）正說
「須菩提！若眾生知諸法自相空，菩薩摩訶薩不求阿耨多羅三藐三菩提，亦不拔眾生於三惡趣，乃至五道往來#94.62生死中。
須菩提！以眾生實不知諸法自性空故，不得脫五道生死；是菩薩從諸佛所聞諸法自性#94.63空，發意求阿耨多羅三藐三菩提。
%89.21 （二）釋因
須菩提！諸法不爾如凡夫人所著；
是眾生於無所有法中，顛倒妄想分別得法──無眾生有眾生相#94.64，無色色#94.65相，無受想行識受#94.66想行識相；乃至一切有為法無所有，用顛倒妄想心，作身、口、意業因緣，往來五道生死中，不得脫。#94.67
%89.22 （參）為眾生故行菩薩道、得菩提
是菩薩摩訶薩行般若波羅蜜時，一切善法內般若波羅蜜中，行菩薩道，得阿耨多羅三@t25p719a藐三菩提；#94.68
%89.23 （肆）成佛道已，教化眾生
%89.24 一、說四諦、三寶
得阿耨多羅三藐三菩提已，為眾生說四聖諦──苦、苦集、苦滅、苦滅道，開示分別。一切助道善法皆入四聖諦中，#94.69用是助道善法故，分別有三寶。何等三？佛寶、法寶、~2725僧寶。不信拒逆#94.70是三寶故，不得離五道生死。」#94.71
%89.25 二、說一乘實諦
%89.26 （一）總明四諦平等即是涅槃
%89.27 1、須菩提問
須菩提白佛言：「世尊！用苦聖諦得度？用苦智得度？用集聖諦得度？用集智得度？用滅聖諦得度？用滅智得度？用道聖諦得度？用道智得度？」
%89.28 2、佛答
佛告須菩提：「非苦聖諦得度，亦非苦智得度；乃至非道聖諦得度，亦非道智得度。
須菩提！是四聖諦平等故，我說即是涅槃；不以苦聖諦，不以集、滅、道聖諦，亦不以苦智，不以集、滅#94.72、道#94.73智得涅槃。」#94.74
%89.29 （二）別明四諦平等義
%89.30 1、須菩提問
須菩提白佛言：「世尊！何等是四聖諦平等？」
%89.31 2、佛答
%89.32 （1）無四諦、四諦智
「須#94.75菩提！若無苦、無苦智，無集、無集智，無滅、無滅智，無道、無道智，是名四聖諦平等。
%89.33 （2）四諦實相
復次，須菩提！是四聖諦如、不異、法相、法性、法住、法位、實際，有佛、無佛，法相常住，為不誑不失故。#94.76
%89.34 肆、通達實相入菩薩位，成就空觀巧說法
%89.35 （壹）通達實諦，能過二乘，入菩薩位，順向菩提
~2726
%89.36 一、總說
是菩薩摩訶薩行般若波羅蜜時，為通達實諦故，行般若波羅蜜。」#94.77
%89.37 二、別論
%89.38 （一）須菩提問
須菩提白佛言：「世尊！云何菩薩摩訶薩為通達實諦故，行般若波羅蜜時，如通達實諦故，不墮聲聞、辟支佛地，直入菩薩位中？」
%89.39 （二）佛答
%89.40 1、見一切法空，入菩薩位，不從頂墮
佛告須菩提：「若菩薩摩訶薩如實見諸法；見已，得無所有法；得無所有法已，見一切法空──四聖諦所攝、四聖諦所不攝法皆空。
若如是觀，是時，便入菩薩位中；是為菩薩住性地中，不從頂墮。
用是頂墮故，墮聲聞、辟支佛地。#94.78
%89.41 2、通達實相，順向菩提
是菩薩住性地中，能生四禪、四無量心、四無色定。
是菩薩住是初定地中，分別一切諸@t25p719b法，通達四聖諦──知苦，不生緣苦心；乃至知道，不生緣道心。但順阿耨多羅三藐三菩提心，觀諸法如實相。」#94.79
%89.42 （貳）空觀成就，以方便力為眾生說法
%89.43 一、以自相空觀諸法
%89.44 （一）明觀行
「世尊！云何觀諸法如實相？」
佛言：「觀諸法空。」
「世尊！何等空？」
佛#94.80言：「自性#94.81空。是菩薩用如是智慧觀一切法空，無法性可見住是性中得阿耨多羅~2727三藐三菩提。#94.82
%89.45 （二）釋因由：諸法無自性，非佛、菩薩、二乘所作
何以故？無性相是阿耨多羅三藐三菩提；非諸佛所作，非辟支佛所作，亦非阿羅漢所作，亦非向道人所作，亦非得果人所作，亦非菩薩所作。#94.83
%89.46 二、愍眾生不知實相故，菩薩行般若，以方便力為眾生說法
但眾生不知不見諸法如實相，以是事故，菩薩摩訶薩行般若波羅蜜，以方便力故，為是眾生說法。」
^95.1
#95.3
%90.0 壹、諸法本空，迷悟不同故有凡聖#95.4
%90.1 （壹）於空中分別諸法異
%90.2 一、須菩提問#95.5
%90.3 （一）若諸法性空，云何分別有諸法異
須菩提白佛言：「世尊！若諸法性無所有，非佛所作，非辟支佛所作，非阿羅漢所作，非阿那含、斯陀含、須陀洹所作，非向道人、非得果人、非諸#95.6菩薩所作，云何分別有諸法異──是地獄、是畜生、是餓鬼，是人、是天，乃至是非有想非無想天？#95.7
%90.4 （二）無性法中無有業用，云何由行業因緣故有五道、三乘
用是業因緣故，知有生地獄者；是業因緣故，知有生畜生、餓鬼者；是業因緣故，知有生人中，生四天王天乃至生#95.8非有想非無想天者；#95.9
是業因緣故，知有得須陀洹、斯陀含、阿那含、阿羅漢、辟支佛者；是業因緣故，~2737知是諸菩薩摩訶薩；是業因緣故，知是多陀阿伽度、阿羅訶、三藐三佛陀#95.10？#95.11
世尊！無性法中，無有業用。作業因緣故，若墮地獄、餓鬼、畜生，若生人、天乃至生非有想非無想天；以是業因緣故，得須陀洹、斯陀含、阿那含、阿羅漢、辟支佛；菩薩摩訶薩行菩薩道，當得一切種智，得一切種智故，能拔出#95.12眾生於生死中？#95.13」
%90.5 二、佛答#95.14
%90.6 （一）佛述成：無性法無業無果報
佛告須菩提：「如是！如是！無性法無業無果報#95.15。#95.16
%90.7 （二）釋難
%90.8 1、釋「云何有五道#95.17」
須菩提！凡夫人不入聖法，不知諸法無性相，顛倒愚癡故，起種種業因緣。是諸眾生隨業得身：若地獄身，若畜生身，若餓鬼身，若人身，若天身──若#95.18四天王天身乃至非有想非無想天身。
是無性法無業無果報，@t25p722a無性常是無性。#95.19
~2738
%90.9 2、釋「云何有三乘」
%90.10 （1）實慧觀道果無性
如須菩提所言：『若一切法無性，云何是須陀洹乃至諸佛得一切種智？』須菩提！於汝意云何？道是無性不？須陀洹果乃至諸佛一切種智是無性不？」#95.20
須菩提言：「世尊！道無性，須陀洹果亦無性，乃至諸佛一切種智亦無#95.21性。」#95.22
「須菩提！無性法能得無性法不？」
「不也！世尊！」
佛告須菩提：「有性法能得有性法不？」
「不也！世尊！」
「須菩提！無性法及道──是一切法皆不合不散，無色、無形、無對，一相，所謂無相。#95.23
%90.11 （2）方便慧拔出眾生
須菩提！是菩薩#95.24摩訶薩行般若波羅蜜時，以方便力，見眾生以顛倒故著五眾──無常中常相#95.25、苦中#95.26樂相、不淨中淨相、無我中我相，著無所有處。是菩薩以方便力故，於無所有中拔出眾生。」#95.27
%90.12 （貳）凡夫顛倒故生著
須菩提白佛言：「世尊！凡夫人所著，頗有#95.28實不異不？著故起業，業因緣故，五道生~2739死中不得脫？」#95.29
佛告須菩提：「凡夫人所著起業處，無如毛髮許實事，但顛倒故。#95.30
%90.13 貳、舉七喻明雖有見聞而無垢淨
%90.14 （壹）依喻明理
%90.15 一、如夢喻
須菩提！今為汝說譬喻#95.31，智者以譬喻得解。
須菩提！於汝意云何？如夢中所見人受五欲樂，有實住處不？」#95.32
須菩提白佛言：「世尊！夢尚虛妄、不可得，何況住夢中受五欲樂！」#95.33
「於汝意云何？諸法若有漏若#95.34無漏、若有為若#95.35無為，頗有不如夢者不？」#95.36
「世尊！諸法若有漏若無漏、若有為若無為，無不如夢者。」
佛告須菩提：「於汝意云何？夢中有五道生死往來不？」
「世尊！無也！」
「於汝意云何？夢中有修道，用是修道，若著垢、若得淨不？」#95.37
「不也！世尊！何以故？是夢法無有實事，不可說垢、淨。」#95.38
~2740
%90.16 二、如鏡中像喻
「於汝意云何？鏡中像有實事能起業因緣，用是業因緣墮地獄、餓鬼、畜生#95.39，@t25p722b若人、若天──四天王天處乃至非有想非無想天處不？」#95.40
須菩提言：「不也！世尊！是像無有實事，但誑小兒，是事云何當有業因緣，用是業因緣當墮地獄乃至非有想非無想處？」
「於汝意云何？是鏡中像有修道，用是修道若著垢#95.41、若得淨#95.42不？」
須菩提言：「不也！世尊！何以故？是像空無實事，不可說垢、淨。」
%90.17 三、如響喻
「於汝意云何？如深澗#95.43中有嚮#95.44，是嚮有業因緣，用是業因緣若墮地獄乃至若生非有想非無想處不？」#95.45
須菩提言：「不也！世尊！是事空無有實音聲，云何當有業因緣，用是業因緣墮地獄乃至生非有想非無想處？」
「於汝意云何？是嚮頗有修道，用是修道，若著垢、若得淨不？」
「不也！世尊！是事無實，不可說是垢、是淨。」
%90.18 四、如陽燄喻
「於汝#95.46意云何？如焰非水水相#95.47，非河河相，是炎頗有業因緣，用是業因緣墮地獄乃至生非有想非無想處不？」#95.48
「不也！世尊！焰中水畢竟不可得，但誑無智人眼，云何當有業因緣，用是業墮地獄乃至生非有想非無想處？」
~2741「於汝意云何？是焰有修道，用是修道，若著垢、若得淨不？」
「不也！世尊！是焰無有實事，不可說垢、淨」
%90.19 五、如揵闥婆城喻
「於汝意云何？揵#95.49闥婆城，如日出時見揵闥婆城，無智人無城有城想、無廬觀#95.50有廬觀想、無#95.51園#95.52有園想；是揵闥婆城頗有業因緣，用是業因緣墮地獄乃至生#95.53非有想非無想處不？」
「不也！世尊！是揵闥婆城畢竟不可得，但誑愚夫眼，云何當有業因緣，用是業因緣墮地獄乃至生非有想非無想處？」
「於汝意云何？是揵闥婆城有修道，用是修道，若著垢、若得淨不？」
「不也！@t25p722c世尊！是揵闥婆城無有實事，不可說垢、淨。」
%90.20 六、如幻喻
「須菩提！於汝意云何？幻師幻作種種物──若象、若馬、若牛、若羊、若男、若女，於汝意云何？是幻有業因緣，用是業因緣墮地獄乃至生非有想非無想處不？」
「不也！世尊！是幻法空無實事，云何當有業因緣，用是業因緣墮地獄乃至生非有想非無想處？」
「於汝意云何？用是幻有修道，用是修道，若著垢、若得淨不？」
「不也！世尊！是法無有實事，不可說垢、淨。」
%90.21 七、如化喻
「須菩提！於汝意云何？如佛所化人，是化人有業因緣，用是業因緣墮地獄乃至生非有想非無想處不？」
「不也！世尊！是化人無有實事，云何當有業因緣，用是業因緣墮地獄乃至生非有想非無想處？」
「於汝意云何？是化人有修道，用是修道，若著垢、若得淨不？」
「不也！世尊！是事無有實，不可說垢、淨。」
%90.22 （貳）法說結示：實見者不垢不淨，亦無有垢淨
佛告須菩提：「於#95.54意云何？於是空相中，有垢者、有淨者不？」#95.55
「不也！世尊！是中無所有，無有#95.56著垢者、無有#95.57淨者。」
~2742「須菩提！如無有著垢者、無有#95.58淨者，以是因緣故亦無垢、淨。
何以故？住我、我所眾生有垢、有淨，實見者不垢、不淨。
如實見者不垢、不淨，如是亦無有#95.59垢、淨#95.60。」#95.61
^95.2
#95.98
%91.0 壹、略說平等#95.99
%91.1 （壹）須菩提問
須菩提白佛言：「世尊！見實者不垢不淨，見不實者亦不垢不淨。何以故？一切法性無所有故。
世尊！無所有中無垢無淨，所有中亦無垢無淨。
世尊！無所有中有所有中亦無垢無淨。
世尊！云何如實語者不垢不淨，不實語者亦不垢不淨？」#95.100
%91.2 （貳）佛答
%91.3 一、諸法平等是名淨
佛告須菩提：「是諸法平等相，我說是淨。#95.101
須菩提！何等是#95.102淨#95.103是諸法平等？所謂如、不異、不誑，法相、法性、法住、法位、~2748實際，有佛、無佛法性常住，是名淨。#95.104
%91.4 二、世俗假名說，勝義畢竟空
世諦故說，非最第一義；最第一義，過一切語言論議音聲。」#95.105
%91.5 貳、明平等行
%91.6 （壹）住虛妄分別法，不得成道
%91.7 一、須菩提問
須菩提白佛#95.106言：「世尊！若一切法空、不可說，如夢、如嚮、如焰、如影、如幻、如化，云何菩薩摩訶薩用是如夢、如嚮、如焰、如影、如幻、如化法，無有根本定實，云何能發阿耨多羅三藐三菩提心，#95.107作是願──『我當具足檀波羅蜜，乃至具足般若波羅蜜；我當具足神通波羅蜜，具足智波羅蜜，具足四禪、四無量心、四無色定、四念處，乃至具足八聖道分；我當具足三解脫門、八背捨、九次第定；我當具足佛十力，乃至具足十八不共法；我當具足三十二相、八十隨形好，具足諸陀隣尼門、諸三昧門；我@t25p724b當放大光明遍照十方，知諸眾生心，如應說法』？」
%91.8 二、佛答問顯義#95.108
佛言#95.109須菩提：「於汝意云何？汝所說諸法如夢、如嚮、如焰、如影、如幻、如化不？」#95.110
~2749須菩提言：「爾！世尊！
世尊！若一切法如夢乃至如化，菩薩摩訶薩云何行般若波羅蜜？世尊！是夢乃至如#95.111化，虛妄不實。世尊！不應用不實虛妄法能具足檀波羅蜜乃至十八不共法。」
佛告須菩提：「如是！如是！不實虛妄法不能具足檀波羅蜜乃至十八不共法；行是不實虛妄法，不能得阿耨多羅三藐三菩提。
須菩提！是一切法皆是憶想思惟作法，用是思惟憶想作法，不能得一切種智。#95.112
%91.9 （貳）修性空無相行，但為利益眾生
%91.10 一、一切善法能助道，而知助道法性空如夢如化
須菩提！是一切法能助道法，不能益其#95.113果，#95.114所謂是諸法無生、無出、無相。
菩薩從初發意#95.115已來，所作善業──若檀波羅蜜乃至一切種智。何以故？知諸法皆如夢乃至如化。#95.116
%91.11 二、具足諸道品而不取相，能成就眾生、得無上菩提
如是等法不具足檀波羅蜜乃至一切種智，不能得成就眾生、淨佛國土、得阿耨多羅三藐三菩提。#95.117
~2750是菩薩摩訶薩所作善業──檀波羅蜜乃至一切種智，知如夢乃至如化；亦知一切眾生如夢中行，乃至知如化中行。#95.118
是菩薩摩訶薩不取般若波羅蜜是有法，用是不取故，得一切種智，知是諸法如夢無所取，乃至諸法如化無所取。何以故？般若波羅蜜是不可取相，禪波羅蜜乃至十八不共法是不可取相。#95.119
%91.12 三、但為利益眾生，發心求佛道
%91.13 （一）辨所行
是菩薩摩訶薩知一切法是不可取相已，發心求阿耨多羅三藐三菩提。
何以故？一切法不可#95.120取相，無根本定實，如夢乃至如化；用不可取相法不能得不可取相法。但以眾生不知不見如是諸法相，@t25p724c是菩薩摩訶薩為是眾生故，求阿耨多羅三藐三菩提。#95.121
是菩薩從初發意已來所有布施，為一切眾生故；乃至有所修#95.122智慧，皆為一切眾生，不為己身。菩薩摩訶薩不為餘事故求阿耨多羅三藐三菩提，但為一切眾生故。
%91.14 （二）釋因緣
是菩薩行般若波羅蜜時，見眾生無眾生，但眾生相中住；乃至無知者、無見者，知見相中住，令眾生遠離顛倒；遠離已，置甘露性中；住#95.123是中者#95.124，無有妄相#95.125，所謂眾生相乃至知者、見者相。是時，菩薩動心、念心、戲論心皆捨，常行不動心、不念心、不戲論心。#95.126
~2751須菩提！以是方便力故，菩薩摩訶薩行般若波羅蜜時，自無所著，亦教一切眾生令得無所著。
%91.15 （三）依世俗說，非第一義
世諦故，非第一義。」#95.127
%91.16 參、明平等果
%91.17 （壹）二法分別即是虛妄，無有道果
須菩提白佛言：「世尊！世尊得阿耨多羅三藐三菩提時，得諸佛法，以世諦故得？以第一義中得？」#95.128
佛言：「以世諦故說佛得是法，是法中無有法可得、是人得是法。
何以故？是人得是法，是為大有所得；用二法，無道無果。」#95.129
%91.18 （貳）諸法平等離諸戲論，即是道果
須菩提白佛言：「世尊！若行二法無道無果，行不二法有道有果不？」
佛言：「行二法無道無果，行不二法亦無道無果；若無二法、無不#95.130二法，即是道、即是果。何以故？用如是法得道、得果#95.131，用是法不得道、不得果──是為戲論。諸平等法中，無有戲論；無戲論相，是諸法平等。」#95.132
%91.19 肆、論平等義
%91.20 （壹）離有性、無性，出過一切法；諸法平等性，凡聖不能行不能到
須菩提白佛言：「世尊！諸法無所有性，是中何等是平等？」#95.133
佛言：「若無有法、無有無法，亦不說諸法平等相；除平等，更無餘法離一切法平等相。平等者，若凡夫、若聖人，不能行、不能到。」#95.134
~2752
%91.21 （貳）凡聖平等性無別異，故說佛亦不能行不能到
須菩提白佛言：「世尊！乃至佛亦不能行、亦不能@t25p725a到？」#95.135
佛言：「是諸法平等，一切聖人皆不能行#95.136、不能到，所謂諸須陀洹、斯陀含、阿那含、阿羅漢、辟支佛、諸菩薩摩訶薩及諸佛。」#95.137
須菩提白佛言：「世尊！佛者，一切諸法中行力自在，云何說佛亦不能#95.138行、不能到？」
佛告須菩提：「若諸法平等與佛有異，應當如是問。須菩提！今#95.139諸#95.140凡夫人平等，諸須陀洹、斯陀含、阿那含、阿羅漢、辟支佛、諸菩薩摩訶薩、諸佛及聖法皆平等，是#95.141一平等#95.142無二，所謂是凡夫人、是須陀洹乃至佛──是一切法平等中皆不可得。」#95.143
%91.22 （參）平等中無差別，世諦故有差別
須菩提白佛言：「世尊！若諸法平等中皆不可得──是凡夫人乃至是佛。世尊！凡夫人、須陀洹乃至佛為無有分別？」#95.144
佛告須菩提：「如是！如是！諸法平等中，無#95.145有分別是凡夫人、是須陀洹乃至是佛。」
~2753
%91.23 伍、明有一切教門
%91.24 （壹）須菩提總問
「世尊！若無分別諸凡夫人、須陀洹乃至佛，云何分別有三寶現於世間#95.146──佛寶、法寶、僧寶？」
%91.25 （貳）佛答
%91.26 一、三寶即是平等，而佛有方便力，於空無相中分別是凡夫、是聖人
佛言：「於意云何？佛寶、法寶、僧寶與諸法等異不？」#95.147
須菩提白佛言：「如我從佛所聞義，佛寶、法寶、僧寶與諸法等無#95.148異。
世尊！是佛寶、法寶、僧寶即是平等；是法皆不合、不散，無色、無形、無對，一相，所謂無相。
佛有是力，能分別無相諸法處所：是凡夫人、是須陀洹、是斯陀含、是阿那含、是阿羅漢、是辟支佛、是菩薩摩訶薩、是諸佛。」#95.149
%91.27 二、若佛不為眾生分別諸法相，眾生不能如實知其相
佛告須菩提：「如是！如是！諸佛得阿耨多羅三藐三菩提，不分別諸法，當知#95.150是地獄、是餓鬼、是畜生、是人、是天──是四天王天乃至是他化自在天，是梵天乃至是非有想非無想處天#95.151；是四念處乃至八聖道分；是內空乃至是無法有法空；是佛十力乃至是十八@t25p725b不共法不？」#95.152
須菩提言：「不知也！世尊！」
「以是故，須菩提！當知佛有大恩力，於諸法#95.153等中不動，而分別諸法。」#95.154
%91.28 陸、明一切法平等
%91.29 （壹）須菩提問
~2754
%91.30 一、明理：凡聖皆於平等中不動
須菩提白佛言：「世尊！如佛於諸法等中不動，凡夫人亦於諸法平等中#95.155不動，須陀洹乃至辟支佛亦於諸法平等中不動。
%91.31 二、興難：諸法各各相，云何菩薩行般若時不分別，若不作分別，云何能成道
世尊！若諸法等相即是凡夫人相、即是須陀洹相，乃至諸佛即是平等相，世尊！今諸法各各相，所謂色相異，受、想、行、識相異；眼相異，耳、鼻、舌、身、意相異；地相異，水、火、風、空、識相異；欲相異，瞋、癡相異，邪見相異；禪相異，無量心相異，無色定相異；四念處相異，乃至八聖道分相異；檀波羅蜜相異，乃至般若波羅蜜相異；三解脫門相異；十八空相異；佛十力相異，四無所畏相異，四無礙智相異，十八不共法相異；有為法性異，無為法性異；是凡夫人相異，乃至佛相異──諸法各各相異#95.156，云何菩薩摩訶薩行般若波羅蜜時，諸法異相中不作分別？若不作分別，不能行般若波羅蜜；若不行般若波羅蜜，不能從一地至一地；若不從一地至一地，不能入菩薩位；不能入菩薩位故，不能過聲聞、辟支佛地；不能過聲聞、辟支佛地故，不能具足神通波羅蜜；不具足神通波羅蜜故#95.157，不能#95.158具足檀波羅蜜，乃至不能具足般若波羅蜜，從一佛國至一佛國供養諸佛，於諸佛所種善根，用是善根能成就眾生、淨佛國土。」#95.159
%91.32 （貳）佛答：諸法皆空無異相，當知諸法平等，非即非離
佛告須菩提：「如汝所問：『是諸法相亦是凡夫人，亦是須陀洹乃至佛。世尊！是諸法各各相，所謂色相異，乃至有為、無為法相異，云何菩薩摩訶薩觀一@t25p725c相不作分別？』#95.160須菩提！於汝意云何？是色相空不？乃至諸佛相空不？」
「世尊！實空。」
「須菩提！空中各各相法可得不？所謂色相乃至諸佛相。」#95.161
~2755須菩提言：「不可得！」
佛言：「以是因緣故，當知諸法平等中，非凡夫人、亦不離凡夫人，乃至非佛、亦不離佛。」#95.162
%91.33 柒、明平等相
%91.34 （壹）諸法平等相，非有為、非無為
%91.35 一、正說
須菩提白佛言：「世尊！是平等，為是有為法？為是無為法？」
佛言：「非有為法，非無為法。
%91.36 二、釋因
何以故？離有為法，無為法不可得；離無為法，有為法不可得。
須菩提！是有為法#95.163、無為法#95.164，是二法不合、不散，無色、無形、無對，一相，所謂無相。#95.165
%91.37 （貳）以世諦故說，非以第一義
佛亦以世諦故說，非以第一義。
何以故？第一義中無身行、無口行、無意行，亦不離身、口、意行得第一義。是諸有為法、無為法平等相，即是第一義。#95.166
%91.38 （參）菩薩於第一義中不動而利益眾生
菩薩摩訶薩行般若波羅蜜時，第一義中不動，而行#95.167菩薩事，饒益眾生。」#95.168
^96.1
%92.0 壹、約法性平等論化眾生義#96.3
%92.1 （壹）以二空化導眾生#96.4
%92.2 一、須菩提問〔以第一義悉檀難〕
須菩提白佛言：「世尊！若諸法平等、無所為作，云何菩薩摩訶薩行般若波羅蜜，於平等#96.5中不動而行菩薩事，以布施、愛語、利益、同事？」#96.6
%92.3 二、佛答〔以對治悉檀辨〕#96.7
~2767
%92.4 （一）述成
佛告須菩提：「如是！如是！如汝所說#96.8：『是諸法平等、無所作。』#96.9
%92.5 （二）眾生無知故，以二空教化
%92.6 1、示眾生空
若是眾生自知諸法平等，佛不用神力，於諸法平等中不動而拔出眾生吾我想#96.10，以空度五道生死乃至知者、見者相；
%92.7 2、示法空
度@t25p728c色相乃至識相，眼相乃至意相，地種相乃至識種相；遠離有為性相，令得無為性相──無為性相即是空。」#96.11
%92.8 （貳）明所用空：遠離一切法相，知諸法空#96.12
須菩提言：「世尊！用何等空故一切法空？」
佛言：「菩薩遠離一切法相，用是空故一切法空。#96.13
%92.9 貳、諸法如化，而隨機施教分別說
%92.10 （壹）諸法如化無差別
須菩提！於汝意云何？#96.14若有化人作化人，是化#96.15頗有實事不空者不？」
~2768須菩提言：「不也！世尊！是化人無有實事而不空。」#96.16
「是空及化人二事不合不散#96.17，以空空故空，不應分別是空、是化。
何以故？是二事等，空中不可得──所謂是空、是化。
所以者何#96.18？須菩提！色即是化，受、想、行、識即是化，乃至一切種智即是化。」#96.19
%92.11 （貳）諸法如化而有差別#96.20
%92.12 一、須菩提問〔依出世間法、涅槃及三乘聖者難〕
須菩提白佛言：「世尊！若世間法是化，出世間法#96.21，所謂四念處、四正勤、四如意足、五根、五力、七覺分、八聖道分，三解脫門，佛十力、四無所畏、四無礙智、十八不共法，并諸法果；及賢聖人，所謂須陀洹、斯陀含、阿那含、阿羅漢、辟支佛，菩薩摩訶薩、諸佛。世尊！是法亦是化不？」#96.22
%92.13 二、佛答
%92.14 （一）總說諸法空如化
佛告須菩提：「一切法皆是化。
%92.15 （二）別辨種種變化事
於是法中，有聲聞法變化，有辟支佛法變化，有菩薩摩訶薩法變化，有諸佛法變化，~2769有煩惱法變化，有業因緣法變化。
%92.16 （三）結
以是因緣故，須菩提！一切法皆是化。」#96.23
 %92.17 （參）為新發意者先分別生滅者如化、不生滅者不如化，後示本性空寂
　%92.18 一、為新發意者說有為如化、涅槃不如化
%92.19 （一）具生滅之法必是變化#96.24
須菩提白佛#96.25言：「世尊！是諸#96.26煩惱斷，所謂須陀洹果、斯陀含果、阿那含果、阿羅漢果、辟支佛；佛道，斷諸煩惱習──皆#96.27是變化不？」#96.28
佛告須#96.29菩提：「若有法生滅相者，皆是變化。」#96.30
%92.20 （二）為新發意者說無生滅之涅槃不如化
%92.21 1、正明
須菩提言：「世尊！何等法非變化？」
佛言：「若法無生無滅，是非變化。」
須菩提言：「何等是不生不滅非變化？」
佛言：「無誑相涅槃，是法非變化。」#96.31
%92.22 2、釋因：為新發意者說「涅槃非如化」
%92.23 （1）須菩提問
「世尊！如佛自說#96.32：『諸法平等，非聲聞作、非辟支佛作、非諸菩薩摩訶@t25p729a~2770薩作、非諸佛作，有佛、無佛諸法性常空。』性空即是涅槃，云何言『涅槃一法非如化』？」#96.33
%92.24 （2）佛答
%92.25 A、述成空義
佛告須菩提：「如是！如是！諸法平等，非聲聞所作，乃至性空即是涅槃。
%92.26 B、明理：為新發意者而分別說
若新發意菩薩聞是一切法皆畢竟性空乃至涅槃亦皆如化，心則驚怖；為是新發意菩薩故，分別生滅者如化、不生滅者不如化。」#96.34
%92.27 二、示新發意菩薩法性本空
須菩提白佛言：「世尊！云何教新發意菩薩，令知是性空？」
佛告須菩提：「諸法本有今無耶？」#96.35
^96.2
%93.0 壹、明求般若應如薩陀波崙#96.79
佛告須菩提：「菩薩摩訶薩求般若波羅蜜，當如薩陀波崙菩薩摩訶薩。是菩薩今在大雷音佛所行菩薩道。」
%93.1 貳、明薩陀波崙菩薩求般若相
%93.2 （壹）廣明求法之相
%93.3 一、明求法感應
%93.4 （一）精誠致感空中聲應
%93.5 1、內忘身命，外遣名利
須菩提白佛#96.80言：「世尊！薩陀波崙菩薩摩訶薩#96.81云何求般若波羅蜜？」
佛言：「薩陀波崙菩薩摩訶薩本求般若波羅蜜時，不惜身命，不求名利。#96.82
~2780
%93.6 2、勸誡
於空閑林中，聞空中聲言：『汝善男子！從是東行，莫念疲極，莫念睡眠，莫念飲食，莫念晝夜，莫念寒熱，莫念內外。
善男子！行時莫觀左右。汝行時莫壞身相，莫壞色相，莫壞受、想、行、識相。何以故？若壞是諸相，則於佛法有礙；若於佛法有礙，便往來五道生死中，亦不能得般若波羅蜜。』#96.83
%93.7 3、發願
爾時，薩陀波崙菩薩報空中聲#96.84言：『我當從#96.85教！何以故？我欲為一切眾生作大明，欲集一切諸佛法，欲得阿耨多羅三藐三菩提故。』#96.86
%93.8 4、正勸
%93.9 （1）勸重法
%93.10 A、勸信三解脫門
薩陀波崙菩薩復聞空中聲言：『善哉！善哉！善男子！汝於空、無相、無作之法，應#96.87生信心；
%93.11 B、勸離相求
以離相心求般若波羅蜜──離我相乃至離知者、見者相。
%93.12 （2）勸尊人
%93.13 A、勸
~2781
%93.14 （A）明真善友相
當遠離惡知識，當親近供養善知識。
何等是善知識？能說空、無相、無作、無生、無滅法及一切種智，令人心入歡喜信樂，是為善知識。#96.88
%93.15 （B）明近善友益
善男子！汝若如是行，不久當聞般若@t25p731b波羅蜜──若從經卷中聞，若從菩薩所說聞。
%93.16 （C）勸當知恩，視師如佛
善男子！汝所從聞是般若波羅蜜處，應生心如佛想。
善男子！汝當知恩，應作是念：「所從聞是般若波羅蜜者，即是我善知識。
我用聞是法故，疾得不退轉於阿耨多羅三藐三菩提，親近諸佛，常生有佛國中，遠離眾難，得具足無難處。」
善男子！當思惟籌量是功德，於所從聞法處，應#96.89生心如佛想。#96.90
%93.17 B、誡
%93.18 （A）莫以世利心隨逐法師
汝善男子！莫以世利心故隨逐法師，但為愛法、恭敬法故，隨逐說法菩薩。
%93.19 （B）勿見師過，當觀諸法實相無垢淨
%93.20 a、知師方便受五欲
爾時，當覺知魔事：
若惡魔與說法菩薩作五欲因緣，假為法故令受；若說法菩薩入實法門，以德力故受而無所染。
又以三事#96.91故受是五欲──以方便力故，欲令眾生種善根故，欲與眾生同其事故。
~2782汝於是中莫生污#96.92心，當起淨想！
自念：「我未知漚和拘舍羅#96.93，大師以方便法，為度眾生、令得福德故，受是諸欲，於智慧無著無礙，不為欲染。」#96.94
%93.21 b、觀諸法實相無垢淨
善男子！即當觀諸法實相。諸法實相者，所謂一切法不垢不淨。何以故？一切法自性空，無眾生、無人、無我，一切法如幻、如夢、如響、如影、如炎、如化。
善男子！觀是諸法實相已，當隨法師，汝不久當成就般若波羅蜜。
%93.22 （C）若師對求法者都不顧念，亦莫生怨恨
復次，善男子！汝當復覺知魔事#96.95：若說法菩薩見欲受般若波羅蜜人，意不存念，汝不應起心#96.96怨恨；汝但當以法故恭敬，莫起厭懈意，常應隨逐法師。』#96.97
^97.1
$$貳、明薩陀波崙菩薩求般若相（承上卷96）
$$（壹）廣明求法之相（承上卷96）
$$一、明求法感應（承上卷96）
$$（一）精誠致感空中聲應（承上卷96）
%93.86 （二）悲啼致感空中佛現
%93.87 1、初感
%93.88 （1）法
爾時，薩陀波崙#97.2菩薩受是空中教已，從是東行。不久，復作是念：『我云何不問空中聲：「我當何處去？去當遠近？當從誰聞般若波羅蜜？」』是時即住，啼哭憂愁，作是念：『我住是中，過一日一夜，若二、三、四、五、六、七日七夜#97.3，不念疲極，乃至不念飢渴、寒熱，不聞聽受般若波羅蜜因緣，終不起也！』#97.4
%93.89 （2）譬
須菩提！譬如人有一子卒#97.5死，憂愁苦毒，唯懷懊惱，不生餘念。
%93.90 （3）合
如是，須菩提！薩陀波崙菩薩爾時無有異心，但念：『我何時當得聞般若波羅蜜？我云何不問空中聲：「我應何處去？去當遠近？當從誰聞般若波羅蜜？」』
~2794
%93.91 2、初應
%93.92 （1）稱歎安慰#97.6
須菩提！薩陀波崙菩薩如是愁念時，空中有佛語薩陀波崙菩薩言：『善哉！善哉！善男子！過去諸佛行菩薩道時，求般若波羅蜜，亦如汝今日。#97.7
%93.93 （2）答其三問
%93.94 A、答遠近
善男子！汝以是勤精進愛樂法故，從是東行#97.8，去此五百由旬#97.9，
%93.95 B、答何處去#97.10
%93.96 （A）明國土
%93.97 a、明通處［眾香城］#97.11
%93.98 （a）明城莊嚴
有城名眾香。其城七重，七寶莊嚴；臺觀、欄#97.12楯#97.13，皆以七寶校飾#97.14；七寶之塹#97.15，七寶行樹，周匝七重。其城縱廣十二由旬，豐樂安靜，人民熾盛#97.16；~2795五百市里，街巷相當，端嚴如畫#97.17，橋津#97.18如地，寬博清淨。七重城上，皆有七寶樓櫓#97.19，寶樹行列，以黃金、白銀、車𤦲#97.20、馬瑙#97.21、珊瑚、琉璃、頗梨#97.22、紅色真珠以為枝葉。寶繩連綿，金為鈴網，以覆城上。風吹@t25p734b鈴聲，其音和雅，娛樂眾生；譬如巧作五樂，甚可悅#97.23喜#97.24。#97.25
%93.99 （b）流池莊嚴
其城四邊，流池清淨，冷暖調適；中有諸船，七寶嚴飾；是諸眾生宿業所致，乘此寶船娛樂遊戲。諸池水中種種蓮華──青、黃、赤、白，眾雜好華遍覆水上，是三千大千世界所有眾華皆在其中。
%93.100 （c）園觀莊嚴
其城四邊有五百園#97.26觀，七寶莊嚴，甚可愛樂。一一園中，各有五百池，池#97.27各縱廣十里，皆以七寶校成，雜色莊嚴。諸池水中亦有青、黃、赤、白蓮華彌#97.28覆水上；其諸蓮華大如車輪，青色青光、黃色黃光、赤色赤光、白色白光。諸池水中鳧#97.29鴈、鴛鴦，異類眾鳥，音聲相和。
是諸園觀適#97.30無所屬，是諸眾生宿業所致，長夜信樂深法，行般若波羅蜜因緣故，受是果報。#97.31
~2796
%93.101 b、明別處即曇無竭宮舍
善男子！是眾香城中有大高#97.32臺，曇無竭菩薩摩訶薩宮舍在上#97.33。
其宮縱廣一由旬，皆以七寶校#97.34成，雜色莊嚴，甚可喜樂。垣#97.35牆七重，皆亦七寶；七重#97.36欄#97.37楯，七寶樓閣；寶塹七重，皆亦七寶；周圍#97.38深塹，七寶累#97.39成；七重行樹，七寶枝葉，七重圍繞。#97.40
其宮舍中，有四種娛樂園：一名常喜，二名離憂，三名華飾，四名香飾。一一園中各有八池：一名賢，二名賢上，三名歡喜，四名喜上，五名安隱，六名多安隱，七名遠離，八名阿鞞跋致。
諸池四邊，面各一寶──黃金、白銀、琉璃、頗梨；玟#97.41㻁#97.42為池底#97.43，#97.44其上布金沙。一一池側有八梯陛#97.45，種種妙寶以為嚴飾；諸梯陛間，有閻浮檀金芭蕉行樹。#97.46
~2797一切池中種種蓮華──青、黃、赤、白，彌覆水上；諸池四邊，生好華樹；風吹諸華，墮池水中。其池成就八種功德#97.47，香若栴#97.48檀，色、味@t25p734c具足#97.49。
%93.102 （B）明人物
%93.103 a、明受俗樂
曇無竭菩薩與六萬八千婇女，五欲具足，共相娛樂；及城中男女俱入常喜等園、賢等池中，五欲具足，共相娛樂。#97.50
%93.104 b、明受法樂
%93.105 （a）敬法供養
善男子！曇無竭菩薩與諸婇女遊戲娛樂已，日三時說般若波羅蜜。
眾香城內#97.51男女大小，於其城中多聚人處敷#97.52大法座。其座四足，或以黃金、或以白銀、或以琉璃、或以頗梨，敷以綩#97.53綖#97.54，雜色茵褥#97.55，垂諸幃#97.56帶；以妙白㲲#97.57而覆其上，散以種種雜妙花香；座高五里，張白珠帳#97.58。其池#97.59四邊，~2798散五色花，燒眾名香，澤香塗地#97.60，供養、恭敬般若波羅蜜故。
曇無竭菩薩於此座上說般若波羅蜜；彼諸人眾如是恭敬供養曇無竭，為聞般若波羅蜜故。#97.61
%93.106 （b）明受法益
於是大會百千萬眾，諸天、世人一處和集，中有聽者，中有受者，中有持者，中有誦者，中有書者，中有正觀者，中有如說行者。
當是時中#97.62，眾生以是因緣故，皆不墮惡道，不退轉於阿耨多羅三藐三菩提。#97.63
%93.107 C、答當從誰聞
汝善男子！往趣曇無竭菩薩，當聞般若波羅蜜。
善男子！曇無竭菩薩世世是汝善知識，能教汝阿耨多羅三藐三菩提，示、教、利、喜。是曇無竭菩薩本求般若波羅蜜時，亦如汝今。
汝去莫計晝夜，莫生#97.64障礙心，汝不久當得聞般若波羅蜜！』
%93.108 3、第二感#97.65
%93.109 （1）法
爾時，薩陀波崙菩薩摩訶薩歡喜心悅，作是念：『我當何時得見是善男子，得聞般若波羅蜜？』#97.66
%93.110 （2）譬
~2799須菩提！譬如有人為毒箭所中，更無餘念，唯念#97.67：『何時當得良醫，拔出毒箭，除我此苦？』
%93.111 （3）合
如是，須菩提！薩陀波崙菩薩摩訶薩更無餘念，但作是願：『我何時當得見曇無竭菩薩，令我得聞般若波羅蜜？我聞是般若波羅@t25p735a蜜，斷諸有心。』#97.68
%93.112 4、第二應
是時，薩陀波崙菩薩於是處住念曇無竭菩薩，一切法中得無礙知見已#97.69，即得無量三昧門現在前，所謂（1）諸法性觀三昧，#97.70（2）諸法性不可得三昧，#97.71（3）破諸法無明三昧，#97.72（4）諸法不異三昧，（5）諸法不壞自在三昧，（6）諸法能照明三昧，（7）諸法離闇三昧，#97.73（8）諸法無異相續三昧，#97.74（9）諸法不可得三昧，（10）散華三昧，（11）諸法無我三昧，（12）如幻威勢三昧，（13）得如鏡像#97.75三昧，（14）得一切眾生語言三昧，（15）一切眾生歡喜三昧，（16）入分別音聲三昧，（17）得種種語言字句莊嚴三昧，（18）無畏三昧，（19）性常默然三昧，（20）得無礙解脫三昧，（21）離塵垢三昧，（22）名字語句莊嚴三昧，（23）見諸法三昧，（24）諸法無礙頂三昧，（25）如虛空三昧，（26）如金剛三昧，#97.76（27）不畏著色三昧，（28）得勝三昧，（29）轉眼三昧，（30）畢法性三昧，（31）能與安隱三昧，（32）師子吼三昧，（33）勝一切眾生三昧，（34）華莊嚴三昧，（35）斷疑三昧，（36）隨一切堅固三昧，（37）出諸法得神通力無畏三昧，（38）能達諸法三昧，（39）諸法財印三昧，（40）諸法無分別見三昧，（41）離諸見三昧，（42）離一切闇三昧，（43）離一切相三昧，（44）解脫一~2800切著三昧，（45）除一切懈怠三昧，（46）得深法明三昧，（47）不可奪三昧，（48）破魔三昧，（49）不著三界三昧，（50）起光明三昧，（51）見諸佛三昧。#97.77
薩#97.78陀波崙菩薩住是諸三昧中#97.79，即見十方無量阿僧祇諸佛為諸菩薩摩訶薩說般若波羅蜜。
^98.1
$$貳、明薩陀波崙菩薩求般若相（承上卷96）
$$（壹）廣明求法之相（承上卷96）
$$一、明求法感應（承上卷96）
$$（一）精誠致感空中聲應（承上卷96）
$$（二）悲啼致感空中佛現（承上卷97）
%93.152 （三）得無量三昧，感十方佛現#98.2
%93.153 1、稱歎安慰
是時，十方諸佛安慰薩陀波崙菩薩言：『善哉！善哉！善男子！我等本行菩薩道時，求般若波羅蜜，得是諸三昧，亦如汝今所得。我等得是諸三昧，善入般若波羅蜜，成就方便力，住阿鞞跋致地。
%93.154 2、破其著心
%93.155 （1）得是般若，不念有是諸法
我等觀是諸三昧性，不見有法出三昧、入三昧者，亦不見行佛道者，亦不@t25p738a見得阿耨多羅三藐三菩提者。善男子！是名般若波羅蜜，所謂不念有是諸法。#98.3
~2811
%93.156 （2）眾德無量，不能取相說盡
善男子！我等於無所念法中住，得是金色身、丈#98.4六#98.5光明、三十二相、八十隨形好、不可思議智慧、無上戒、無上三昧、無上智慧，一切#98.6功德皆悉具足。一切功德具足故，佛尚不能取相說盡，何況聲聞、辟支佛及諸餘人！#98.7
%93.157 3、重勸尊法敬人
%93.158 （1）明善知識之重要
以是故，善男子！於是佛法中，倍應恭敬愛念，生清淨心；於善知識中，應生如佛想。
何以故？為善知識守護故，菩薩疾得阿耨多羅三藐三菩提。』#98.8
%93.159 （2）諸佛示知曇無竭菩薩是善知識
是時，薩陀波崙菩薩白十方諸佛言：『何等是我善知識所應親近供養者？』
十方諸佛告薩陀波崙菩薩言：『汝善男子！曇無竭菩薩世世教化成就汝阿耨多羅三藐三菩提；曇無竭菩薩守護汝，教汝般若波羅蜜、方便力，是汝善知識。#98.9汝供養曇無竭菩薩，若一劫、若二劫#98.10、若三劫#98.11，乃至過百千#98.12劫，頂戴恭敬；以一切樂具，三千世界中所有妙色、聲、香、味、觸，盡以供養，未能報須臾#98.13之恩。
何以故？曇無竭菩薩摩訶薩因緣故，令#98.14汝得如是等諸三昧，得般若波羅蜜、方便力。』
%93.160 4、諸佛教化，令歡喜已，忽然不現
諸佛如是教化安慰薩陀波崙菩薩，令歡喜已，忽然不現。
~2812
%93.161 二、求般若、尋善友#98.15
%93.162 （一）因不見佛而生疑
是時，薩陀波崙菩薩從三昧起已#98.16，不復見佛，作是念：『是諸佛從何所來？去至何所？』不見諸佛故，復惆悵#98.17不樂：『誰斷我疑？』
復作是念：『曇無竭菩薩久遠已來，常行般若波羅蜜，得方便力及諸#98.18陀羅尼，於菩薩法中得自在，多供養過去諸佛，世世為我師、常利益我，我當問曇無竭菩薩，諸佛從何所來？去至何所#98.19？』
%93.163 （二）賣身供養
%93.164 1、欲賣身得財，以供養曇無竭菩薩及般若
爾@t25p738b時，薩陀波崙菩薩於曇無竭菩薩生恭敬、愛樂、尊重心，作是念：『我當以何供養曇無竭菩薩？今我貧窮，無#98.20華香、瓔珞、燒香、澤#98.21香、衣服、幡蓋、金、銀、真珠、琉璃、頗梨#98.22、珊瑚、虎#98.23珀#98.24──無有如是等物可以供養般若波羅蜜及說法師曇無竭菩薩。我法不應空往曇無竭菩薩所，我若空往，喜悅心不生。我當賣身得財，為般若波羅蜜故，供養法師曇無竭菩薩。何以故？我世世喪身無數，無始生死中或死、或賣，或為欲因緣故，世世在地獄中受無量苦惱，未曾為清淨法故、為供養說法師故喪身。』#98.25
~2813
%93.165 2、魔蔽眾人，令不聞聲，以障其事
%93.166 （1）魔作念欲壞
是時，薩陀波崙菩薩中道入一大城，至市肆#98.26上，高聲唱言：『誰欲須人？誰欲須人？誰欲買人？』
爾時，惡魔作是念：『是薩陀波崙愛法故，自欲#98.27賣身，為般若波羅蜜故，供養曇無竭菩薩，當得正問般若波羅蜜及方便力#98.28：「云何菩薩摩訶薩行般若波羅蜜，疾得阿耨多羅三藐三菩提？」當得多聞具足，如大海水，是時不可沮#98.29壞#98.30，得具足一切功德，饒益諸菩薩摩訶薩；為阿耨多羅三藐三菩提故，過我境界，亦教餘人出我境界，得阿耨多羅三藐三菩提。我今當壞其事！』#98.31
%93.167 （2）城民受魔障，除一長者女
爾時，惡魔隱#98.32蔽諸婆羅門、居士，令不聞其自賣聲；除一長者女，魔不能蔽#98.33。
%93.168 （3）常啼賣身不成而憂泣
爾#98.34時，薩陀波崙賣身不售#98.35，憂愁啼哭，在一面立，涕泣#98.36而言：『我為大罪，賣身不售。我自賣身，為般若波羅蜜故，供養曇無竭菩薩。』#98.37
~2814
%93.169 3、帝釋化身以往試，常啼得其所願而心喜
%93.170 （1）帝釋化婆羅門身試問
爾時，釋提桓因作是念：『是薩陀波崙菩薩愛法自賣其身，為般若波羅蜜故，欲供養曇無竭菩薩。我當試之，知是善男子實以深心愛法故，捨是身@t25p738c不？』
是時，釋提桓因化作婆羅門身，在薩陀波崙菩薩邊行，問言：『汝善男子！何以憂愁啼哭，顏色焦#98.38悴#98.39，在一面立？』
答言：『婆羅門！我愛敬法，欲#98.40自賣身為般若波羅蜜故，欲供養曇無竭菩薩。今我賣身，無有買者，自念薄福，無財寶物，欲自賣身，供養般若波羅蜜及曇無竭菩薩，而無買者。』
%93.171 （2）帝釋假稱須血髓，常啼心喜而相與
爾時，婆羅門語薩陀波崙菩薩言：『善男子！我不須人。我今#98.41欲祠#98.42天，當須人心、人血、人髓，汝能賣與我不？』
爾時，薩陀波崙菩薩作是念：『我得大利，得第一利！我今便為具足般若波羅蜜方便力，得是買心、血、髓者！』是時，心大歡喜，悅樂無憂；以柔和心，語婆羅門言：『汝所須者，我盡與汝！』
婆羅門言：『善男子！汝須何價？』
答言：『隨汝意與我！』
即時，薩陀波崙右手執利刀，刺左臂出血，割右髀#98.43肉，復#98.44欲破骨出髓。
%93.172 （三）值善友，得財供養
%93.173 1、長者女遙見其事，往其處以問因緣
%93.174 （1）為求法供養師故割肉出髓
時有一長者女，在閣上遙見薩陀波崙菩薩自割身體、不惜壽命，作是念：『是善男子何因緣故，困苦其身？我當往問。』
長者女即下閣，到薩陀波崙所，問言：『善男子！何因緣困苦其身？用是心、血、髓，作何等？』
薩陀波崙答言：『賣與婆羅門，為般若波羅蜜故，供養曇無竭菩薩。』
%93.175 （2）欲上求下化，故不惜自身
長者女言：『善男子！作是賣身，欲自出心、血、髓，欲供養曇無竭菩薩，得何等功德利益#98.45？』
薩陀波崙答言：『善女人！是人善學般若波羅蜜及方便力，是人當為我說菩薩所應~2815作、菩薩所應#98.46行道。我學是法、學是道，得阿耨多羅三藐三菩提時，為眾生作依止；當得金色身、三十二相、八十隨形好、大#98.47光、無量明，大慈、大悲、大喜、大捨，四無所畏，佛十@t25p739a力、四無礙智、十八不共法，六神通，不可思議清淨戒、禪定、智慧，得阿耨多羅三藐三菩提，於諸法中得無礙一切知#98.48見；以#98.49無上法寶分布與一切眾生。如是等諸功德利，我當從彼得之。』
%93.176 2、長者女歎所說，願供所須並隨行
%93.177 （1）長者女聞妙法心極喜
是時，長者女聞是上妙佛法，即#98.50大歡喜，心驚毛竪，語#98.51薩陀波崙菩薩言：『善男子！甚希有！汝所說者，微妙難值！為是一一#98.52功德#98.53法故，應捨如恒河沙等身。何以故？汝所說者，甚大微妙！#98.54
%93.178 （2）願供所須並隨行
汝善男子！汝今所須，盡當相與──金、銀、真珠、琉璃#98.55、頗梨、虎珀、珊瑚等諸珍寶物，及華香、瓔珞、塗香、燒香、幡蓋、衣服、伎樂等供養之具，供養般若波羅蜜及曇無竭菩薩。
汝善男子！莫自困苦其身！我亦欲往曇無竭菩薩所，共汝植諸善根，為得如是微妙法，如汝所說故。』
%93.179 3、帝釋讚許常啼，令其身平復如故
爾時，釋提桓因即復本身，讚薩陀波崙菩薩言：『善哉！善哉！善男子！汝堅受是事，其心不動。諸過去佛行菩薩道時，亦如是求般若波羅蜜及方便力，得阿耨多羅三藐三菩提。善男子！我實不用人心、血、髓，但來相試；汝願何等，我當相與。』
薩陀波崙言：『與我阿耨多羅三藐三菩提！』
釋提桓因言：『此非我力所辦，是諸佛境界。必相#98.56供養，更索餘願。』#98.57
~2816薩陀波崙言：『汝若於此無力，汝必見供養，令我是身平復如故。』#98.58
是時，薩陀波崙身即平復，無有瘡瘢#98.59，如本不異。
釋提桓因與其願已，忽然不現。
%93.180 4、長者女領其歸舍，以所見白父母，更明心之所向
%93.181 （1）長者女領其歸舍，從父母求所須物
爾時，長者女語薩陀波崙菩薩言：『善男子！來到我舍，有所須者，從我父母索之，盡當相與。我亦當辭#98.60我父母，與諸侍女#98.61，共往#98.62供養曇無竭菩薩，為求法故。』
即時，薩陀波崙菩@t25p739b薩與長者女俱到其舍，在門外住。
長者女入白父母：『與我眾妙花香及諸瓔珞、塗香、燒香、幡蓋、衣服、金、銀、琉璃、頗梨、真珠、珊瑚、虎珀及諸伎樂供養之具；亦聽#98.63我身及五百侍女先所給使，共薩陀波崙菩薩到曇無竭菩薩所，為供養般若波羅蜜故。曇無竭菩薩當為我等說法，我當如說行，當得諸佛法。』
%93.182 （2）長者女如所見聞向父母說
女父母語女言：『薩陀波崙菩薩是何等人？』
女言：『是人今在門外。是善男子以深心求阿耨多羅三藐三菩提，欲度一切眾生無量生死苦。是善男子為法故，自賣其身，供養般若波羅蜜──般若波羅蜜名菩薩所學道。為供養般若波羅蜜及供養曇無竭菩薩故，在市肆上高聲唱言：「誰須人？誰須人？誰欲買人？」賣身不售，在一面立，憂愁啼哭。
是時，釋提桓因化作婆羅門來、欲試之，問言：「善男子！何以#98.64憂愁啼哭，一面立？」
答言：「婆羅門！我欲賣身，為供養般若波羅蜜及曇無竭菩薩摩訶薩故，而我薄福，賣身不售。」
婆羅門語是善男子#98.65：「我不須人。我欲祠天，當用人心、人血、人髓，汝能賣不？」
~2817是時，是善男子不復憂愁，其心和悅，語是婆羅門言#98.66：「汝之所須，我盡#98.67相與。」
婆羅門言：「汝須何價#98.68？」
答言：「隨汝意與我。」
即時，是善男子右手執利刀，刺左臂出血，割右髀#98.69肉，復欲破骨出髓。
我在閣上，遙見是事；我爾時作是念：「是人何故困苦其身？我當往問。」
我即下閣往問：「善男子！汝何因緣故自困苦其身？」
是善男子答我言：「姊！我為法故，欲#98.70供養般若波羅蜜及曇無竭菩薩說法者。我貧窮無所有，無金、銀、@t25p739c琉璃、車#98.71磲#98.72、馬#98.73碯、珊瑚、虎珀、玻#98.74梨#98.75、真珠、花香、伎樂。姊！我為供養法故#98.76，自賣其身。今得買者，須人心、人血、人髓。我用是價，供養般若波羅蜜及曇無竭菩薩說法者。」
我問是善#98.77男子：「汝今自出身心、血、髓，欲供養曇無竭菩薩，得何功德？」
是善男子言：「曇無竭菩薩當為我說般若波羅蜜及方便力，此是菩薩所應學、菩薩所應作、菩薩所應住、菩薩#98.78所行道。我當學是道，得阿耨多羅三藐三菩提，為一切眾生作依止。
我當得金色身、三十二相、八十隨#98.79形好、大#98.80光、無量明，大慈、大悲、大喜、大捨，四無所畏、四無礙智，佛十力、十八不共法，六神通，不可思議清淨戒、禪定、智慧；得阿耨多羅三藐三菩提，於諸法中得無礙一切知見；以無上法寶分布#98.81與一切眾生。如是等微妙大法，我當從彼得之。」
我聞是微妙不可思議諸佛功德，聞其大願，我心歡喜，作是念：「是清淨、微妙、甚#98.82大、希有！乃至#98.83如是為#98.84一一法故，應捨如恒河沙等身。今#98.85善男子為法能受~2818苦行難事，所謂不惜身命；我多有妙寶，云何不生願，勤求如是法，供養般若波羅蜜及曇無竭菩薩？」
我如是思惟已，語薩陀波崙菩薩：「汝善男子！莫困苦其身。我當白我父母，多與汝金、銀、琉璃、車磲、馬瑙、珊瑚、虎珀、頗#98.86梨、真珠、花香、瓔珞、塗香、末#98.87香、衣服、旛蓋及諸伎#98.88樂，供養般若波羅蜜及曇無竭菩薩說法者。我亦求父母，與諸侍女，共汝俱去供養曇無竭菩薩說法者，共汝植#98.89諸#98.90善根，為得如是等微妙清淨法，如汝所說。」
%93.183 （3）長者女明自心願
父母今聽我@t25p740a并五百侍女先所給者，亦聽我持眾妙花香、瓔珞、塗香、末香、衣服、幡蓋、伎樂、金、銀、琉璃供養之具，與薩陀波崙菩薩共去，供養般若波羅蜜及#98.91曇無竭菩薩說法者，為得如是等清淨微妙諸佛法故。』
%93.184 5、父母隨喜為法精進，隨其所欲滿其願
爾時，父母報女言：『汝所讚者，希有難及！說是善男子為法精進，大樂法相，及是諸佛法不可思議，一切世間最為第一，一切眾生歡喜#98.92因緣。是善男子為是法故大莊嚴，我等聽汝往見曇無竭菩薩，親近供養。汝發大心，為得#98.93諸佛法故如是精進，我等云何當不隨喜？』#98.94
是女為供養曇無竭菩薩故，得蒙聽許#98.95，報父母言：『我等亦隨是心歡喜，我終不斷人善法因緣。』#98.96
%93.185 （四）東往眾香城，為法尋善師
%93.186 1、備諸供具，往眾香城
是時，長者女莊嚴七寶車五百乘、身及侍女、種種寶物供養之具，持種種水陸生華，及金、銀、寶華、眾色寶衣、好香、擣#98.97香、澤香、瓔珞，及眾味飲食，共薩陀波~2819崙菩薩、五百侍女各載一車，恭敬圍繞，漸漸東去#98.98。
%93.187 2、見眾香城，清淨端嚴
見眾香城七寶莊嚴，七重圍繞；七寶之塹#98.99、七寶行樹，皆亦七重。其城縱廣十二由旬，豐樂安靜，甚可喜樂，人民熾盛。百#98.100千市里#98.101，街巷相當，端嚴#98.102如畫#98.103，橋津#98.104如地，寬博#98.105清淨。
%93.188 （五）到所至處，獻妙供養；見諸神異，發無上心
%93.189 1、見師說法眾圍繞，常啼眾等心歡喜
遙見眾香城，既入城中，見曇無竭菩薩坐高臺法座上，無量百千萬億眾#98.106恭敬圍繞說法。#98.107
薩陀波崙菩薩見曇無竭菩薩時，心即歡喜，譬如比丘入第三禪，攝心安隱；見已，作是念：『我等儀#98.108不應載車趣曇無竭菩薩。』#98.109作是念已，下車步進。長者女并五百侍女皆亦下車。薩陀波崙菩薩與長者女及五百侍女，眾寶莊嚴，圍繞恭敬，俱到曇無竭菩薩所。
%93.190 2、見眾寶莊嚴供養般若
%93.191 （1）見曇無竭菩薩以眾寶莊嚴供養般若
爾時，曇@t25p740b無竭菩薩摩訶薩有七寶臺，赤牛頭栴檀以為莊嚴，真珠羅網#98.110以覆臺上，四角皆懸摩尼#98.111寶珠以#98.112為燈明，及四寶香鑪#98.113常燒名#98.114香，為供養般~2820若波羅蜜故。其臺中有七寶大床#98.115、四寶小床，重敷其上；以黃金牒#98.116書《般若波羅蜜》，置小床上，種種幡蓋莊嚴垂覆其上。#98.117
薩陀波崙菩薩及諸女人見是妙臺眾寶嚴飾，及見釋提桓因與無量百千萬#98.118諸天以天曼陀羅花、碎末栴檀、磨眾寶屑以散臺上，鼓天伎#98.119樂於虛空中娛樂此臺。
%93.192 （2）帝釋言般若經尊勝，曇無竭菩薩以七寶印印之
爾時，薩陀波崙菩薩問釋提桓因：『憍尸迦！何因緣故，與無量百千萬諸天以天曼陀羅花、碎末栴檀、磨眾寶屑以散臺上，鼓天伎#98.120樂於虛空中娛樂此臺？』#98.121
釋提桓因答言：『汝善男子不知耶？此是《摩訶般若波羅蜜》，是諸菩薩摩訶薩母，能生諸佛、攝持菩薩。菩薩學是般若波羅蜜，成就一切功德#98.122，得諸佛法、一切種智。』#98.123
是時，薩陀波崙菩薩#98.124即歡喜悅樂，問釋提桓因：『憍尸迦！般若波羅蜜，諸菩薩摩訶薩母，能生諸佛、攝持菩薩。菩薩學是般若波羅蜜，成就一切功德，得諸佛法、一切種智，今在何處？』
釋提桓因言：『善男子！是臺中有七寶大床，四寶小床重敷其上；以黃金牒書《般若波羅蜜》，置小床上。曇無竭菩薩以七寶印印之，我等不能得開以示汝。』#98.125
~2821
%93.193 3、先供養般若，次為法供養說法師，見諸妙相發菩提心
是時，薩陀波崙與長者女及五百侍女取供養具──華香、瓔珞、幡蓋分作二分：一分供養《般若波羅蜜》，一分供養法座上曇無竭菩薩。
爾時，薩陀波崙菩薩與五百女人持華香、瓔珞、幡蓋、伎#98.126樂及諸珍寶，供養般若@t25p740c波羅蜜已，然後到曇無竭菩薩所。
到已，見曇無竭菩薩在法座上坐，以諸華香、瓔珞、擣香、澤香、金、銀、寶華、幡蓋、寶衣#98.127散其曇無竭菩薩#98.128上，為法故供養。
是時，諸#98.129華香、寶衣於曇無竭菩薩上虛空中化成華臺；碎末栴檀、寶屑、金、銀、寶華化成寶帳；寶帳之上，所散種種寶衣化為寶蓋，寶蓋四邊垂諸寶幡。
薩陀波崙及諸女人見曇無竭菩薩所作變化，皆#98.130大歡喜，作是念：『未曾有也！曇無竭大師神德乃爾！行菩薩道時，神通力尚能如是，何況得阿耨多羅三藐三菩提時！』
是時，長者女及五百女人清淨信心敬重曇無竭菩薩，皆發阿耨多羅三藐三菩提心，作是願言：『如曇無竭菩薩得菩薩諸深法，如曇無竭菩薩供養般若波羅蜜，如曇無竭菩薩於大眾中演說顯示般若波羅蜜義，如曇無竭菩薩得般若波羅蜜、方便力、成就神通、於菩薩事中得自在，我等亦當如是。』
%93.194 （六）禮敬善知識，面陳求法之意，請解心中疑惑
%93.195 1、禮敬善知識
是時，薩陀波崙菩薩及五百女人，華香、寶物供養般若波羅蜜及曇無竭菩薩已，頭面禮曇無竭菩薩，合掌#98.131恭敬，一面立。
%93.196 2、面陳求法之意
一面立已，白曇無竭菩薩言：『我本求般若波羅蜜時，於空閑林中，聞空中聲言：「善男子！汝從是東行，當得聞般若波羅蜜#98.132。」
我受是語東行，東行不久，作是念：「我何不問空中聲：『我當何處去？去是遠近？當從誰聞？』」
我是時大憂愁啼哭，於是處住七日七夜，憂愁故，乃至不念飲食，但念：「我何時當得聞般若波羅蜜？」我如是憂愁，一心念般若波羅蜜多#98.133，見佛身在虛空中，語我言：「善男子！汝大欲、大精進心莫放捨！以是大@t25p741a欲、大精進心，從是東~2822行，去是五百由旬，有城名眾香，是中有菩薩摩訶薩名曇無竭，從是人所，當得聞般若波羅蜜。是菩薩世世是汝善知識，常守護汝。」我從佛受教誨已，便東行，更無餘心#98.134，但念：「我何時當見曇無竭菩薩，為我說般若波羅蜜？」
我爾時中道住，於一切法中得無礙知見、得觀諸法性等諸三昧現在前；住是三昧已，見十方無量阿僧祇諸佛說是般若波羅蜜。#98.135
諸佛讚我言：「善哉！善哉！善男子！我本求般若波羅蜜時，得諸三昧，亦如汝今日。得是諸三昧已，遍得諸佛法。」
諸佛為我廣說法要#98.136，#98.137安慰我已，忽然不現。
我從三昧起，作是念：「諸佛從何處來？去至何所？」我不見諸佛故大愁憂#98.138，復作是念：「曇無竭菩薩供養先佛、植#98.139諸#98.140善根、久行般若波羅蜜、善知方便力，於菩薩道中得自在，是我善知識，守護我。我當問曇無竭菩薩是事：『諸佛從何所來？去至何所？』」
%93.197 3、請解心中疑惑
我今問大師：『是諸佛何處來、去至何#98.141處？大師！當#98.142為我說諸佛所從來、所至處，令我得知；知已，亦常不離見諸佛。』
^99.1
%93.320 （貳）明具足聞法#99.2
%93.321 一、斷疑生信報恩供養
%93.322 （一）正明斷疑
%93.323 1、明諸佛無所從來、去亦無所至
%93.324 （1）明法身義破有見
%93.325 A、正明
%93.326 （A）法說
爾時，曇無竭菩薩摩訶薩語薩陀波崙菩薩言：『善男子！諸佛無所從來，去亦無所至。何以故？諸法如不動相，諸法如即是佛。#99.3
善男子！無生法無來無去，無生法即是佛；無滅法無來無去，無滅法即是佛；實際法無來無去，實際法即是佛；空無來無去，空即是佛。善男子！無染無來無去，無染即是佛；寂滅無來無去，寂滅即是佛；虛空性無來無去，虛空性即是佛。
~2840善男子！離是諸法更無佛；諸佛如、諸法如，一如無分別。
善男子！是如常一，無二、無三，出諸數法，無所有故。#99.4
%93.327 （B）舉譬釋疑
%93.328 a、舉燄喻釋
譬如春末月，日中熱時，有人見焰動，逐之求水望得。於#99.5汝意云何？是水從何池、何山、何泉來？今何所去？若入東海、西#99.6海、南海、北海耶#99.7？』
薩陀波崙@t25p745a言：『大師！焰中尚無水，云何當有來處、去處？』
曇無竭菩薩語薩陀波崙菩薩言：『善男子！愚夫無智，為熱渴所逼，見焰動，無水生水想。
善男子！若#99.8有人分別諸佛有來有去，當知是人皆是愚夫。何以故？善男子！諸佛不可以色身見，諸佛法身無來無去，諸佛來處、去處亦如是。#99.9
%93.329 b、舉幻喻釋
善男子！譬如幻師幻作種種──若象、若馬、若牛、若羊、若男、若女，如是等種種諸物。於汝意云何？是幻事從何處來？去至何所？』
薩陀波崙菩薩言：『大師！幻事無實，云何當有來去處？』
『善男子！是人分別佛有來有去亦如是。
%93.330 c、舉夢喻釋
善男子！譬如夢中見若象、若馬、若牛、若羊、若男、若女。於汝意云何？夢中所見，有來處、有去處不？』
薩陀波崙言：『大師！是夢中所見虛妄，云何當有來去？』
『善男子！是人分別佛有來有去亦如是。
%93.331 B、結其得失
%93.332 （A）明失
善男子！佛說諸法如夢。
~2841若有眾生不知是諸#99.10法義，以名字色身著佛，是人分別諸佛有來有去，不知諸法實際相故，皆是愚夫無智之數。是#99.11人數數往來五道，遠離般若波羅蜜，遠離諸佛法。#99.12
%93.333 （B）明得
善男子！佛說諸法如幻、如夢。
若有眾生如實知，是人不分別諸法若來若去、若生若滅；若不分別諸法若來若去、若生若滅，則能知佛所說諸法實相。是人行般若波羅蜜，近阿耨多羅三藐三菩提，名為真佛弟子，不虛妄食人信施，是人應受供養，為世間福田。#99.13
%93.334 （2）辨應身義破無見
%93.335 A、舉海寶喻明感應因緣
善男子！譬如大海水中諸寶#99.14，不從東方來，不從南方、西方、北方、四維、上下來，眾生善根因緣故，海生此寶。此寶亦不無因緣而生，是寶皆#99.15從因緣和合生，是寶若滅亦不@t25p745b去至十方。諸緣合故有，諸緣離故滅。#99.16
善男子！諸佛身亦如是，從本業因緣果報生，生不從十方來，滅時亦不去至十方；~2842但諸緣合故有，諸緣離故滅。#99.17
%93.336 B、舉箜篌聲喻明因緣果
善男子！譬如箜篌#99.18聲，出時無來處，滅時無去處。眾緣和合故生──有槽#99.19、有頸#99.20、有皮、有絃#99.21、有柱、有棍#99.22，有人以手鼓之，眾緣和合而有聲；是聲亦不從槽出，不從頸出，不從皮出，不從絃出，不#99.23從柱出，不從棍出，亦不從人手出，眾緣和合爾乃有聲。是因緣離時，亦無去處。
善男子！諸佛身亦如是，從無量功德因緣生，不從一因一緣一功德生，亦不無因緣有，眾緣和合故有。諸佛身不獨從一事成，來無所從#99.24、去無所至。#99.25
%93.337 C、小結
善男子！應當如是知諸佛來相去相。#99.26
%93.338 2、明一切法亦無來去義
善男子！亦當知一切法無來去相。汝若知諸佛及諸法無來無去、無生無滅相，必得阿耨多羅三藐三菩提，亦能行般若波羅蜜及方便力。』#99.27
%93.339 （二）聞法生信，報恩供養
%93.340 1、帝釋愛樂佛道，以華與常啼，轉令供養曇無竭菩薩
爾時，釋提桓因#99.28以天曼陀羅花與薩陀波崙菩薩摩訶薩，作是言：『善男子！以是花~2843供養曇無竭菩薩摩訶薩，我#99.29當守護供養汝。所以者何#99.30？汝因緣力故，今日饒益百千萬億眾生，使#99.31得阿耨多羅三藐三菩提。
善男子！如是善人，甚為難遇！為饒益一切眾生故#99.32，無量阿僧祇劫受諸#99.33勤苦。』#99.34
%93.341 2、常啼獻華供養，復以身供養師
薩陀波崙菩薩摩訶薩受釋提桓因曼陀羅花，散曇無竭菩薩上，白言：『大師！我從今日以身屬#99.35師，供給供養。』如是三#99.36白已，合手#99.37師前立。
%93.342 3、長者女等亦以身供養常啼
是時，長者女及五百侍女白薩陀波崙菩薩言：『我等從今日亦以身屬師。我等以是善根因緣故，當得如是法，亦如師所得；共@t25p745c師世世供養諸佛，世世常供養師。』#99.38
是時，薩陀波崙菩薩語長者女及五百女人：『若汝等以誠心屬我者，我當受汝。』
諸女言：『我等以誠心屬師，當隨師教。』
%93.343 4、常啼獻己所有，帝釋喻同過去諸佛；曇無竭受已復還常啼，令其善根具足
是時，薩陀波崙菩薩及五百女人，并諸莊嚴寶物上妙供具及五百乘七寶車，奉上曇無竭菩薩，白言：『大師！我持是五百女人奉給大師，是五百乘車隨師所用。』
爾時，釋提桓因讚薩陀波崙菩薩言：『善哉！善哉！善男子！菩薩摩訶薩捨一切所有，應如是如是布施，疾得阿耨多羅三藐三菩提。作如是供養說法人，必得聞般若波羅蜜及方便力。過去諸佛本行菩薩道時，亦如是住布施中，得聞般若波羅蜜及方便力，得阿耨多羅三藐三菩提。』
爾時，曇無竭菩薩欲令薩陀波崙菩薩善根具足故，受五百乘車、長者女及五百侍女；受已，還與薩陀波崙菩薩。
~2844
%93.344 二、正說般若
%93.345 （一）曇無竭入定七年
%93.346 1、曇無竭七年入無量三昧及行般若
是時，曇無竭菩薩說法，日沒，起，入宮#99.39中。#99.40
薩陀波崙菩薩摩訶薩作是念：『我為法故來，不應坐、臥，當以二事──若行、若立，以待法師從宮中出說法。』
爾時，曇無竭菩薩七歲一心入無量阿僧祇菩薩三昧，及行般若波羅蜜、方便力。
%93.347 2、常啼七年間但念曇無竭出定說法
薩陀波崙菩薩七歲經行、住立，不坐、不臥，無有睡眠，無欲、恚、惱，心不著味；但念：『曇無竭菩薩摩訶薩何時當從三昧起，出而說法？』
%93.348 3、常啼敬愛師法故，欲淨法座；但惡魔隱蔽，令水不現，欲擾其心
薩陀波崙菩薩過七歲已，作是念：『我當為曇無竭菩薩摩訶薩敷說#99.41法座，曇無竭菩薩摩訶薩當坐上說法。我當灑#99.42地#99.43清淨，散種種華，莊嚴是處，為曇無竭菩薩摩訶薩當說般若波羅蜜及方便力故。』#99.44
是時，薩陀波崙菩#99.45薩與長者女及五百@t25p746a侍女為曇無竭菩薩摩訶薩敷七寶床，五百女人各脫上衣以敷座上，作是念：『曇無竭菩薩摩訶薩當坐此座上，說般若波羅蜜及方便力。』
薩陀波崙菩薩敷座已，求水灑地而不能得。所以者何？惡魔隱蔽#99.46，令水不現。魔作是念：『薩陀波崙菩薩求水不得，於阿耨多羅三藐三菩提行#99.47乃至生一念劣心、異心，則善根不增、智慧不照，於一切智而有稽留#99.48。』#99.49
~2845
%93.349 4、常啼刺身以血灑地，眾等皆無異心，魔不得便
爾時，薩陀波崙菩薩作是念：『我當自刺其身，以血灑地，令無塵土來坋#99.50大師。我何用此身！此身必當破壞。我從無始生死已來數數喪身，未曾為法。』即以利刀自刺，出血灑地。
薩陀波崙菩薩及長者女并五百侍女皆無異心，惡魔亦不能得便。#99.51
%93.350 5、帝釋讚歎常啼深心愛法，過去諸佛求般若亦如是
是時釋提桓因作是念：『未曾有也！薩陀波崙菩薩愛法乃爾，以刀自刺出血灑地！薩陀波崙及眾女人心不動轉，惡魔波旬不能壞其善根。其心堅固，發大莊嚴，不惜身命，以深心欲求阿耨多羅三藐三菩提，當度一切眾生無量生死苦。』#99.52
釋提桓因讚薩陀波崙菩薩言：『善哉！善哉！善男子！汝精進力大，堅固難動，不可思議！汝愛法、求法，最為無上！善男子！過去諸佛亦如是，以深心愛法、惜法、重法，集諸功德，得阿耨多羅三藐三菩提。』
%93.351 6、常啼欲以華作供養，帝釋與之
薩陀波崙菩薩作是念：『我為曇無竭菩薩摩訶薩敷法座，掃灑清淨已訖，當於何處得好名華莊嚴此地？若曇無竭菩薩摩訶薩法座上坐說法時，亦當散華供養。』
釋提桓因知薩陀波崙菩薩心所念，即以三千石#99.53天曼陀羅華與薩陀波崙。
薩陀波崙受華#99.54，以半散@t25p746b地，留半待曇無竭菩薩摩訶薩坐法座上說法時當供養。
%93.352 （二）曇無竭出定，正為說法
%93.353 1、曇無竭出定，至法座，欲說般若；常啼心樂如入第三禪
爾時，曇無竭菩薩摩訶薩過七歲已，從諸三昧起，為說般若波羅蜜故，與無量百千~2846萬眾恭敬圍遶，往法座上坐。
薩陀波崙菩薩摩訶薩見曇無竭菩薩摩訶薩時，心淨#99.55悅樂，譬如比丘入第三禪。
^100.1
#100.2
$$二、正說般若（承上卷99）
$$（一）曇無竭入定七年（承上卷99）
$$（二）曇無竭出定，正為說法（承上卷99）
$$1、曇無竭出定，至法座，欲說般若；常啼心樂如入第三禪（承上卷99）
%93.480 2、正為說法
%93.481 （1）命諦聽受
爾時，薩陀波崙菩薩摩訶薩及長者女并五百侍女到曇無竭菩薩摩訶薩所，散天曼陀羅華，頭面禮畢，退坐一面。
曇無竭菩薩見其坐已，告薩陀波崙菩薩#100.3言：『善男子！諦聽！諦受#100.4！今當為汝說般若波羅蜜相。
%93.482 （2）就諸法異相以明般若
[No.1]善男子！@t25p750c諸法等故，當知般若波羅蜜亦等。#100.5
[No.2]諸法離故，當知般若波羅蜜亦離。
[No.3]諸法不動故，當知般若波羅蜜亦不動。
[No.4]諸法無念故，當知般若波羅蜜亦無念。
[No.5]諸法無畏故，當知般若波羅蜜亦無畏。
[No.6]諸法一味故，當知般若波羅蜜亦一味。
[No.7]諸法無邊故，當知般若波羅蜜亦無邊。#100.6
[No.8]諸法無生故，當知般若波羅蜜亦無生；
[No.9]諸法無滅故，當知般若波羅蜜亦無滅。
[No.10]虛空無邊故，當知般若波羅蜜亦無邊。#100.7
~2865[No.11]大海水無邊故，當知般若波羅蜜亦無邊。
[No.12]須彌山莊嚴故，當知般若波羅蜜亦莊嚴。
[No.13]虛空無分別故，當知般若波羅蜜亦無分別。#100.8
[No.14-No.18]色無邊故，當知般若波羅蜜亦無邊；受、想、行、識無邊故，當知般若波羅蜜亦無邊。
[No.19-No.23]地種無邊故，當知般若波羅蜜亦無邊；水種、火種、風種無邊故，當知般若波羅蜜亦無邊；空種無邊故，當知般若波羅蜜亦無邊。#100.9
[No.25]如金鋼#100.10等故，當知般若波羅蜜亦等。#100.11
[No.26]諸法無分別故，當知般若波羅蜜亦無分別。
[No.27]諸法性不可得故，當知般若波羅蜜性亦不可得。#100.12
[No.28]諸法無所有等故，當知般若波羅蜜亦無所有等。#100.13
[No.29]諸法無作故，當知般若波羅蜜亦無作。
[No.30]諸法不可思議故，當知般若波羅蜜亦不可思議。』
%93.483 三、依所聞法，得諸三昧
是時，薩陀波崙菩薩摩訶薩即於座上#100.14得諸三昧，所謂[No.1]諸法等三昧，[No.2]諸法離三昧，[No.5]諸法無畏三昧，[No.6]諸法一味三昧，[No.7]諸法無邊三昧，[No.8]諸法無生三昧，[No.9]諸法無滅三昧，[No.10]虛空無邊三昧，[No.11]大海水無邊三昧，[No.12]須彌山莊嚴三昧，[No.13]虛空無分別三昧，[No.14]色無邊三昧，[No.15-18]受、想、行、識無邊三昧；[No.19]地種無邊三昧，[No.20-23]水種、火種、風@t25p751a種、空種無邊三昧；[No.25]如金鋼等三昧，[No.26]諸法無分別三昧，[No.30]諸法不可思議三昧──如是等，得六百萬諸三昧門。」#100.15
%93.484 四、明得三昧、智慧之今世及後世果報
%93.485 （一）今世果德
~2866
%93.486 1、見十方諸佛，同說般若法
爾時，佛告須菩提：「如我今於三千大千世界中與諸比丘僧圍繞，以是相、以是像貌#100.16、以是名字說般若波羅蜜。
薩陀波崙得是#100.17六百萬三昧門，見東方#100.18、南西北方、四維、上下如恒#100.19河沙等三千大千世界中諸佛與諸比丘恭敬圍繞，以如是相、以是像貌#100.20、以是名字說是摩訶般若波羅蜜亦如是。#100.21
%93.487 2、多聞智慧廣，常不離諸佛
薩陀波崙菩薩從是已後，多聞、智慧不可思議，如大海水；常不離諸佛，生於有佛土#100.22中。#100.23
%93.488 （二）後世果德：乃至睡夢中亦不離見佛；眾難悉斷除，隨願生佛國
乃至夢中未曾不見佛時；一切眾難皆悉已斷，在所佛土隨願往生。
%93.489 參、結勸修行
%93.490 （壹）歎般若之功──能成菩薩眾德，令得一切種智
須菩提！當知是般若波羅蜜因緣，能成就菩薩摩訶薩一切功德，得一切種智。
以是故，須菩提！諸菩薩摩訶薩若欲學六波羅蜜、欲#100.24深入諸佛智慧、欲得一切種智，應受持是#100.25般若波羅蜜，誦、讀#100.26、正憶念、廣為#100.27人說，亦書寫經卷，供養、尊重、讚歎，香華乃至妓#100.28樂。
%93.491 （貳）釋能益之因：般若為三世十方諸佛母
何以故？般若波羅蜜是過去、未來、現在十方諸佛母，#100.29十方諸佛所尊重故。」
^100.2
%94.0 壹、付囑流通般若波羅蜜#100.138
%94.1 （壹）殷勤付囑阿難令尊重供養
爾時，佛告阿難：「於汝意云何？佛是汝大師@t25p754b不？汝是佛弟子不？」
阿難言：「世尊！佛是我大師，脩伽陀#100.139是我大師，我是佛弟子。」
佛言：「如是！如是！我是汝大師，汝是我弟子。若如弟子所應作者，汝已作竟。
阿難！汝用身、口、意慈業供養供給我，亦常如我意，無有違失。
阿難！我身現在，汝愛敬供養供給，心常#100.140清淨；我滅度後，是一切愛敬、供養、供給事，當愛敬、供養般若波羅蜜！乃至第二、第三，以般若波羅蜜囑累#100.141汝。#100.142
%94.2 （貳）付囑阿難，令流通不絕
阿難！汝莫忘莫失，莫作最後斷種人！
%94.3 （參）明付囑之意
阿難！隨爾所時般若波羅蜜在世，當知爾所時有佛在世說法。
阿難！若有書般若波羅蜜，受持、讀、誦#100.143、正憶念、為人廣說，恭敬、尊重、讚歎，華香、幡蓋、寶衣、燈燭種種供養，當知是人不離見佛、不離聞法、常親近佛。」
%94.4 貳、大眾歡喜奉行
佛說般若波羅蜜已，彌勒等諸菩薩摩訶薩、慧命須菩提、舍利弗、大目犍#100.144連、摩訶迦葉、富樓那彌多隷#100.145耶#100.146尼子、摩訶俱#100.147絺羅、摩訶迦旃延、阿難等，并一切大眾，及~2880一切世間諸天、人、犍#100.148闥婆、阿修羅等，聞佛所說，皆大歡喜。`)